apache/nuttx/arch/arm/src/s32k3xx/hardware/s32k3xx_flexcan.h
/****************************************************************************
 * arch/arm/src/s32k3xx/hardware/s32k3xx_flexcan.h
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

/* Copyright 2022 NXP */

#ifndef __ARCH_ARM_SRC_S32K3XX_HARDWARE_S32K3XX_CAN_H
#define __ARCH_ARM_SRC_S32K3XX_HARDWARE_S32K3XX_CAN_H

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <hardware/s32k3xx_memorymap.h>

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* FlexCAN Register Offsets *************************************************/

#define S32K3XX_CAN_MCR_OFFSET               (0x0000) /* Module Configuration Register (MCR) */
#define S32K3XX_CAN_CTRL1_OFFSET             (0x0004) /* Control 1 Register (CTRL1) */
#define S32K3XX_CAN_TIMER_OFFSET             (0x0008) /* Free Running Timer (TIMER) */
#define S32K3XX_CAN_RXMGMASK_OFFSET          (0x0010) /* Rx Mailboxes Global Mask Register (RXMGMASK) */
#define S32K3XX_CAN_RX14MASK_OFFSET          (0x0014) /* Rx 14 Mask Register (RX14MASK) */
#define S32K3XX_CAN_RX15MASK_OFFSET          (0x0018) /* Rx 15 Mask Register (RX15MASK) */
#define S32K3XX_CAN_ECR_OFFSET               (0x001c) /* Error Counter (ECR) */
#define S32K3XX_CAN_ESR1_OFFSET              (0x0020) /* Error and Status 1 Register (ESR1) */
#define S32K3XX_CAN_IMASK2_OFFSET            (0x0024) /* Interrupt Masks 2 Register (IMASK2) */
#define S32K3XX_CAN_IMASK1_OFFSET            (0x0028) /* Interrupt Masks 1 Register (IMASK1) */
#define S32K3XX_CAN_IFLAG2_OFFSET            (0x002c) /* Interrupt Flags 2 Register (IFLAG2) */
#define S32K3XX_CAN_IFLAG1_OFFSET            (0x0030) /* Interrupt Flags 1 Register (IFLAG1) */
#define S32K3XX_CAN_CTRL2_OFFSET             (0x0034) /* Control 2 Register (CTRL2) */
#define S32K3XX_CAN_ESR2_OFFSET              (0x0038) /* Error and Status 2 Register (ESR2) */
#define S32K3XX_CAN_CRCR_OFFSET              (0x0044) /* CRC Register (CRCR) */
#define S32K3XX_CAN_RXFGMASK_OFFSET          (0x0048) /* Legacy Rx FIFO Global Mask Register (RXFGMASK) */
#define S32K3XX_CAN_RXFIR_OFFSET             (0x004c) /* Legacy Rx FIFO Information Register (RXFIR) */
#define S32K3XX_CAN_CBT_OFFSET               (0x0050) /* CAN Bit Timing register (CBT) */
#define S32K3XX_CAN_IMASK3_OFFSET            (0x006c) /* Interrupt Masks 3 Register (IMASK3) */
#define S32K3XX_CAN_IFLAG3_OFFSET            (0x0074) /* Interrupt Flags 3 Register (IFLAG3) */

#define S32K3XX_CAN_MB_OFFSET                (0x0080) /* CAN MB RAM */

#define S32K3XX_CAN_RXIMR_OFFSET(n)          (0x0880 + ((n) << 2))
#  define S32K3XX_CAN_RXIMR0_OFFSET          (0x0880) /* Rx Individual Mask Register 0 (RXIMR0) */
#  define S32K3XX_CAN_RXIMR1_OFFSET          (0x0884) /* Rx Individual Mask Register 1 (RXIMR1) */
#  define S32K3XX_CAN_RXIMR2_OFFSET          (0x0888) /* Rx Individual Mask Register 2 (RXIMR2) */
#  define S32K3XX_CAN_RXIMR3_OFFSET          (0x088c) /* Rx Individual Mask Register 3 (RXIMR3) */
#  define S32K3XX_CAN_RXIMR4_OFFSET          (0x0890) /* Rx Individual Mask Register 4 (RXIMR4) */
#  define S32K3XX_CAN_RXIMR5_OFFSET          (0x0894) /* Rx Individual Mask Register 5 (RXIMR5) */
#  define S32K3XX_CAN_RXIMR6_OFFSET          (0x0898) /* Rx Individual Mask Register 6 (RXIMR6) */
#  define S32K3XX_CAN_RXIMR7_OFFSET          (0x089c) /* Rx Individual Mask Register 7 (RXIMR7) */
#  define S32K3XX_CAN_RXIMR8_OFFSET          (0x08a0) /* Rx Individual Mask Register 8 (RXIMR8) */
#  define S32K3XX_CAN_RXIMR9_OFFSET          (0x08a4) /* Rx Individual Mask Register 9 (RXIMR9) */
#  define S32K3XX_CAN_RXIMR10_OFFSET         (0x08a8) /* Rx Individual Mask Register 10 (RXIMR10) */
#  define S32K3XX_CAN_RXIMR11_OFFSET         (0x08ac) /* Rx Individual Mask Register 11 (RXIMR11) */
#  define S32K3XX_CAN_RXIMR12_OFFSET         (0x08b0) /* Rx Individual Mask Register 12 (RXIMR12) */
#  define S32K3XX_CAN_RXIMR13_OFFSET         (0x08b4) /* Rx Individual Mask Register 13 (RXIMR13) */
#  define S32K3XX_CAN_RXIMR14_OFFSET         (0x08b8) /* Rx Individual Mask Register 14 (RXIMR14) */
#  define S32K3XX_CAN_RXIMR15_OFFSET         (0x08bc) /* Rx Individual Mask Register 15 (RXIMR15) */
#  define S32K3XX_CAN_RXIMR16_OFFSET         (0x08c0) /* Rx Individual Mask Register 16 (RXIMR16) */
#  define S32K3XX_CAN_RXIMR17_OFFSET         (0x08c4) /* Rx Individual Mask Register 17 (RXIMR17) */
#  define S32K3XX_CAN_RXIMR18_OFFSET         (0x08c8) /* Rx Individual Mask Register 18 (RXIMR18) */
#  define S32K3XX_CAN_RXIMR19_OFFSET         (0x08cc) /* Rx Individual Mask Register 19 (RXIMR19) */
#  define S32K3XX_CAN_RXIMR20_OFFSET         (0x08d0) /* Rx Individual Mask Register 20 (RXIMR20) */
#  define S32K3XX_CAN_RXIMR21_OFFSET         (0x08d4) /* Rx Individual Mask Register 21 (RXIMR21) */
#  define S32K3XX_CAN_RXIMR22_OFFSET         (0x08d8) /* Rx Individual Mask Register 22 (RXIMR22) */
#  define S32K3XX_CAN_RXIMR23_OFFSET         (0x08dc) /* Rx Individual Mask Register 23 (RXIMR23) */
#  define S32K3XX_CAN_RXIMR24_OFFSET         (0x08e0) /* Rx Individual Mask Register 24 (RXIMR24) */
#  define S32K3XX_CAN_RXIMR25_OFFSET         (0x08e4) /* Rx Individual Mask Register 25 (RXIMR25) */
#  define S32K3XX_CAN_RXIMR26_OFFSET         (0x08e8) /* Rx Individual Mask Register 26 (RXIMR26) */
#  define S32K3XX_CAN_RXIMR27_OFFSET         (0x08ec) /* Rx Individual Mask Register 27 (RXIMR27) */
#  define S32K3XX_CAN_RXIMR28_OFFSET         (0x08f0) /* Rx Individual Mask Register 28 (RXIMR28) */
#  define S32K3XX_CAN_RXIMR29_OFFSET         (0x08f4) /* Rx Individual Mask Register 29 (RXIMR29) */
#  define S32K3XX_CAN_RXIMR30_OFFSET         (0x08f8) /* Rx Individual Mask Register 30 (RXIMR30) */
#  define S32K3XX_CAN_RXIMR31_OFFSET         (0x08fc) /* Rx Individual Mask Register 31 (RXIMR31) */
#  define S32K3XX_CAN_RXIMR32_OFFSET         (0x0900) /* Rx Individual Mask Register 32 (RXIMR32) */
#  define S32K3XX_CAN_RXIMR33_OFFSET         (0x0904) /* Rx Individual Mask Register 33 (RXIMR33) */
#  define S32K3XX_CAN_RXIMR34_OFFSET         (0x0908) /* Rx Individual Mask Register 34 (RXIMR34) */
#  define S32K3XX_CAN_RXIMR35_OFFSET         (0x090c) /* Rx Individual Mask Register 35 (RXIMR35) */
#  define S32K3XX_CAN_RXIMR36_OFFSET         (0x0910) /* Rx Individual Mask Register 36 (RXIMR36) */
#  define S32K3XX_CAN_RXIMR37_OFFSET         (0x0914) /* Rx Individual Mask Register 37 (RXIMR37) */
#  define S32K3XX_CAN_RXIMR38_OFFSET         (0x0918) /* Rx Individual Mask Register 38 (RXIMR38) */
#  define S32K3XX_CAN_RXIMR39_OFFSET         (0x091c) /* Rx Individual Mask Register 39 (RXIMR39) */
#  define S32K3XX_CAN_RXIMR40_OFFSET         (0x0920) /* Rx Individual Mask Register 40 (RXIMR40) */
#  define S32K3XX_CAN_RXIMR41_OFFSET         (0x0924) /* Rx Individual Mask Register 41 (RXIMR41) */
#  define S32K3XX_CAN_RXIMR42_OFFSET         (0x0928) /* Rx Individual Mask Register 42 (RXIMR42) */
#  define S32K3XX_CAN_RXIMR43_OFFSET         (0x092c) /* Rx Individual Mask Register 43 (RXIMR43) */
#  define S32K3XX_CAN_RXIMR44_OFFSET         (0x0930) /* Rx Individual Mask Register 44 (RXIMR44) */
#  define S32K3XX_CAN_RXIMR45_OFFSET         (0x0934) /* Rx Individual Mask Register 45 (RXIMR45) */
#  define S32K3XX_CAN_RXIMR46_OFFSET         (0x0938) /* Rx Individual Mask Register 46 (RXIMR46) */
#  define S32K3XX_CAN_RXIMR47_OFFSET         (0x093c) /* Rx Individual Mask Register 47 (RXIMR47) */
#  define S32K3XX_CAN_RXIMR48_OFFSET         (0x0940) /* Rx Individual Mask Register 48 (RXIMR48) */
#  define S32K3XX_CAN_RXIMR49_OFFSET         (0x0944) /* Rx Individual Mask Register 49 (RXIMR49) */
#  define S32K3XX_CAN_RXIMR50_OFFSET         (0x0948) /* Rx Individual Mask Register 50 (RXIMR50) */
#  define S32K3XX_CAN_RXIMR51_OFFSET         (0x094c) /* Rx Individual Mask Register 51 (RXIMR51) */
#  define S32K3XX_CAN_RXIMR52_OFFSET         (0x0950) /* Rx Individual Mask Register 52 (RXIMR52) */
#  define S32K3XX_CAN_RXIMR53_OFFSET         (0x0954) /* Rx Individual Mask Register 53 (RXIMR53) */
#  define S32K3XX_CAN_RXIMR54_OFFSET         (0x0958) /* Rx Individual Mask Register 54 (RXIMR54) */
#  define S32K3XX_CAN_RXIMR55_OFFSET         (0x095c) /* Rx Individual Mask Register 55 (RXIMR55) */
#  define S32K3XX_CAN_RXIMR56_OFFSET         (0x0960) /* Rx Individual Mask Register 56 (RXIMR56) */
#  define S32K3XX_CAN_RXIMR57_OFFSET         (0x0964) /* Rx Individual Mask Register 57 (RXIMR57) */
#  define S32K3XX_CAN_RXIMR58_OFFSET         (0x0968) /* Rx Individual Mask Register 58 (RXIMR58) */
#  define S32K3XX_CAN_RXIMR59_OFFSET         (0x096c) /* Rx Individual Mask Register 59 (RXIMR59) */
#  define S32K3XX_CAN_RXIMR60_OFFSET         (0x0970) /* Rx Individual Mask Register 60 (RXIMR60) */
#  define S32K3XX_CAN_RXIMR61_OFFSET         (0x0974) /* Rx Individual Mask Register 61 (RXIMR61) */
#  define S32K3XX_CAN_RXIMR62_OFFSET         (0x0978) /* Rx Individual Mask Register 62 (RXIMR62) */
#  define S32K3XX_CAN_RXIMR63_OFFSET         (0x097c) /* Rx Individual Mask Register 63 (RXIMR63) */
#  define S32K3XX_CAN_RXIMR64_OFFSET         (0x0980) /* Rx Individual Mask Register 64 (RXIMR64) */
#  define S32K3XX_CAN_RXIMR65_OFFSET         (0x0984) /* Rx Individual Mask Register 65 (RXIMR65) */
#  define S32K3XX_CAN_RXIMR66_OFFSET         (0x0988) /* Rx Individual Mask Register 66 (RXIMR66) */
#  define S32K3XX_CAN_RXIMR67_OFFSET         (0x098c) /* Rx Individual Mask Register 67 (RXIMR67) */
#  define S32K3XX_CAN_RXIMR68_OFFSET         (0x0990) /* Rx Individual Mask Register 68 (RXIMR68) */
#  define S32K3XX_CAN_RXIMR69_OFFSET         (0x0994) /* Rx Individual Mask Register 69 (RXIMR69) */
#  define S32K3XX_CAN_RXIMR70_OFFSET         (0x0998) /* Rx Individual Mask Register 70 (RXIMR70) */
#  define S32K3XX_CAN_RXIMR71_OFFSET         (0x099c) /* Rx Individual Mask Register 71 (RXIMR71) */
#  define S32K3XX_CAN_RXIMR72_OFFSET         (0x09a0) /* Rx Individual Mask Register 72 (RXIMR72) */
#  define S32K3XX_CAN_RXIMR73_OFFSET         (0x09a4) /* Rx Individual Mask Register 73 (RXIMR73) */
#  define S32K3XX_CAN_RXIMR74_OFFSET         (0x09a8) /* Rx Individual Mask Register 74 (RXIMR74) */
#  define S32K3XX_CAN_RXIMR75_OFFSET         (0x09ac) /* Rx Individual Mask Register 75 (RXIMR75) */
#  define S32K3XX_CAN_RXIMR76_OFFSET         (0x09b0) /* Rx Individual Mask Register 76 (RXIMR76) */
#  define S32K3XX_CAN_RXIMR77_OFFSET         (0x09b4) /* Rx Individual Mask Register 77 (RXIMR77) */
#  define S32K3XX_CAN_RXIMR78_OFFSET         (0x09b8) /* Rx Individual Mask Register 78 (RXIMR78) */
#  define S32K3XX_CAN_RXIMR79_OFFSET         (0x09bc) /* Rx Individual Mask Register 79 (RXIMR79) */
#  define S32K3XX_CAN_RXIMR80_OFFSET         (0x09c0) /* Rx Individual Mask Register 80 (RXIMR80) */
#  define S32K3XX_CAN_RXIMR81_OFFSET         (0x09c4) /* Rx Individual Mask Register 81 (RXIMR81) */
#  define S32K3XX_CAN_RXIMR82_OFFSET         (0x09c8) /* Rx Individual Mask Register 82 (RXIMR82) */
#  define S32K3XX_CAN_RXIMR83_OFFSET         (0x09cc) /* Rx Individual Mask Register 83 (RXIMR83) */
#  define S32K3XX_CAN_RXIMR84_OFFSET         (0x09d0) /* Rx Individual Mask Register 84 (RXIMR84) */
#  define S32K3XX_CAN_RXIMR85_OFFSET         (0x09d4) /* Rx Individual Mask Register 85 (RXIMR85) */
#  define S32K3XX_CAN_RXIMR86_OFFSET         (0x09d8) /* Rx Individual Mask Register 86 (RXIMR86) */
#  define S32K3XX_CAN_RXIMR87_OFFSET         (0x09dc) /* Rx Individual Mask Register 87 (RXIMR87) */
#  define S32K3XX_CAN_RXIMR88_OFFSET         (0x09e0) /* Rx Individual Mask Register 88 (RXIMR88) */
#  define S32K3XX_CAN_RXIMR89_OFFSET         (0x09e4) /* Rx Individual Mask Register 89 (RXIMR89) */
#  define S32K3XX_CAN_RXIMR90_OFFSET         (0x09e8) /* Rx Individual Mask Register 90 (RXIMR90) */
#  define S32K3XX_CAN_RXIMR91_OFFSET         (0x09ec) /* Rx Individual Mask Register 91 (RXIMR91) */
#  define S32K3XX_CAN_RXIMR92_OFFSET         (0x09f0) /* Rx Individual Mask Register 92 (RXIMR92) */
#  define S32K3XX_CAN_RXIMR93_OFFSET         (0x09f4) /* Rx Individual Mask Register 93 (RXIMR93) */
#  define S32K3XX_CAN_RXIMR94_OFFSET         (0x09f8) /* Rx Individual Mask Register 94 (RXIMR94) */
#  define S32K3XX_CAN_RXIMR95_OFFSET         (0x09fc) /* Rx Individual Mask Register 95 (RXIMR95) */
#define S32K3XX_CAN_RXIMR_COUNT              (96)     /* Individual Mask Register Count */

#define S32K3XX_CAN_MECR_OFFSET              (0x0ae0) /* Memory Error Control Register (MECR) */
#define S32K3XX_CAN_ERRIAR_OFFSET            (0x0ae4) /* Error Injection Address Register (ERRIAR) */
#define S32K3XX_CAN_ERRIDPR_OFFSET           (0x0ae8) /* Error Injection Data Pattern Register (ERRIDPR) */
#define S32K3XX_CAN_ERRIPPR_OFFSET           (0x0aec) /* Error Injection Parity Pattern Register (ERRIPPR) */
#define S32K3XX_CAN_RERRAR_OFFSET            (0x0af0) /* Error Report Address Register (RERRAR) */
#define S32K3XX_CAN_RERRDR_OFFSET            (0x0af4) /* Error Report Data Register (RERRDR) */
#define S32K3XX_CAN_RERRSYNR_OFFSET          (0x0af8) /* Error Report Syndrome Register (RERRSYNR) */
#define S32K3XX_CAN_ERRSR_OFFSET             (0x0afc) /* Error Status Register (ERRSR) */
#define S32K3XX_CAN_EPRS_OFFSET              (0x0bf0) /* Enhanced CAN Bit Timing Prescalers (EPRS) */
#define S32K3XX_CAN_ENCBT_OFFSET             (0x0bf4) /* Enhanced Nominal CAN Bit Timing (ENCBT) */
#define S32K3XX_CAN_EDCBT_OFFSET             (0x0bf8) /* Enhanced Data Phase CAN Bit Timing (EDCBT) */
#define S32K3XX_CAN_ETDC_OFFSET              (0x0bfc) /* Enhanced Transceiver Delay Compensation (ETDC) */
#define S32K3XX_CAN_FDCTRL_OFFSET            (0x0c00) /* CAN FD Control Register (FDCTRL) */
#define S32K3XX_CAN_FDCBT_OFFSET             (0x0c04) /* CAN FD Bit Timing Register (FDCBT) */
#define S32K3XX_CAN_FDCRC_OFFSET             (0x0c08) /* CAN FD CRC Register (FDCRC) */
#define S32K3XX_CAN_ERFCR_OFFSET             (0x0c0c) /* Enhanced Rx FIFO Control Register (ERFCR) */
#define S32K3XX_CAN_ERFIER_OFFSET            (0x0c10) /* Enhanced Rx FIFO Interrupt Enable Register (ERFIER) */
#define S32K3XX_CAN_ERFSR_OFFSET             (0x0c14) /* Enhanced Rx FIFO Status Register (ERFSR) */

