apache/nuttx/arch/arm/src/s32k3xx/hardware/s32k3xx_flexcan.h
#define S32K3XX_CAN_HR_TIME_STAMP_OFFSET(n)  (0x0c30 + ((n) << 2))
#  define S32K3XX_CAN_HR_TIME_STAMP0_OFFSET  (0x0c30) /* High Resolution Time Stamp 0 (HR_TIME_STAMP0) */
#  define S32K3XX_CAN_HR_TIME_STAMP1_OFFSET  (0x0c34) /* High Resolution Time Stamp 1 (HR_TIME_STAMP1) */
#  define S32K3XX_CAN_HR_TIME_STAMP2_OFFSET  (0x0c38) /* High Resolution Time Stamp 2 (HR_TIME_STAMP2) */
#  define S32K3XX_CAN_HR_TIME_STAMP3_OFFSET  (0x0c3c) /* High Resolution Time Stamp 3 (HR_TIME_STAMP3) */
#  define S32K3XX_CAN_HR_TIME_STAMP4_OFFSET  (0x0c40) /* High Resolution Time Stamp 4 (HR_TIME_STAMP4) */
#  define S32K3XX_CAN_HR_TIME_STAMP5_OFFSET  (0x0c44) /* High Resolution Time Stamp 5 (HR_TIME_STAMP5) */
#  define S32K3XX_CAN_HR_TIME_STAMP6_OFFSET  (0x0c48) /* High Resolution Time Stamp 6 (HR_TIME_STAMP6) */
#  define S32K3XX_CAN_HR_TIME_STAMP7_OFFSET  (0x0c4c) /* High Resolution Time Stamp 7 (HR_TIME_STAMP7) */
#  define S32K3XX_CAN_HR_TIME_STAMP8_OFFSET  (0x0c50) /* High Resolution Time Stamp 8 (HR_TIME_STAMP8) */
#  define S32K3XX_CAN_HR_TIME_STAMP9_OFFSET  (0x0c54) /* High Resolution Time Stamp 9 (HR_TIME_STAMP9) */
#  define S32K3XX_CAN_HR_TIME_STAMP10_OFFSET (0x0c58) /* High Resolution Time Stamp 10 (HR_TIME_STAMP10) */
#  define S32K3XX_CAN_HR_TIME_STAMP11_OFFSET (0x0c5c) /* High Resolution Time Stamp 11 (HR_TIME_STAMP11) */
#  define S32K3XX_CAN_HR_TIME_STAMP12_OFFSET (0x0c60) /* High Resolution Time Stamp 12 (HR_TIME_STAMP12) */
#  define S32K3XX_CAN_HR_TIME_STAMP13_OFFSET (0x0c64) /* High Resolution Time Stamp 13 (HR_TIME_STAMP13) */
#  define S32K3XX_CAN_HR_TIME_STAMP14_OFFSET (0x0c68) /* High Resolution Time Stamp 14 (HR_TIME_STAMP14) */
#  define S32K3XX_CAN_HR_TIME_STAMP15_OFFSET (0x0c6c) /* High Resolution Time Stamp 15 (HR_TIME_STAMP15) */
#  define S32K3XX_CAN_HR_TIME_STAMP16_OFFSET (0x0c70) /* High Resolution Time Stamp 16 (HR_TIME_STAMP16) */
#  define S32K3XX_CAN_HR_TIME_STAMP17_OFFSET (0x0c74) /* High Resolution Time Stamp 17 (HR_TIME_STAMP17) */
#  define S32K3XX_CAN_HR_TIME_STAMP18_OFFSET (0x0c78) /* High Resolution Time Stamp 18 (HR_TIME_STAMP18) */
#  define S32K3XX_CAN_HR_TIME_STAMP19_OFFSET (0x0c7c) /* High Resolution Time Stamp 19 (HR_TIME_STAMP19) */
#  define S32K3XX_CAN_HR_TIME_STAMP20_OFFSET (0x0c80) /* High Resolution Time Stamp 20 (HR_TIME_STAMP20) */
#  define S32K3XX_CAN_HR_TIME_STAMP21_OFFSET (0x0c84) /* High Resolution Time Stamp 21 (HR_TIME_STAMP21) */
#  define S32K3XX_CAN_HR_TIME_STAMP22_OFFSET (0x0c88) /* High Resolution Time Stamp 22 (HR_TIME_STAMP22) */
#  define S32K3XX_CAN_HR_TIME_STAMP23_OFFSET (0x0c8c) /* High Resolution Time Stamp 23 (HR_TIME_STAMP23) */
#  define S32K3XX_CAN_HR_TIME_STAMP24_OFFSET (0x0c90) /* High Resolution Time Stamp 24 (HR_TIME_STAMP24) */
#  define S32K3XX_CAN_HR_TIME_STAMP25_OFFSET (0x0c94) /* High Resolution Time Stamp 25 (HR_TIME_STAMP25) */
#  define S32K3XX_CAN_HR_TIME_STAMP26_OFFSET (0x0c98) /* High Resolution Time Stamp 26 (HR_TIME_STAMP26) */
#  define S32K3XX_CAN_HR_TIME_STAMP27_OFFSET (0x0c9c) /* High Resolution Time Stamp 27 (HR_TIME_STAMP27) */
#  define S32K3XX_CAN_HR_TIME_STAMP28_OFFSET (0x0ca0) /* High Resolution Time Stamp 28 (HR_TIME_STAMP28) */
#  define S32K3XX_CAN_HR_TIME_STAMP29_OFFSET (0x0ca4) /* High Resolution Time Stamp 29 (HR_TIME_STAMP29) */
#  define S32K3XX_CAN_HR_TIME_STAMP30_OFFSET (0x0ca8) /* High Resolution Time Stamp 30 (HR_TIME_STAMP30) */
#  define S32K3XX_CAN_HR_TIME_STAMP31_OFFSET (0x0cac) /* High Resolution Time Stamp 31 (HR_TIME_STAMP31) */
#  define S32K3XX_CAN_HR_TIME_STAMP32_OFFSET (0x0cb0) /* High Resolution Time Stamp 32 (HR_TIME_STAMP32) */
#  define S32K3XX_CAN_HR_TIME_STAMP33_OFFSET (0x0cb4) /* High Resolution Time Stamp 33 (HR_TIME_STAMP33) */
#  define S32K3XX_CAN_HR_TIME_STAMP34_OFFSET (0x0cb8) /* High Resolution Time Stamp 34 (HR_TIME_STAMP34) */
#  define S32K3XX_CAN_HR_TIME_STAMP35_OFFSET (0x0cbc) /* High Resolution Time Stamp 35 (HR_TIME_STAMP35) */
#  define S32K3XX_CAN_HR_TIME_STAMP36_OFFSET (0x0cc0) /* High Resolution Time Stamp 36 (HR_TIME_STAMP36) */
#  define S32K3XX_CAN_HR_TIME_STAMP37_OFFSET (0x0cc4) /* High Resolution Time Stamp 37 (HR_TIME_STAMP37) */
#  define S32K3XX_CAN_HR_TIME_STAMP38_OFFSET (0x0cc8) /* High Resolution Time Stamp 38 (HR_TIME_STAMP38) */
#  define S32K3XX_CAN_HR_TIME_STAMP39_OFFSET (0x0ccc) /* High Resolution Time Stamp 39 (HR_TIME_STAMP39) */
#  define S32K3XX_CAN_HR_TIME_STAMP40_OFFSET (0x0cd0) /* High Resolution Time Stamp 40 (HR_TIME_STAMP40) */
#  define S32K3XX_CAN_HR_TIME_STAMP41_OFFSET (0x0cd4) /* High Resolution Time Stamp 41 (HR_TIME_STAMP41) */
#  define S32K3XX_CAN_HR_TIME_STAMP42_OFFSET (0x0cd8) /* High Resolution Time Stamp 42 (HR_TIME_STAMP42) */
#  define S32K3XX_CAN_HR_TIME_STAMP43_OFFSET (0x0cdc) /* High Resolution Time Stamp 43 (HR_TIME_STAMP43) */
#  define S32K3XX_CAN_HR_TIME_STAMP44_OFFSET (0x0ce0) /* High Resolution Time Stamp 44 (HR_TIME_STAMP44) */
#  define S32K3XX_CAN_HR_TIME_STAMP45_OFFSET (0x0ce4) /* High Resolution Time Stamp 45 (HR_TIME_STAMP45) */
#  define S32K3XX_CAN_HR_TIME_STAMP46_OFFSET (0x0ce8) /* High Resolution Time Stamp 46 (HR_TIME_STAMP46) */
#  define S32K3XX_CAN_HR_TIME_STAMP47_OFFSET (0x0cec) /* High Resolution Time Stamp 47 (HR_TIME_STAMP47) */
#  define S32K3XX_CAN_HR_TIME_STAMP48_OFFSET (0x0cf0) /* High Resolution Time Stamp 48 (HR_TIME_STAMP48) */
#  define S32K3XX_CAN_HR_TIME_STAMP49_OFFSET (0x0cf4) /* High Resolution Time Stamp 49 (HR_TIME_STAMP49) */
#  define S32K3XX_CAN_HR_TIME_STAMP50_OFFSET (0x0cf8) /* High Resolution Time Stamp 50 (HR_TIME_STAMP50) */
#  define S32K3XX_CAN_HR_TIME_STAMP51_OFFSET (0x0cfc) /* High Resolution Time Stamp 51 (HR_TIME_STAMP51) */
#  define S32K3XX_CAN_HR_TIME_STAMP52_OFFSET (0x0d00) /* High Resolution Time Stamp 52 (HR_TIME_STAMP52) */
#  define S32K3XX_CAN_HR_TIME_STAMP53_OFFSET (0x0d04) /* High Resolution Time Stamp 53 (HR_TIME_STAMP53) */
#  define S32K3XX_CAN_HR_TIME_STAMP54_OFFSET (0x0d08) /* High Resolution Time Stamp 54 (HR_TIME_STAMP54) */
#  define S32K3XX_CAN_HR_TIME_STAMP55_OFFSET (0x0d0c) /* High Resolution Time Stamp 55 (HR_TIME_STAMP55) */
#  define S32K3XX_CAN_HR_TIME_STAMP56_OFFSET (0x0d10) /* High Resolution Time Stamp 56 (HR_TIME_STAMP56) */
#  define S32K3XX_CAN_HR_TIME_STAMP57_OFFSET (0x0d14) /* High Resolution Time Stamp 57 (HR_TIME_STAMP57) */
#  define S32K3XX_CAN_HR_TIME_STAMP58_OFFSET (0x0d18) /* High Resolution Time Stamp 58 (HR_TIME_STAMP58) */
#  define S32K3XX_CAN_HR_TIME_STAMP59_OFFSET (0x0d1c) /* High Resolution Time Stamp 59 (HR_TIME_STAMP59) */
#  define S32K3XX_CAN_HR_TIME_STAMP60_OFFSET (0x0d20) /* High Resolution Time Stamp 60 (HR_TIME_STAMP60) */
#  define S32K3XX_CAN_HR_TIME_STAMP61_OFFSET (0x0d24) /* High Resolution Time Stamp 61 (HR_TIME_STAMP61) */
#  define S32K3XX_CAN_HR_TIME_STAMP62_OFFSET (0x0d28) /* High Resolution Time Stamp 62 (HR_TIME_STAMP62) */
#  define S32K3XX_CAN_HR_TIME_STAMP63_OFFSET (0x0d2c) /* High Resolution Time Stamp 63 (HR_TIME_STAMP63) */
#  define S32K3XX_CAN_HR_TIME_STAMP64_OFFSET (0x0d30) /* High Resolution Time Stamp 64 (HR_TIME_STAMP64) */
#  define S32K3XX_CAN_HR_TIME_STAMP65_OFFSET (0x0d34) /* High Resolution Time Stamp 65 (HR_TIME_STAMP65) */
#  define S32K3XX_CAN_HR_TIME_STAMP66_OFFSET (0x0d38) /* High Resolution Time Stamp 66 (HR_TIME_STAMP66) */
#  define S32K3XX_CAN_HR_TIME_STAMP67_OFFSET (0x0d3c) /* High Resolution Time Stamp 67 (HR_TIME_STAMP67) */
#  define S32K3XX_CAN_HR_TIME_STAMP68_OFFSET (0x0d40) /* High Resolution Time Stamp 68 (HR_TIME_STAMP68) */
#  define S32K3XX_CAN_HR_TIME_STAMP69_OFFSET (0x0d44) /* High Resolution Time Stamp 69 (HR_TIME_STAMP69) */
#  define S32K3XX_CAN_HR_TIME_STAMP70_OFFSET (0x0d48) /* High Resolution Time Stamp 70 (HR_TIME_STAMP70) */
#  define S32K3XX_CAN_HR_TIME_STAMP71_OFFSET (0x0d4c) /* High Resolution Time Stamp 71 (HR_TIME_STAMP71) */
#  define S32K3XX_CAN_HR_TIME_STAMP72_OFFSET (0x0d50) /* High Resolution Time Stamp 72 (HR_TIME_STAMP72) */
#  define S32K3XX_CAN_HR_TIME_STAMP73_OFFSET (0x0d54) /* High Resolution Time Stamp 73 (HR_TIME_STAMP73) */
#  define S32K3XX_CAN_HR_TIME_STAMP74_OFFSET (0x0d58) /* High Resolution Time Stamp 74 (HR_TIME_STAMP74) */
#  define S32K3XX_CAN_HR_TIME_STAMP75_OFFSET (0x0d5c) /* High Resolution Time Stamp 75 (HR_TIME_STAMP75) */
#  define S32K3XX_CAN_HR_TIME_STAMP76_OFFSET (0x0d60) /* High Resolution Time Stamp 76 (HR_TIME_STAMP76) */
#  define S32K3XX_CAN_HR_TIME_STAMP77_OFFSET (0x0d64) /* High Resolution Time Stamp 77 (HR_TIME_STAMP77) */
#  define S32K3XX_CAN_HR_TIME_STAMP78_OFFSET (0x0d68) /* High Resolution Time Stamp 78 (HR_TIME_STAMP78) */
#  define S32K3XX_CAN_HR_TIME_STAMP79_OFFSET (0x0d6c) /* High Resolution Time Stamp 79 (HR_TIME_STAMP79) */
#  define S32K3XX_CAN_HR_TIME_STAMP80_OFFSET (0x0d70) /* High Resolution Time Stamp 80 (HR_TIME_STAMP80) */
#  define S32K3XX_CAN_HR_TIME_STAMP81_OFFSET (0x0d74) /* High Resolution Time Stamp 81 (HR_TIME_STAMP81) */
#  define S32K3XX_CAN_HR_TIME_STAMP82_OFFSET (0x0d78) /* High Resolution Time Stamp 82 (HR_TIME_STAMP82) */
#  define S32K3XX_CAN_HR_TIME_STAMP83_OFFSET (0x0d7c) /* High Resolution Time Stamp 83 (HR_TIME_STAMP83) */
#  define S32K3XX_CAN_HR_TIME_STAMP84_OFFSET (0x0d80) /* High Resolution Time Stamp 84 (HR_TIME_STAMP84) */
#  define S32K3XX_CAN_HR_TIME_STAMP85_OFFSET (0x0d84) /* High Resolution Time Stamp 85 (HR_TIME_STAMP85) */
#  define S32K3XX_CAN_HR_TIME_STAMP86_OFFSET (0x0d88) /* High Resolution Time Stamp 86 (HR_TIME_STAMP86) */
#  define S32K3XX_CAN_HR_TIME_STAMP87_OFFSET (0x0d8c) /* High Resolution Time Stamp 87 (HR_TIME_STAMP87) */
#  define S32K3XX_CAN_HR_TIME_STAMP88_OFFSET (0x0d90) /* High Resolution Time Stamp 88 (HR_TIME_STAMP88) */
#  define S32K3XX_CAN_HR_TIME_STAMP89_OFFSET (0x0d94) /* High Resolution Time Stamp 89 (HR_TIME_STAMP89) */
#  define S32K3XX_CAN_HR_TIME_STAMP90_OFFSET (0x0d98) /* High Resolution Time Stamp 90 (HR_TIME_STAMP90) */
#  define S32K3XX_CAN_HR_TIME_STAMP91_OFFSET (0x0d9c) /* High Resolution Time Stamp 91 (HR_TIME_STAMP91) */
#  define S32K3XX_CAN_HR_TIME_STAMP92_OFFSET (0x0da0) /* High Resolution Time Stamp 92 (HR_TIME_STAMP92) */
#  define S32K3XX_CAN_HR_TIME_STAMP93_OFFSET (0x0da4) /* High Resolution Time Stamp 93 (HR_TIME_STAMP93) */
#  define S32K3XX_CAN_HR_TIME_STAMP94_OFFSET (0x0da8) /* High Resolution Time Stamp 94 (HR_TIME_STAMP94) */
#  define S32K3XX_CAN_HR_TIME_STAMP95_OFFSET (0x0dac) /* High Resolution Time Stamp 95 (HR_TIME_STAMP95) */
#define S32K3XX_CAN_HR_TIME_STAMP_COUNT      (96)     /* High Resolution Time Stamp Count */

