apache/nuttx/arch/arm/src/s32k3xx/hardware/s32k3xx_flexcan.h
#define S32K3XX_CAN_ERFFEL_OFFSET(n)         (0x3000 + ((n) << 2))
#  define S32K3XX_CAN_ERFFEL0_OFFSET         (0x3000) /* Enhanced Rx FIFO Filter Element 0 (ERFFEL0) */
#  define S32K3XX_CAN_ERFFEL1_OFFSET         (0x3004) /* Enhanced Rx FIFO Filter Element 1 (ERFFEL1) */
#  define S32K3XX_CAN_ERFFEL2_OFFSET         (0x3008) /* Enhanced Rx FIFO Filter Element 2 (ERFFEL2) */
#  define S32K3XX_CAN_ERFFEL3_OFFSET         (0x300c) /* Enhanced Rx FIFO Filter Element 3 (ERFFEL3) */
#  define S32K3XX_CAN_ERFFEL4_OFFSET         (0x3010) /* Enhanced Rx FIFO Filter Element 4 (ERFFEL4) */
#  define S32K3XX_CAN_ERFFEL5_OFFSET         (0x3014) /* Enhanced Rx FIFO Filter Element 5 (ERFFEL5) */
#  define S32K3XX_CAN_ERFFEL6_OFFSET         (0x3018) /* Enhanced Rx FIFO Filter Element 6 (ERFFEL6) */
#  define S32K3XX_CAN_ERFFEL7_OFFSET         (0x301c) /* Enhanced Rx FIFO Filter Element 7 (ERFFEL7) */
#  define S32K3XX_CAN_ERFFEL8_OFFSET         (0x3020) /* Enhanced Rx FIFO Filter Element 8 (ERFFEL8) */
#  define S32K3XX_CAN_ERFFEL9_OFFSET         (0x3024) /* Enhanced Rx FIFO Filter Element 9 (ERFFEL9) */
#  define S32K3XX_CAN_ERFFEL10_OFFSET        (0x3028) /* Enhanced Rx FIFO Filter Element 10 (ERFFEL10) */
#  define S32K3XX_CAN_ERFFEL11_OFFSET        (0x302c) /* Enhanced Rx FIFO Filter Element 11 (ERFFEL11) */
#  define S32K3XX_CAN_ERFFEL12_OFFSET        (0x3030) /* Enhanced Rx FIFO Filter Element 12 (ERFFEL12) */
#  define S32K3XX_CAN_ERFFEL13_OFFSET        (0x3034) /* Enhanced Rx FIFO Filter Element 13 (ERFFEL13) */
#  define S32K3XX_CAN_ERFFEL14_OFFSET        (0x3038) /* Enhanced Rx FIFO Filter Element 14 (ERFFEL14) */
#  define S32K3XX_CAN_ERFFEL15_OFFSET        (0x303c) /* Enhanced Rx FIFO Filter Element 15 (ERFFEL15) */
#  define S32K3XX_CAN_ERFFEL16_OFFSET        (0x3040) /* Enhanced Rx FIFO Filter Element 16 (ERFFEL16) */
#  define S32K3XX_CAN_ERFFEL17_OFFSET        (0x3044) /* Enhanced Rx FIFO Filter Element 17 (ERFFEL17) */
#  define S32K3XX_CAN_ERFFEL18_OFFSET        (0x3048) /* Enhanced Rx FIFO Filter Element 18 (ERFFEL18) */
#  define S32K3XX_CAN_ERFFEL19_OFFSET        (0x304c) /* Enhanced Rx FIFO Filter Element 19 (ERFFEL19) */
#  define S32K3XX_CAN_ERFFEL20_OFFSET        (0x3050) /* Enhanced Rx FIFO Filter Element 20 (ERFFEL20) */
#  define S32K3XX_CAN_ERFFEL21_OFFSET        (0x3054) /* Enhanced Rx FIFO Filter Element 21 (ERFFEL21) */
#  define S32K3XX_CAN_ERFFEL22_OFFSET        (0x3058) /* Enhanced Rx FIFO Filter Element 22 (ERFFEL22) */
#  define S32K3XX_CAN_ERFFEL23_OFFSET        (0x305c) /* Enhanced Rx FIFO Filter Element 23 (ERFFEL23) */
#  define S32K3XX_CAN_ERFFEL24_OFFSET        (0x3060) /* Enhanced Rx FIFO Filter Element 24 (ERFFEL24) */
#  define S32K3XX_CAN_ERFFEL25_OFFSET        (0x3064) /* Enhanced Rx FIFO Filter Element 25 (ERFFEL25) */
#  define S32K3XX_CAN_ERFFEL26_OFFSET        (0x3068) /* Enhanced Rx FIFO Filter Element 26 (ERFFEL26) */
#  define S32K3XX_CAN_ERFFEL27_OFFSET        (0x306c) /* Enhanced Rx FIFO Filter Element 27 (ERFFEL27) */
#  define S32K3XX_CAN_ERFFEL28_OFFSET        (0x3070) /* Enhanced Rx FIFO Filter Element 28 (ERFFEL28) */
#  define S32K3XX_CAN_ERFFEL29_OFFSET        (0x3074) /* Enhanced Rx FIFO Filter Element 29 (ERFFEL29) */
#  define S32K3XX_CAN_ERFFEL30_OFFSET        (0x3078) /* Enhanced Rx FIFO Filter Element 30 (ERFFEL30) */
#  define S32K3XX_CAN_ERFFEL31_OFFSET        (0x307c) /* Enhanced Rx FIFO Filter Element 31 (ERFFEL31) */
#  define S32K3XX_CAN_ERFFEL32_OFFSET        (0x3080) /* Enhanced Rx FIFO Filter Element 32 (ERFFEL32) */
#  define S32K3XX_CAN_ERFFEL33_OFFSET        (0x3084) /* Enhanced Rx FIFO Filter Element 33 (ERFFEL33) */
#  define S32K3XX_CAN_ERFFEL34_OFFSET        (0x3088) /* Enhanced Rx FIFO Filter Element 34 (ERFFEL34) */
#  define S32K3XX_CAN_ERFFEL35_OFFSET        (0x308c) /* Enhanced Rx FIFO Filter Element 35 (ERFFEL35) */
#  define S32K3XX_CAN_ERFFEL36_OFFSET        (0x3090) /* Enhanced Rx FIFO Filter Element 36 (ERFFEL36) */
#  define S32K3XX_CAN_ERFFEL37_OFFSET        (0x3094) /* Enhanced Rx FIFO Filter Element 37 (ERFFEL37) */
#  define S32K3XX_CAN_ERFFEL38_OFFSET        (0x3098) /* Enhanced Rx FIFO Filter Element 38 (ERFFEL38) */
#  define S32K3XX_CAN_ERFFEL39_OFFSET        (0x309c) /* Enhanced Rx FIFO Filter Element 39 (ERFFEL39) */
#  define S32K3XX_CAN_ERFFEL40_OFFSET        (0x30a0) /* Enhanced Rx FIFO Filter Element 40 (ERFFEL40) */
#  define S32K3XX_CAN_ERFFEL41_OFFSET        (0x30a4) /* Enhanced Rx FIFO Filter Element 41 (ERFFEL41) */
#  define S32K3XX_CAN_ERFFEL42_OFFSET        (0x30a8) /* Enhanced Rx FIFO Filter Element 42 (ERFFEL42) */
#  define S32K3XX_CAN_ERFFEL43_OFFSET        (0x30ac) /* Enhanced Rx FIFO Filter Element 43 (ERFFEL43) */
#  define S32K3XX_CAN_ERFFEL44_OFFSET        (0x30b0) /* Enhanced Rx FIFO Filter Element 44 (ERFFEL44) */
#  define S32K3XX_CAN_ERFFEL45_OFFSET        (0x30b4) /* Enhanced Rx FIFO Filter Element 45 (ERFFEL45) */
#  define S32K3XX_CAN_ERFFEL46_OFFSET        (0x30b8) /* Enhanced Rx FIFO Filter Element 46 (ERFFEL46) */
#  define S32K3XX_CAN_ERFFEL47_OFFSET        (0x30bc) /* Enhanced Rx FIFO Filter Element 47 (ERFFEL47) */
#  define S32K3XX_CAN_ERFFEL48_OFFSET        (0x30c0) /* Enhanced Rx FIFO Filter Element 48 (ERFFEL48) */
#  define S32K3XX_CAN_ERFFEL49_OFFSET        (0x30c4) /* Enhanced Rx FIFO Filter Element 49 (ERFFEL49) */
#  define S32K3XX_CAN_ERFFEL50_OFFSET        (0x30c8) /* Enhanced Rx FIFO Filter Element 50 (ERFFEL50) */
#  define S32K3XX_CAN_ERFFEL51_OFFSET        (0x30cc) /* Enhanced Rx FIFO Filter Element 51 (ERFFEL51) */
#  define S32K3XX_CAN_ERFFEL52_OFFSET        (0x30d0) /* Enhanced Rx FIFO Filter Element 52 (ERFFEL52) */
#  define S32K3XX_CAN_ERFFEL53_OFFSET        (0x30d4) /* Enhanced Rx FIFO Filter Element 53 (ERFFEL53) */
#  define S32K3XX_CAN_ERFFEL54_OFFSET        (0x30d8) /* Enhanced Rx FIFO Filter Element 54 (ERFFEL54) */
#  define S32K3XX_CAN_ERFFEL55_OFFSET        (0x30dc) /* Enhanced Rx FIFO Filter Element 55 (ERFFEL55) */
#  define S32K3XX_CAN_ERFFEL56_OFFSET        (0x30e0) /* Enhanced Rx FIFO Filter Element 56 (ERFFEL56) */
#  define S32K3XX_CAN_ERFFEL57_OFFSET        (0x30e4) /* Enhanced Rx FIFO Filter Element 57 (ERFFEL57) */
#  define S32K3XX_CAN_ERFFEL58_OFFSET        (0x30e8) /* Enhanced Rx FIFO Filter Element 58 (ERFFEL58) */
#  define S32K3XX_CAN_ERFFEL59_OFFSET        (0x30ec) /* Enhanced Rx FIFO Filter Element 59 (ERFFEL59) */
#  define S32K3XX_CAN_ERFFEL60_OFFSET        (0x30f0) /* Enhanced Rx FIFO Filter Element 60 (ERFFEL60) */
#  define S32K3XX_CAN_ERFFEL61_OFFSET        (0x30f4) /* Enhanced Rx FIFO Filter Element 61 (ERFFEL61) */
#  define S32K3XX_CAN_ERFFEL62_OFFSET        (0x30f8) /* Enhanced Rx FIFO Filter Element 62 (ERFFEL62) */
#  define S32K3XX_CAN_ERFFEL63_OFFSET        (0x30fc) /* Enhanced Rx FIFO Filter Element 63 (ERFFEL63) */
#  define S32K3XX_CAN_ERFFEL64_OFFSET        (0x3100) /* Enhanced Rx FIFO Filter Element 64 (ERFFEL64) */
#  define S32K3XX_CAN_ERFFEL65_OFFSET        (0x3104) /* Enhanced Rx FIFO Filter Element 65 (ERFFEL65) */
#  define S32K3XX_CAN_ERFFEL66_OFFSET        (0x3108) /* Enhanced Rx FIFO Filter Element 66 (ERFFEL66) */
#  define S32K3XX_CAN_ERFFEL67_OFFSET        (0x310c) /* Enhanced Rx FIFO Filter Element 67 (ERFFEL67) */
#  define S32K3XX_CAN_ERFFEL68_OFFSET        (0x3110) /* Enhanced Rx FIFO Filter Element 68 (ERFFEL68) */
#  define S32K3XX_CAN_ERFFEL69_OFFSET        (0x3114) /* Enhanced Rx FIFO Filter Element 69 (ERFFEL69) */
#  define S32K3XX_CAN_ERFFEL70_OFFSET        (0x3118) /* Enhanced Rx FIFO Filter Element 70 (ERFFEL70) */
#  define S32K3XX_CAN_ERFFEL71_OFFSET        (0x311c) /* Enhanced Rx FIFO Filter Element 71 (ERFFEL71) */
#  define S32K3XX_CAN_ERFFEL72_OFFSET        (0x3120) /* Enhanced Rx FIFO Filter Element 72 (ERFFEL72) */
#  define S32K3XX_CAN_ERFFEL73_OFFSET        (0x3124) /* Enhanced Rx FIFO Filter Element 73 (ERFFEL73) */
#  define S32K3XX_CAN_ERFFEL74_OFFSET        (0x3128) /* Enhanced Rx FIFO Filter Element 74 (ERFFEL74) */
#  define S32K3XX_CAN_ERFFEL75_OFFSET        (0x312c) /* Enhanced Rx FIFO Filter Element 75 (ERFFEL75) */
#  define S32K3XX_CAN_ERFFEL76_OFFSET        (0x3130) /* Enhanced Rx FIFO Filter Element 76 (ERFFEL76) */
#  define S32K3XX_CAN_ERFFEL77_OFFSET        (0x3134) /* Enhanced Rx FIFO Filter Element 77 (ERFFEL77) */
#  define S32K3XX_CAN_ERFFEL78_OFFSET        (0x3138) /* Enhanced Rx FIFO Filter Element 78 (ERFFEL78) */
#  define S32K3XX_CAN_ERFFEL79_OFFSET        (0x313c) /* Enhanced Rx FIFO Filter Element 79 (ERFFEL79) */
#  define S32K3XX_CAN_ERFFEL80_OFFSET        (0x3140) /* Enhanced Rx FIFO Filter Element 80 (ERFFEL80) */
#  define S32K3XX_CAN_ERFFEL81_OFFSET        (0x3144) /* Enhanced Rx FIFO Filter Element 81 (ERFFEL81) */
#  define S32K3XX_CAN_ERFFEL82_OFFSET        (0x3148) /* Enhanced Rx FIFO Filter Element 82 (ERFFEL82) */
#  define S32K3XX_CAN_ERFFEL83_OFFSET        (0x314c) /* Enhanced Rx FIFO Filter Element 83 (ERFFEL83) */
#  define S32K3XX_CAN_ERFFEL84_OFFSET        (0x3150) /* Enhanced Rx FIFO Filter Element 84 (ERFFEL84) */
#  define S32K3XX_CAN_ERFFEL85_OFFSET        (0x3154) /* Enhanced Rx FIFO Filter Element 85 (ERFFEL85) */
#  define S32K3XX_CAN_ERFFEL86_OFFSET        (0x3158) /* Enhanced Rx FIFO Filter Element 86 (ERFFEL86) */
#  define S32K3XX_CAN_ERFFEL87_OFFSET        (0x315c) /* Enhanced Rx FIFO Filter Element 87 (ERFFEL87) */
#  define S32K3XX_CAN_ERFFEL88_OFFSET        (0x3160) /* Enhanced Rx FIFO Filter Element 88 (ERFFEL88) */
#  define S32K3XX_CAN_ERFFEL89_OFFSET        (0x3164) /* Enhanced Rx FIFO Filter Element 89 (ERFFEL89) */
#  define S32K3XX_CAN_ERFFEL90_OFFSET        (0x3168) /* Enhanced Rx FIFO Filter Element 90 (ERFFEL90) */
#  define S32K3XX_CAN_ERFFEL91_OFFSET        (0x316c) /* Enhanced Rx FIFO Filter Element 91 (ERFFEL91) */
#  define S32K3XX_CAN_ERFFEL92_OFFSET        (0x3170) /* Enhanced Rx FIFO Filter Element 92 (ERFFEL92) */
#  define S32K3XX_CAN_ERFFEL93_OFFSET        (0x3174) /* Enhanced Rx FIFO Filter Element 93 (ERFFEL93) */
#  define S32K3XX_CAN_ERFFEL94_OFFSET        (0x3178) /* Enhanced Rx FIFO Filter Element 94 (ERFFEL94) */
#  define S32K3XX_CAN_ERFFEL95_OFFSET        (0x317c) /* Enhanced Rx FIFO Filter Element 95 (ERFFEL95) */
#  define S32K3XX_CAN_ERFFEL96_OFFSET        (0x3180) /* Enhanced Rx FIFO Filter Element 96 (ERFFEL96) */
#  define S32K3XX_CAN_ERFFEL97_OFFSET        (0x3184) /* Enhanced Rx FIFO Filter Element 97 (ERFFEL97) */
#  define S32K3XX_CAN_ERFFEL98_OFFSET        (0x3188) /* Enhanced Rx FIFO Filter Element 98 (ERFFEL98) */
#  define S32K3XX_CAN_ERFFEL99_OFFSET        (0x318c) /* Enhanced Rx FIFO Filter Element 99 (ERFFEL99) */
#  define S32K3XX_CAN_ERFFEL100_OFFSET       (0x3190) /* Enhanced Rx FIFO Filter Element 100 (ERFFEL100) */
#  define S32K3XX_CAN_ERFFEL101_OFFSET       (0x3194) /* Enhanced Rx FIFO Filter Element 101 (ERFFEL101) */
#  define S32K3XX_CAN_ERFFEL102_OFFSET       (0x3198) /* Enhanced Rx FIFO Filter Element 102 (ERFFEL102) */
#  define S32K3XX_CAN_ERFFEL103_OFFSET       (0x319c) /* Enhanced Rx FIFO Filter Element 103 (ERFFEL103) */
#  define S32K3XX_CAN_ERFFEL104_OFFSET       (0x31a0) /* Enhanced Rx FIFO Filter Element 104 (ERFFEL104) */
#  define S32K3XX_CAN_ERFFEL105_OFFSET       (0x31a4) /* Enhanced Rx FIFO Filter Element 105 (ERFFEL105) */
#  define S32K3XX_CAN_ERFFEL106_OFFSET       (0x31a8) /* Enhanced Rx FIFO Filter Element 106 (ERFFEL106) */
#  define S32K3XX_CAN_ERFFEL107_OFFSET       (0x31ac) /* Enhanced Rx FIFO Filter Element 107 (ERFFEL107) */
#  define S32K3XX_CAN_ERFFEL108_OFFSET       (0x31b0) /* Enhanced Rx FIFO Filter Element 108 (ERFFEL108) */
#  define S32K3XX_CAN_ERFFEL109_OFFSET       (0x31b4) /* Enhanced Rx FIFO Filter Element 109 (ERFFEL109) */
#  define S32K3XX_CAN_ERFFEL110_OFFSET       (0x31b8) /* Enhanced Rx FIFO Filter Element 110 (ERFFEL110) */
#  define S32K3XX_CAN_ERFFEL111_OFFSET       (0x31bc) /* Enhanced Rx FIFO Filter Element 111 (ERFFEL111) */
#  define S32K3XX_CAN_ERFFEL112_OFFSET       (0x31c0) /* Enhanced Rx FIFO Filter Element 112 (ERFFEL112) */
#  define S32K3XX_CAN_ERFFEL113_OFFSET       (0x31c4) /* Enhanced Rx FIFO Filter Element 113 (ERFFEL113) */
#  define S32K3XX_CAN_ERFFEL114_OFFSET       (0x31c8) /* Enhanced Rx FIFO Filter Element 114 (ERFFEL114) */
#  define S32K3XX_CAN_ERFFEL115_OFFSET       (0x31cc) /* Enhanced Rx FIFO Filter Element 115 (ERFFEL115) */
#  define S32K3XX_CAN_ERFFEL116_OFFSET       (0x31d0) /* Enhanced Rx FIFO Filter Element 116 (ERFFEL116) */
#  define S32K3XX_CAN_ERFFEL117_OFFSET       (0x31d4) /* Enhanced Rx FIFO Filter Element 117 (ERFFEL117) */
#  define S32K3XX_CAN_ERFFEL118_OFFSET       (0x31d8) /* Enhanced Rx FIFO Filter Element 118 (ERFFEL118) */
#  define S32K3XX_CAN_ERFFEL119_OFFSET       (0x31dc) /* Enhanced Rx FIFO Filter Element 119 (ERFFEL119) */
#  define S32K3XX_CAN_ERFFEL120_OFFSET       (0x31e0) /* Enhanced Rx FIFO Filter Element 120 (ERFFEL120) */
#  define S32K3XX_CAN_ERFFEL121_OFFSET       (0x31e4) /* Enhanced Rx FIFO Filter Element 121 (ERFFEL121) */
#  define S32K3XX_CAN_ERFFEL122_OFFSET       (0x31e8) /* Enhanced Rx FIFO Filter Element 122 (ERFFEL122) */
#  define S32K3XX_CAN_ERFFEL123_OFFSET       (0x31ec) /* Enhanced Rx FIFO Filter Element 123 (ERFFEL123) */
#  define S32K3XX_CAN_ERFFEL124_OFFSET       (0x31f0) /* Enhanced Rx FIFO Filter Element 124 (ERFFEL124) */
#  define S32K3XX_CAN_ERFFEL125_OFFSET       (0x31f4) /* Enhanced Rx FIFO Filter Element 125 (ERFFEL125) */
#  define S32K3XX_CAN_ERFFEL126_OFFSET       (0x31f8) /* Enhanced Rx FIFO Filter Element 126 (ERFFEL126) */
#  define S32K3XX_CAN_ERFFEL127_OFFSET       (0x31fc) /* Enhanced Rx FIFO Filter Element 127 (ERFFEL127) */
#define S32K3XX_CAN_ERFFEL_COUNT             (128)    /* Enhanced Rx FIFO Filter Element Count */

