apache/nuttx/arch/arm/src/s32k3xx/hardware/s32k3xx_flexcan.h
/* FlexCAN Register Addresses ***********************************************/

/* FlexCAN0 */

#define S32K3XX_CAN0_MCR                     (S32K3XX_CAN0_BASE + S32K3XX_CAN_MCR_OFFSET)
#define S32K3XX_CAN0_CTRL1                   (S32K3XX_CAN0_BASE + S32K3XX_CAN_CTRL1_OFFSET)
#define S32K3XX_CAN0_TIMER                   (S32K3XX_CAN0_BASE + S32K3XX_CAN_TIMER_OFFSET)
#define S32K3XX_CAN0_RXMGMASK                (S32K3XX_CAN0_BASE + S32K3XX_CAN_RXMGMASK_OFFSET)
#define S32K3XX_CAN0_RX14MASK                (S32K3XX_CAN0_BASE + S32K3XX_CAN_RX14MASK_OFFSET)
#define S32K3XX_CAN0_RX15MASK                (S32K3XX_CAN0_BASE + S32K3XX_CAN_RX15MASK_OFFSET)
#define S32K3XX_CAN0_ECR                     (S32K3XX_CAN0_BASE + S32K3XX_CAN_ECR_OFFSET)
#define S32K3XX_CAN0_ESR1                    (S32K3XX_CAN0_BASE + S32K3XX_CAN_ESR1_OFFSET)
#define S32K3XX_CAN0_IMASK2                  (S32K3XX_CAN0_BASE + S32K3XX_CAN_IMASK2_OFFSET)
#define S32K3XX_CAN0_IMASK1                  (S32K3XX_CAN0_BASE + S32K3XX_CAN_IMASK1_OFFSET)
#define S32K3XX_CAN0_IFLAG2                  (S32K3XX_CAN0_BASE + S32K3XX_CAN_IFLAG2_OFFSET)
#define S32K3XX_CAN0_IFLAG1                  (S32K3XX_CAN0_BASE + S32K3XX_CAN_IFLAG1_OFFSET)
#define S32K3XX_CAN0_CTRL2                   (S32K3XX_CAN0_BASE + S32K3XX_CAN_CTRL2_OFFSET)
#define S32K3XX_CAN0_ESR2                    (S32K3XX_CAN0_BASE + S32K3XX_CAN_ESR2_OFFSET)
#define S32K3XX_CAN0_CRCR                    (S32K3XX_CAN0_BASE + S32K3XX_CAN_CRCR_OFFSET)
#define S32K3XX_CAN0_RXFGMASK                (S32K3XX_CAN0_BASE + S32K3XX_CAN_RXFGMASK_OFFSET)
#define S32K3XX_CAN0_RXFIR                   (S32K3XX_CAN0_BASE + S32K3XX_CAN_RXFIR_OFFSET)
#define S32K3XX_CAN0_CBT                     (S32K3XX_CAN0_BASE + S32K3XX_CAN_CBT_OFFSET)
#define S32K3XX_CAN0_IMASK3                  (S32K3XX_CAN0_BASE + S32K3XX_CAN_IMASK3_OFFSET)
#define S32K3XX_CAN0_IFLAG3                  (S32K3XX_CAN0_BASE + S32K3XX_CAN_IFLAG3_OFFSET)

#define S32K3XX_CAN0_RXIMR(n)                (S32K3XX_CAN0_BASE + S32K3XX_CAN_RXIMR_OFFSET(n))
#  define S32K3XX_CAN0_RXIMR0                (S32K3XX_CAN0_BASE + S32K3XX_CAN_RXIMR0_OFFSET)
#  define S32K3XX_CAN0_RXIMR1                (S32K3XX_CAN0_BASE + S32K3XX_CAN_RXIMR1_OFFSET)
#  define S32K3XX_CAN0_RXIMR2                (S32K3XX_CAN0_BASE + S32K3XX_CAN_RXIMR2_OFFSET)
#  define S32K3XX_CAN0_RXIMR3                (S32K3XX_CAN0_BASE + S32K3XX_CAN_RXIMR3_OFFSET)
#  define S32K3XX_CAN0_RXIMR4                (S32K3XX_CAN0_BASE + S32K3XX_CAN_RXIMR4_OFFSET)
#  define S32K3XX_CAN0_RXIMR5                (S32K3XX_CAN0_BASE + S32K3XX_CAN_RXIMR5_OFFSET)
#  define S32K3XX_CAN0_RXIMR6                (S32K3XX_CAN0_BASE + S32K3XX_CAN_RXIMR6_OFFSET)
#  define S32K3XX_CAN0_RXIMR7                (S32K3XX_CAN0_BASE + S32K3XX_CAN_RXIMR7_OFFSET)
#  define S32K3XX_CAN0_RXIMR8                (S32K3XX_CAN0_BASE + S32K3XX_CAN_RXIMR8_OFFSET)
#  define S32K3XX_CAN0_RXIMR9                (S32K3XX_CAN0_BASE + S32K3XX_CAN_RXIMR9_OFFSET)
#  define S32K3XX_CAN0_RXIMR10               (S32K3XX_CAN0_BASE + S32K3XX_CAN_RXIMR10_OFFSET)
#  define S32K3XX_CAN0_RXIMR11               (S32K3XX_CAN0_BASE + S32K3XX_CAN_RXIMR11_OFFSET)
#  define S32K3XX_CAN0_RXIMR12               (S32K3XX_CAN0_BASE + S32K3XX_CAN_RXIMR12_OFFSET)
#  define S32K3XX_CAN0_RXIMR13               (S32K3XX_CAN0_BASE + S32K3XX_CAN_RXIMR13_OFFSET)
#  define S32K3XX_CAN0_RXIMR14               (S32K3XX_CAN0_BASE + S32K3XX_CAN_RXIMR14_OFFSET)
#  define S32K3XX_CAN0_RXIMR15               (S32K3XX_CAN0_BASE + S32K3XX_CAN_RXIMR15_OFFSET)
#  define S32K3XX_CAN0_RXIMR16               (S32K3XX_CAN0_BASE + S32K3XX_CAN_RXIMR16_OFFSET)
#  define S32K3XX_CAN0_RXIMR17               (S32K3XX_CAN0_BASE + S32K3XX_CAN_RXIMR17_OFFSET)
#  define S32K3XX_CAN0_RXIMR18               (S32K3XX_CAN0_BASE + S32K3XX_CAN_RXIMR18_OFFSET)
#  define S32K3XX_CAN0_RXIMR19               (S32K3XX_CAN0_BASE + S32K3XX_CAN_RXIMR19_OFFSET)
#  define S32K3XX_CAN0_RXIMR20               (S32K3XX_CAN0_BASE + S32K3XX_CAN_RXIMR20_OFFSET)
#  define S32K3XX_CAN0_RXIMR21               (S32K3XX_CAN0_BASE + S32K3XX_CAN_RXIMR21_OFFSET)
#  define S32K3XX_CAN0_RXIMR22               (S32K3XX_CAN0_BASE + S32K3XX_CAN_RXIMR22_OFFSET)
#  define S32K3XX_CAN0_RXIMR23               (S32K3XX_CAN0_BASE + S32K3XX_CAN_RXIMR23_OFFSET)
#  define S32K3XX_CAN0_RXIMR24               (S32K3XX_CAN0_BASE + S32K3XX_CAN_RXIMR24_OFFSET)
#  define S32K3XX_CAN0_RXIMR25               (S32K3XX_CAN0_BASE + S32K3XX_CAN_RXIMR25_OFFSET)
#  define S32K3XX_CAN0_RXIMR26               (S32K3XX_CAN0_BASE + S32K3XX_CAN_RXIMR26_OFFSET)
#  define S32K3XX_CAN0_RXIMR27               (S32K3XX_CAN0_BASE + S32K3XX_CAN_RXIMR27_OFFSET)
#  define S32K3XX_CAN0_RXIMR28               (S32K3XX_CAN0_BASE + S32K3XX_CAN_RXIMR28_OFFSET)
#  define S32K3XX_CAN0_RXIMR29               (S32K3XX_CAN0_BASE + S32K3XX_CAN_RXIMR29_OFFSET)
#  define S32K3XX_CAN0_RXIMR30               (S32K3XX_CAN0_BASE + S32K3XX_CAN_RXIMR30_OFFSET)
#  define S32K3XX_CAN0_RXIMR31               (S32K3XX_CAN0_BASE + S32K3XX_CAN_RXIMR31_OFFSET)
#  define S32K3XX_CAN0_RXIMR32               (S32K3XX_CAN0_BASE + S32K3XX_CAN_RXIMR32_OFFSET)
#  define S32K3XX_CAN0_RXIMR33               (S32K3XX_CAN0_BASE + S32K3XX_CAN_RXIMR33_OFFSET)
#  define S32K3XX_CAN0_RXIMR34               (S32K3XX_CAN0_BASE + S32K3XX_CAN_RXIMR34_OFFSET)
#  define S32K3XX_CAN0_RXIMR35               (S32K3XX_CAN0_BASE + S32K3XX_CAN_RXIMR35_OFFSET)
#  define S32K3XX_CAN0_RXIMR36               (S32K3XX_CAN0_BASE + S32K3XX_CAN_RXIMR36_OFFSET)
#  define S32K3XX_CAN0_RXIMR37               (S32K3XX_CAN0_BASE + S32K3XX_CAN_RXIMR37_OFFSET)
#  define S32K3XX_CAN0_RXIMR38               (S32K3XX_CAN0_BASE + S32K3XX_CAN_RXIMR38_OFFSET)
#  define S32K3XX_CAN0_RXIMR39               (S32K3XX_CAN0_BASE + S32K3XX_CAN_RXIMR39_OFFSET)
#  define S32K3XX_CAN0_RXIMR40               (S32K3XX_CAN0_BASE + S32K3XX_CAN_RXIMR40_OFFSET)
#  define S32K3XX_CAN0_RXIMR41               (S32K3XX_CAN0_BASE + S32K3XX_CAN_RXIMR41_OFFSET)
#  define S32K3XX_CAN0_RXIMR42               (S32K3XX_CAN0_BASE + S32K3XX_CAN_RXIMR42_OFFSET)
#  define S32K3XX_CAN0_RXIMR43               (S32K3XX_CAN0_BASE + S32K3XX_CAN_RXIMR43_OFFSET)
#  define S32K3XX_CAN0_RXIMR44               (S32K3XX_CAN0_BASE + S32K3XX_CAN_RXIMR44_OFFSET)
#  define S32K3XX_CAN0_RXIMR45               (S32K3XX_CAN0_BASE + S32K3XX_CAN_RXIMR45_OFFSET)
#  define S32K3XX_CAN0_RXIMR46               (S32K3XX_CAN0_BASE + S32K3XX_CAN_RXIMR46_OFFSET)
#  define S32K3XX_CAN0_RXIMR47               (S32K3XX_CAN0_BASE + S32K3XX_CAN_RXIMR47_OFFSET)
#  define S32K3XX_CAN0_RXIMR48               (S32K3XX_CAN0_BASE + S32K3XX_CAN_RXIMR48_OFFSET)
#  define S32K3XX_CAN0_RXIMR49               (S32K3XX_CAN0_BASE + S32K3XX_CAN_RXIMR49_OFFSET)
#  define S32K3XX_CAN0_RXIMR50               (S32K3XX_CAN0_BASE + S32K3XX_CAN_RXIMR50_OFFSET)
#  define S32K3XX_CAN0_RXIMR51               (S32K3XX_CAN0_BASE + S32K3XX_CAN_RXIMR51_OFFSET)
#  define S32K3XX_CAN0_RXIMR52               (S32K3XX_CAN0_BASE + S32K3XX_CAN_RXIMR52_OFFSET)
#  define S32K3XX_CAN0_RXIMR53               (S32K3XX_CAN0_BASE + S32K3XX_CAN_RXIMR53_OFFSET)
#  define S32K3XX_CAN0_RXIMR54               (S32K3XX_CAN0_BASE + S32K3XX_CAN_RXIMR54_OFFSET)
#  define S32K3XX_CAN0_RXIMR55               (S32K3XX_CAN0_BASE + S32K3XX_CAN_RXIMR55_OFFSET)
#  define S32K3XX_CAN0_RXIMR56               (S32K3XX_CAN0_BASE + S32K3XX_CAN_RXIMR56_OFFSET)
#  define S32K3XX_CAN0_RXIMR57               (S32K3XX_CAN0_BASE + S32K3XX_CAN_RXIMR57_OFFSET)
#  define S32K3XX_CAN0_RXIMR58               (S32K3XX_CAN0_BASE + S32K3XX_CAN_RXIMR58_OFFSET)
#  define S32K3XX_CAN0_RXIMR59               (S32K3XX_CAN0_BASE + S32K3XX_CAN_RXIMR59_OFFSET)
#  define S32K3XX_CAN0_RXIMR60               (S32K3XX_CAN0_BASE + S32K3XX_CAN_RXIMR60_OFFSET)
#  define S32K3XX_CAN0_RXIMR61               (S32K3XX_CAN0_BASE + S32K3XX_CAN_RXIMR61_OFFSET)
#  define S32K3XX_CAN0_RXIMR62               (S32K3XX_CAN0_BASE + S32K3XX_CAN_RXIMR62_OFFSET)
#  define S32K3XX_CAN0_RXIMR63               (S32K3XX_CAN0_BASE + S32K3XX_CAN_RXIMR63_OFFSET)
#  define S32K3XX_CAN0_RXIMR64               (S32K3XX_CAN0_BASE + S32K3XX_CAN_RXIMR64_OFFSET)
#  define S32K3XX_CAN0_RXIMR65               (S32K3XX_CAN0_BASE + S32K3XX_CAN_RXIMR65_OFFSET)
#  define S32K3XX_CAN0_RXIMR66               (S32K3XX_CAN0_BASE + S32K3XX_CAN_RXIMR66_OFFSET)
#  define S32K3XX_CAN0_RXIMR67               (S32K3XX_CAN0_BASE + S32K3XX_CAN_RXIMR67_OFFSET)
#  define S32K3XX_CAN0_RXIMR68               (S32K3XX_CAN0_BASE + S32K3XX_CAN_RXIMR68_OFFSET)
#  define S32K3XX_CAN0_RXIMR69               (S32K3XX_CAN0_BASE + S32K3XX_CAN_RXIMR69_OFFSET)
#  define S32K3XX_CAN0_RXIMR70               (S32K3XX_CAN0_BASE + S32K3XX_CAN_RXIMR70_OFFSET)
#  define S32K3XX_CAN0_RXIMR71               (S32K3XX_CAN0_BASE + S32K3XX_CAN_RXIMR71_OFFSET)
#  define S32K3XX_CAN0_RXIMR72               (S32K3XX_CAN0_BASE + S32K3XX_CAN_RXIMR72_OFFSET)
#  define S32K3XX_CAN0_RXIMR73               (S32K3XX_CAN0_BASE + S32K3XX_CAN_RXIMR73_OFFSET)
#  define S32K3XX_CAN0_RXIMR74               (S32K3XX_CAN0_BASE + S32K3XX_CAN_RXIMR74_OFFSET)
#  define S32K3XX_CAN0_RXIMR75               (S32K3XX_CAN0_BASE + S32K3XX_CAN_RXIMR75_OFFSET)
#  define S32K3XX_CAN0_RXIMR76               (S32K3XX_CAN0_BASE + S32K3XX_CAN_RXIMR76_OFFSET)
#  define S32K3XX_CAN0_RXIMR77               (S32K3XX_CAN0_BASE + S32K3XX_CAN_RXIMR77_OFFSET)
#  define S32K3XX_CAN0_RXIMR78               (S32K3XX_CAN0_BASE + S32K3XX_CAN_RXIMR78_OFFSET)
#  define S32K3XX_CAN0_RXIMR79               (S32K3XX_CAN0_BASE + S32K3XX_CAN_RXIMR79_OFFSET)
#  define S32K3XX_CAN0_RXIMR80               (S32K3XX_CAN0_BASE + S32K3XX_CAN_RXIMR80_OFFSET)
#  define S32K3XX_CAN0_RXIMR81               (S32K3XX_CAN0_BASE + S32K3XX_CAN_RXIMR81_OFFSET)
#  define S32K3XX_CAN0_RXIMR82               (S32K3XX_CAN0_BASE + S32K3XX_CAN_RXIMR82_OFFSET)
#  define S32K3XX_CAN0_RXIMR83               (S32K3XX_CAN0_BASE + S32K3XX_CAN_RXIMR83_OFFSET)
#  define S32K3XX_CAN0_RXIMR84               (S32K3XX_CAN0_BASE + S32K3XX_CAN_RXIMR84_OFFSET)
#  define S32K3XX_CAN0_RXIMR85               (S32K3XX_CAN0_BASE + S32K3XX_CAN_RXIMR85_OFFSET)
#  define S32K3XX_CAN0_RXIMR86               (S32K3XX_CAN0_BASE + S32K3XX_CAN_RXIMR86_OFFSET)
#  define S32K3XX_CAN0_RXIMR87               (S32K3XX_CAN0_BASE + S32K3XX_CAN_RXIMR87_OFFSET)
#  define S32K3XX_CAN0_RXIMR88               (S32K3XX_CAN0_BASE + S32K3XX_CAN_RXIMR88_OFFSET)
#  define S32K3XX_CAN0_RXIMR89               (S32K3XX_CAN0_BASE + S32K3XX_CAN_RXIMR89_OFFSET)
#  define S32K3XX_CAN0_RXIMR90               (S32K3XX_CAN0_BASE + S32K3XX_CAN_RXIMR90_OFFSET)
#  define S32K3XX_CAN0_RXIMR91               (S32K3XX_CAN0_BASE + S32K3XX_CAN_RXIMR91_OFFSET)
#  define S32K3XX_CAN0_RXIMR92               (S32K3XX_CAN0_BASE + S32K3XX_CAN_RXIMR92_OFFSET)
#  define S32K3XX_CAN0_RXIMR93               (S32K3XX_CAN0_BASE + S32K3XX_CAN_RXIMR93_OFFSET)
#  define S32K3XX_CAN0_RXIMR94               (S32K3XX_CAN0_BASE + S32K3XX_CAN_RXIMR94_OFFSET)
#  define S32K3XX_CAN0_RXIMR95               (S32K3XX_CAN0_BASE + S32K3XX_CAN_RXIMR95_OFFSET)

#define S32K3XX_CAN0_MECR                    (S32K3XX_CAN0_BASE + S32K3XX_CAN_MECR_OFFSET)
#define S32K3XX_CAN0_ERRIAR                  (S32K3XX_CAN0_BASE + S32K3XX_CAN_ERRIAR_OFFSET)
#define S32K3XX_CAN0_ERRIDPR                 (S32K3XX_CAN0_BASE + S32K3XX_CAN_ERRIDPR_OFFSET)
#define S32K3XX_CAN0_ERRIPPR                 (S32K3XX_CAN0_BASE + S32K3XX_CAN_ERRIPPR_OFFSET)
#define S32K3XX_CAN0_RERRAR                  (S32K3XX_CAN0_BASE + S32K3XX_CAN_RERRAR_OFFSET)
#define S32K3XX_CAN0_RERRDR                  (S32K3XX_CAN0_BASE + S32K3XX_CAN_RERRDR_OFFSET)
#define S32K3XX_CAN0_RERRSYNR                (S32K3XX_CAN0_BASE + S32K3XX_CAN_RERRSYNR_OFFSET)
#define S32K3XX_CAN0_ERRSR                   (S32K3XX_CAN0_BASE + S32K3XX_CAN_ERRSR_OFFSET)
#define S32K3XX_CAN0_EPRS                    (S32K3XX_CAN0_BASE + S32K3XX_CAN_EPRS_OFFSET)
#define S32K3XX_CAN0_ENCBT                   (S32K3XX_CAN0_BASE + S32K3XX_CAN_ENCBT_OFFSET)
#define S32K3XX_CAN0_EDCBT                   (S32K3XX_CAN0_BASE + S32K3XX_CAN_EDCBT_OFFSET)
#define S32K3XX_CAN0_ETDC                    (S32K3XX_CAN0_BASE + S32K3XX_CAN_ETDC_OFFSET)
#define S32K3XX_CAN0_FDCTRL                  (S32K3XX_CAN0_BASE + S32K3XX_CAN_FDCTRL_OFFSET)
#define S32K3XX_CAN0_FDCBT                   (S32K3XX_CAN0_BASE + S32K3XX_CAN_FDCBT_OFFSET)
#define S32K3XX_CAN0_FDCRC                   (S32K3XX_CAN0_BASE + S32K3XX_CAN_FDCRC_OFFSET)
#define S32K3XX_CAN0_ERFCR                   (S32K3XX_CAN0_BASE + S32K3XX_CAN_ERFCR_OFFSET)
#define S32K3XX_CAN0_ERFIER                  (S32K3XX_CAN0_BASE + S32K3XX_CAN_ERFIER_OFFSET)
#define S32K3XX_CAN0_ERFSR                   (S32K3XX_CAN0_BASE + S32K3XX_CAN_ERFSR_OFFSET)

#define S32K3XX_CAN0_HR_TIME_STAMP(n)        (S32K3XX_CAN0_BASE + S32K3XX_CAN_HR_TIME_STAMP_OFFSET(n))
#  define S32K3XX_CAN0_HR_TIME_STAMP0        (S32K3XX_CAN0_BASE + S32K3XX_CAN_HR_TIME_STAMP0_OFFSET)
#  define S32K3XX_CAN0_HR_TIME_STAMP1        (S32K3XX_CAN0_BASE + S32K3XX_CAN_HR_TIME_STAMP1_OFFSET)
#  define S32K3XX_CAN0_HR_TIME_STAMP2        (S32K3XX_CAN0_BASE + S32K3XX_CAN_HR_TIME_STAMP2_OFFSET)
#  define S32K3XX_CAN0_HR_TIME_STAMP3        (S32K3XX_CAN0_BASE + S32K3XX_CAN_HR_TIME_STAMP3_OFFSET)
#  define S32K3XX_CAN0_HR_TIME_STAMP4        (S32K3XX_CAN0_BASE + S32K3XX_CAN_HR_TIME_STAMP4_OFFSET)
#  define S32K3XX_CAN0_HR_TIME_STAMP5        (S32K3XX_CAN0_BASE + S32K3XX_CAN_HR_TIME_STAMP5_OFFSET)
#  define S32K3XX_CAN0_HR_TIME_STAMP6        (S32K3XX_CAN0_BASE + S32K3XX_CAN_HR_TIME_STAMP6_OFFSET)
#  define S32K3XX_CAN0_HR_TIME_STAMP7        (S32K3XX_CAN0_BASE + S32K3XX_CAN_HR_TIME_STAMP7_OFFSET)
#  define S32K3XX_CAN0_HR_TIME_STAMP8        (S32K3XX_CAN0_BASE + S32K3XX_CAN_HR_TIME_STAMP8_OFFSET)
#  define S32K3XX_CAN0_HR_TIME_STAMP9        (S32K3XX_CAN0_BASE + S32K3XX_CAN_HR_TIME_STAMP9_OFFSET)
#  define S32K3XX_CAN0_HR_TIME_STAMP10       (S32K3XX_CAN0_BASE + S32K3XX_CAN_HR_TIME_STAMP10_OFFSET)
#  define S32K3XX_CAN0_HR_TIME_STAMP11       (S32K3XX_CAN0_BASE + S32K3XX_CAN_HR_TIME_STAMP11_OFFSET)
#  define S32K3XX_CAN0_HR_TIME_STAMP12       (S32K3XX_CAN0_BASE + S32K3XX_CAN_HR_TIME_STAMP12_OFFSET)
#  define S32K3XX_CAN0_HR_TIME_STAMP13       (S32K3XX_CAN0_BASE + S32K3XX_CAN_HR_TIME_STAMP13_OFFSET)
#  define S32K3XX_CAN0_HR_TIME_STAMP14       (S32K3XX_CAN0_BASE + S32K3XX_CAN_HR_TIME_STAMP14_OFFSET)
#  define S32K3XX_CAN0_HR_TIME_STAMP15       (S32K3XX_CAN0_BASE + S32K3XX_CAN_HR_TIME_STAMP15_OFFSET)
#  define S32K3XX_CAN0_HR_TIME_STAMP16       (S32K3XX_CAN0_BASE + S32K3XX_CAN_HR_TIME_STAMP16_OFFSET)
#  define S32K3XX_CAN0_HR_TIME_STAMP17       (S32K3XX_CAN0_BASE + S32K3XX_CAN_HR_TIME_STAMP17_OFFSET)
#  define S32K3XX_CAN0_HR_TIME_STAMP18       (S32K3XX_CAN0_BASE + S32K3XX_CAN_HR_TIME_STAMP18_OFFSET)
#  define S32K3XX_CAN0_HR_TIME_STAMP19       (S32K3XX_CAN0_BASE + S32K3XX_CAN_HR_TIME_STAMP19_OFFSET)
#  define S32K3XX_CAN0_HR_TIME_STAMP20       (S32K3XX_CAN0_BASE + S32K3XX_CAN_HR_TIME_STAMP20_OFFSET)
#  define S32K3XX_CAN0_HR_TIME_STAMP21       (S32K3XX_CAN0_BASE + S32K3XX_CAN_HR_TIME_STAMP21_OFFSET)
#  define S32K3XX_CAN0_HR_TIME_STAMP22       (S32K3XX_CAN0_BASE + S32K3XX_CAN_HR_TIME_STAMP22_OFFSET)
#  define S32K3XX_CAN0_HR_TIME_STAMP23       (S32K3XX_CAN0_BASE + S32K3XX_CAN_HR_TIME_STAMP23_OFFSET)
#  define S32K3XX_CAN0_HR_TIME_STAMP24       (S32K3XX_CAN0_BASE + S32K3XX_CAN_HR_TIME_STAMP24_OFFSET)
#  define S32K3XX_CAN0_HR_TIME_STAMP25       (S32K3XX_CAN0_BASE + S32K3XX_CAN_HR_TIME_STAMP25_OFFSET)
#  define S32K3XX_CAN0_HR_TIME_STAMP26       (S32K3XX_CAN0_BASE + S32K3XX_CAN_HR_TIME_STAMP26_OFFSET)
#  define S32K3XX_CAN0_HR_TIME_STAMP27       (S32K3XX_CAN0_BASE + S32K3XX_CAN_HR_TIME_STAMP27_OFFSET)
#  define S32K3XX_CAN0_HR_TIME_STAMP28       (S32K3XX_CAN0_BASE + S32K3XX_CAN_HR_TIME_STAMP28_OFFSET)
#  define S32K3XX_CAN0_HR_TIME_STAMP29       (S32K3XX_CAN0_BASE + S32K3XX_CAN_HR_TIME_STAMP29_OFFSET)
#  define S32K3XX_CAN0_HR_TIME_STAMP30       (S32K3XX_CAN0_BASE + S32K3XX_CAN_HR_TIME_STAMP30_OFFSET)
#  define S32K3XX_CAN0_HR_TIME_STAMP31       (S32K3XX_CAN0_BASE + S32K3XX_CAN_HR_TIME_STAMP31_OFFSET)
#  define S32K3XX_CAN0_HR_TIME_STAMP32       (S32K3XX_CAN0_BASE + S32K3XX_CAN_HR_TIME_STAMP32_OFFSET)
#  define S32K3XX_CAN0_HR_TIME_STAMP33       (S32K3XX_CAN0_BASE + S32K3XX_CAN_HR_TIME_STAMP33_OFFSET)
#  define S32K3XX_CAN0_HR_TIME_STAMP34       (S32K3XX_CAN0_BASE + S32K3XX_CAN_HR_TIME_STAMP34_OFFSET)
#  define S32K3XX_CAN0_HR_TIME_STAMP35       (S32K3XX_CAN0_BASE + S32K3XX_CAN_HR_TIME_STAMP35_OFFSET)
#  define S32K3XX_CAN0_HR_TIME_STAMP36       (S32K3XX_CAN0_BASE + S32K3XX_CAN_HR_TIME_STAMP36_OFFSET)
#  define S32K3XX_CAN0_HR_TIME_STAMP37       (S32K3XX_CAN0_BASE + S32K3XX_CAN_HR_TIME_STAMP37_OFFSET)
#  define S32K3XX_CAN0_HR_TIME_STAMP38       (S32K3XX_CAN0_BASE + S32K3XX_CAN_HR_TIME_STAMP38_OFFSET)
#  define S32K3XX_CAN0_HR_TIME_STAMP39       (S32K3XX_CAN0_BASE + S32K3XX_CAN_HR_TIME_STAMP39_OFFSET)
#  define S32K3XX_CAN0_HR_TIME_STAMP40       (S32K3XX_CAN0_BASE + S32K3XX_CAN_HR_TIME_STAMP40_OFFSET)
#  define S32K3XX_CAN0_HR_TIME_STAMP41       (S32K3XX_CAN0_BASE + S32K3XX_CAN_HR_TIME_STAMP41_OFFSET)
#  define S32K3XX_CAN0_HR_TIME_STAMP42       (S32K3XX_CAN0_BASE + S32K3XX_CAN_HR_TIME_STAMP42_OFFSET)
#  define S32K3XX_CAN0_HR_TIME_STAMP43       (S32K3XX_CAN0_BASE + S32K3XX_CAN_HR_TIME_STAMP43_OFFSET)
#  define S32K3XX_CAN0_HR_TIME_STAMP44       (S32K3XX_CAN0_BASE + S32K3XX_CAN_HR_TIME_STAMP44_OFFSET)
#  define S32K3XX_CAN0_HR_TIME_STAMP45       (S32K3XX_CAN0_BASE + S32K3XX_CAN_HR_TIME_STAMP45_OFFSET)
#  define S32K3XX_CAN0_HR_TIME_STAMP46       (S32K3XX_CAN0_BASE + S32K3XX_CAN_HR_TIME_STAMP46_OFFSET)
#  define S32K3XX_CAN0_HR_TIME_STAMP47       (S32K3XX_CAN0_BASE + S32K3XX_CAN_HR_TIME_STAMP47_OFFSET)
#  define S32K3XX_CAN0_HR_TIME_STAMP48       (S32K3XX_CAN0_BASE + S32K3XX_CAN_HR_TIME_STAMP48_OFFSET)
#  define S32K3XX_CAN0_HR_TIME_STAMP49       (S32K3XX_CAN0_BASE + S32K3XX_CAN_HR_TIME_STAMP49_OFFSET)
#  define S32K3XX_CAN0_HR_TIME_STAMP50       (S32K3XX_CAN0_BASE + S32K3XX_CAN_HR_TIME_STAMP50_OFFSET)
#  define S32K3XX_CAN0_HR_TIME_STAMP51       (S32K3XX_CAN0_BASE + S32K3XX_CAN_HR_TIME_STAMP51_OFFSET)
#  define S32K3XX_CAN0_HR_TIME_STAMP52       (S32K3XX_CAN0_BASE + S32K3XX_CAN_HR_TIME_STAMP52_OFFSET)
#  define S32K3XX_CAN0_HR_TIME_STAMP53       (S32K3XX_CAN0_BASE + S32K3XX_CAN_HR_TIME_STAMP53_OFFSET)
#  define S32K3XX_CAN0_HR_TIME_STAMP54       (S32K3XX_CAN0_BASE + S32K3XX_CAN_HR_TIME_STAMP54_OFFSET)
#  define S32K3XX_CAN0_HR_TIME_STAMP55       (S32K3XX_CAN0_BASE + S32K3XX_CAN_HR_TIME_STAMP55_OFFSET)
#  define S32K3XX_CAN0_HR_TIME_STAMP56       (S32K3XX_CAN0_BASE + S32K3XX_CAN_HR_TIME_STAMP56_OFFSET)
#  define S32K3XX_CAN0_HR_TIME_STAMP57       (S32K3XX_CAN0_BASE + S32K3XX_CAN_HR_TIME_STAMP57_OFFSET)
#  define S32K3XX_CAN0_HR_TIME_STAMP58       (S32K3XX_CAN0_BASE + S32K3XX_CAN_HR_TIME_STAMP58_OFFSET)
#  define S32K3XX_CAN0_HR_TIME_STAMP59       (S32K3XX_CAN0_BASE + S32K3XX_CAN_HR_TIME_STAMP59_OFFSET)
#  define S32K3XX_CAN0_HR_TIME_STAMP60       (S32K3XX_CAN0_BASE + S32K3XX_CAN_HR_TIME_STAMP60_OFFSET)
#  define S32K3XX_CAN0_HR_TIME_STAMP61       (S32K3XX_CAN0_BASE + S32K3XX_CAN_HR_TIME_STAMP61_OFFSET)
#  define S32K3XX_CAN0_HR_TIME_STAMP62       (S32K3XX_CAN0_BASE + S32K3XX_CAN_HR_TIME_STAMP62_OFFSET)
#  define S32K3XX_CAN0_HR_TIME_STAMP63       (S32K3XX_CAN0_BASE + S32K3XX_CAN_HR_TIME_STAMP63_OFFSET)
#  define S32K3XX_CAN0_HR_TIME_STAMP64       (S32K3XX_CAN0_BASE + S32K3XX_CAN_HR_TIME_STAMP64_OFFSET)
#  define S32K3XX_CAN0_HR_TIME_STAMP65       (S32K3XX_CAN0_BASE + S32K3XX_CAN_HR_TIME_STAMP65_OFFSET)
#  define S32K3XX_CAN0_HR_TIME_STAMP66       (S32K3XX_CAN0_BASE + S32K3XX_CAN_HR_TIME_STAMP66_OFFSET)
#  define S32K3XX_CAN0_HR_TIME_STAMP67       (S32K3XX_CAN0_BASE + S32K3XX_CAN_HR_TIME_STAMP67_OFFSET)
#  define S32K3XX_CAN0_HR_TIME_STAMP68       (S32K3XX_CAN0_BASE + S32K3XX_CAN_HR_TIME_STAMP68_OFFSET)
#  define S32K3XX_CAN0_HR_TIME_STAMP69       (S32K3XX_CAN0_BASE + S32K3XX_CAN_HR_TIME_STAMP69_OFFSET)
#  define S32K3XX_CAN0_HR_TIME_STAMP70       (S32K3XX_CAN0_BASE + S32K3XX_CAN_HR_TIME_STAMP70_OFFSET)
#  define S32K3XX_CAN0_HR_TIME_STAMP71       (S32K3XX_CAN0_BASE + S32K3XX_CAN_HR_TIME_STAMP71_OFFSET)
#  define S32K3XX_CAN0_HR_TIME_STAMP72       (S32K3XX_CAN0_BASE + S32K3XX_CAN_HR_TIME_STAMP72_OFFSET)
#  define S32K3XX_CAN0_HR_TIME_STAMP73       (S32K3XX_CAN0_BASE + S32K3XX_CAN_HR_TIME_STAMP73_OFFSET)
#  define S32K3XX_CAN0_HR_TIME_STAMP74       (S32K3XX_CAN0_BASE + S32K3XX_CAN_HR_TIME_STAMP74_OFFSET)
#  define S32K3XX_CAN0_HR_TIME_STAMP75       (S32K3XX_CAN0_BASE + S32K3XX_CAN_HR_TIME_STAMP75_OFFSET)
#  define S32K3XX_CAN0_HR_TIME_STAMP76       (S32K3XX_CAN0_BASE + S32K3XX_CAN_HR_TIME_STAMP76_OFFSET)
#  define S32K3XX_CAN0_HR_TIME_STAMP77       (S32K3XX_CAN0_BASE + S32K3XX_CAN_HR_TIME_STAMP77_OFFSET)
#  define S32K3XX_CAN0_HR_TIME_STAMP78       (S32K3XX_CAN0_BASE + S32K3XX_CAN_HR_TIME_STAMP78_OFFSET)
#  define S32K3XX_CAN0_HR_TIME_STAMP79       (S32K3XX_CAN0_BASE + S32K3XX_CAN_HR_TIME_STAMP79_OFFSET)
#  define S32K3XX_CAN0_HR_TIME_STAMP80       (S32K3XX_CAN0_BASE + S32K3XX_CAN_HR_TIME_STAMP80_OFFSET)
#  define S32K3XX_CAN0_HR_TIME_STAMP81       (S32K3XX_CAN0_BASE + S32K3XX_CAN_HR_TIME_STAMP81_OFFSET)
#  define S32K3XX_CAN0_HR_TIME_STAMP82       (S32K3XX_CAN0_BASE + S32K3XX_CAN_HR_TIME_STAMP82_OFFSET)
#  define S32K3XX_CAN0_HR_TIME_STAMP83       (S32K3XX_CAN0_BASE + S32K3XX_CAN_HR_TIME_STAMP83_OFFSET)
#  define S32K3XX_CAN0_HR_TIME_STAMP84       (S32K3XX_CAN0_BASE + S32K3XX_CAN_HR_TIME_STAMP84_OFFSET)
#  define S32K3XX_CAN0_HR_TIME_STAMP85       (S32K3XX_CAN0_BASE + S32K3XX_CAN_HR_TIME_STAMP85_OFFSET)
#  define S32K3XX_CAN0_HR_TIME_STAMP86       (S32K3XX_CAN0_BASE + S32K3XX_CAN_HR_TIME_STAMP86_OFFSET)
#  define S32K3XX_CAN0_HR_TIME_STAMP87       (S32K3XX_CAN0_BASE + S32K3XX_CAN_HR_TIME_STAMP87_OFFSET)
#  define S32K3XX_CAN0_HR_TIME_STAMP88       (S32K3XX_CAN0_BASE + S32K3XX_CAN_HR_TIME_STAMP88_OFFSET)
#  define S32K3XX_CAN0_HR_TIME_STAMP89       (S32K3XX_CAN0_BASE + S32K3XX_CAN_HR_TIME_STAMP89_OFFSET)
#  define S32K3XX_CAN0_HR_TIME_STAMP90       (S32K3XX_CAN0_BASE + S32K3XX_CAN_HR_TIME_STAMP90_OFFSET)
#  define S32K3XX_CAN0_HR_TIME_STAMP91       (S32K3XX_CAN0_BASE + S32K3XX_CAN_HR_TIME_STAMP91_OFFSET)
#  define S32K3XX_CAN0_HR_TIME_STAMP92       (S32K3XX_CAN0_BASE + S32K3XX_CAN_HR_TIME_STAMP92_OFFSET)
#  define S32K3XX_CAN0_HR_TIME_STAMP93       (S32K3XX_CAN0_BASE + S32K3XX_CAN_HR_TIME_STAMP93_OFFSET)
#  define S32K3XX_CAN0_HR_TIME_STAMP94       (S32K3XX_CAN0_BASE + S32K3XX_CAN_HR_TIME_STAMP94_OFFSET)
#  define S32K3XX_CAN0_HR_TIME_STAMP95       (S32K3XX_CAN0_BASE + S32K3XX_CAN_HR_TIME_STAMP95_OFFSET)

