apache/nuttx/arch/arm/src/s32k3xx/hardware/s32k3xx_flexcan.h
#define S32K3XX_CAN0_ERFFEL(n)               (S32K3XX_CAN0_BASE + S32K3XX_CAN_ERFFEL_OFFSET(n))
#  define S32K3XX_CAN0_ERFFEL0               (S32K3XX_CAN0_BASE + S32K3XX_CAN_ERFFEL0_OFFSET)
#  define S32K3XX_CAN0_ERFFEL1               (S32K3XX_CAN0_BASE + S32K3XX_CAN_ERFFEL1_OFFSET)
#  define S32K3XX_CAN0_ERFFEL2               (S32K3XX_CAN0_BASE + S32K3XX_CAN_ERFFEL2_OFFSET)
#  define S32K3XX_CAN0_ERFFEL3               (S32K3XX_CAN0_BASE + S32K3XX_CAN_ERFFEL3_OFFSET)
#  define S32K3XX_CAN0_ERFFEL4               (S32K3XX_CAN0_BASE + S32K3XX_CAN_ERFFEL4_OFFSET)
#  define S32K3XX_CAN0_ERFFEL5               (S32K3XX_CAN0_BASE + S32K3XX_CAN_ERFFEL5_OFFSET)
#  define S32K3XX_CAN0_ERFFEL6               (S32K3XX_CAN0_BASE + S32K3XX_CAN_ERFFEL6_OFFSET)
#  define S32K3XX_CAN0_ERFFEL7               (S32K3XX_CAN0_BASE + S32K3XX_CAN_ERFFEL7_OFFSET)
#  define S32K3XX_CAN0_ERFFEL8               (S32K3XX_CAN0_BASE + S32K3XX_CAN_ERFFEL8_OFFSET)
#  define S32K3XX_CAN0_ERFFEL9               (S32K3XX_CAN0_BASE + S32K3XX_CAN_ERFFEL9_OFFSET)
#  define S32K3XX_CAN0_ERFFEL10              (S32K3XX_CAN0_BASE + S32K3XX_CAN_ERFFEL10_OFFSET)
#  define S32K3XX_CAN0_ERFFEL11              (S32K3XX_CAN0_BASE + S32K3XX_CAN_ERFFEL11_OFFSET)
#  define S32K3XX_CAN0_ERFFEL12              (S32K3XX_CAN0_BASE + S32K3XX_CAN_ERFFEL12_OFFSET)
#  define S32K3XX_CAN0_ERFFEL13              (S32K3XX_CAN0_BASE + S32K3XX_CAN_ERFFEL13_OFFSET)
#  define S32K3XX_CAN0_ERFFEL14              (S32K3XX_CAN0_BASE + S32K3XX_CAN_ERFFEL14_OFFSET)
#  define S32K3XX_CAN0_ERFFEL15              (S32K3XX_CAN0_BASE + S32K3XX_CAN_ERFFEL15_OFFSET)
#  define S32K3XX_CAN0_ERFFEL16              (S32K3XX_CAN0_BASE + S32K3XX_CAN_ERFFEL16_OFFSET)
#  define S32K3XX_CAN0_ERFFEL17              (S32K3XX_CAN0_BASE + S32K3XX_CAN_ERFFEL17_OFFSET)
#  define S32K3XX_CAN0_ERFFEL18              (S32K3XX_CAN0_BASE + S32K3XX_CAN_ERFFEL18_OFFSET)
#  define S32K3XX_CAN0_ERFFEL19              (S32K3XX_CAN0_BASE + S32K3XX_CAN_ERFFEL19_OFFSET)
#  define S32K3XX_CAN0_ERFFEL20              (S32K3XX_CAN0_BASE + S32K3XX_CAN_ERFFEL20_OFFSET)
#  define S32K3XX_CAN0_ERFFEL21              (S32K3XX_CAN0_BASE + S32K3XX_CAN_ERFFEL21_OFFSET)
#  define S32K3XX_CAN0_ERFFEL22              (S32K3XX_CAN0_BASE + S32K3XX_CAN_ERFFEL22_OFFSET)
#  define S32K3XX_CAN0_ERFFEL23              (S32K3XX_CAN0_BASE + S32K3XX_CAN_ERFFEL23_OFFSET)
#  define S32K3XX_CAN0_ERFFEL24              (S32K3XX_CAN0_BASE + S32K3XX_CAN_ERFFEL24_OFFSET)
#  define S32K3XX_CAN0_ERFFEL25              (S32K3XX_CAN0_BASE + S32K3XX_CAN_ERFFEL25_OFFSET)
#  define S32K3XX_CAN0_ERFFEL26              (S32K3XX_CAN0_BASE + S32K3XX_CAN_ERFFEL26_OFFSET)
#  define S32K3XX_CAN0_ERFFEL27              (S32K3XX_CAN0_BASE + S32K3XX_CAN_ERFFEL27_OFFSET)
#  define S32K3XX_CAN0_ERFFEL28              (S32K3XX_CAN0_BASE + S32K3XX_CAN_ERFFEL28_OFFSET)
#  define S32K3XX_CAN0_ERFFEL29              (S32K3XX_CAN0_BASE + S32K3XX_CAN_ERFFEL29_OFFSET)
#  define S32K3XX_CAN0_ERFFEL30              (S32K3XX_CAN0_BASE + S32K3XX_CAN_ERFFEL30_OFFSET)
#  define S32K3XX_CAN0_ERFFEL31              (S32K3XX_CAN0_BASE + S32K3XX_CAN_ERFFEL31_OFFSET)
#  define S32K3XX_CAN0_ERFFEL32              (S32K3XX_CAN0_BASE + S32K3XX_CAN_ERFFEL32_OFFSET)
#  define S32K3XX_CAN0_ERFFEL33              (S32K3XX_CAN0_BASE + S32K3XX_CAN_ERFFEL33_OFFSET)
#  define S32K3XX_CAN0_ERFFEL34              (S32K3XX_CAN0_BASE + S32K3XX_CAN_ERFFEL34_OFFSET)
#  define S32K3XX_CAN0_ERFFEL35              (S32K3XX_CAN0_BASE + S32K3XX_CAN_ERFFEL35_OFFSET)
#  define S32K3XX_CAN0_ERFFEL36              (S32K3XX_CAN0_BASE + S32K3XX_CAN_ERFFEL36_OFFSET)
#  define S32K3XX_CAN0_ERFFEL37              (S32K3XX_CAN0_BASE + S32K3XX_CAN_ERFFEL37_OFFSET)
#  define S32K3XX_CAN0_ERFFEL38              (S32K3XX_CAN0_BASE + S32K3XX_CAN_ERFFEL38_OFFSET)
#  define S32K3XX_CAN0_ERFFEL39              (S32K3XX_CAN0_BASE + S32K3XX_CAN_ERFFEL39_OFFSET)
#  define S32K3XX_CAN0_ERFFEL40              (S32K3XX_CAN0_BASE + S32K3XX_CAN_ERFFEL40_OFFSET)
#  define S32K3XX_CAN0_ERFFEL41              (S32K3XX_CAN0_BASE + S32K3XX_CAN_ERFFEL41_OFFSET)
#  define S32K3XX_CAN0_ERFFEL42              (S32K3XX_CAN0_BASE + S32K3XX_CAN_ERFFEL42_OFFSET)
#  define S32K3XX_CAN0_ERFFEL43              (S32K3XX_CAN0_BASE + S32K3XX_CAN_ERFFEL43_OFFSET)
#  define S32K3XX_CAN0_ERFFEL44              (S32K3XX_CAN0_BASE + S32K3XX_CAN_ERFFEL44_OFFSET)
#  define S32K3XX_CAN0_ERFFEL45              (S32K3XX_CAN0_BASE + S32K3XX_CAN_ERFFEL45_OFFSET)
#  define S32K3XX_CAN0_ERFFEL46              (S32K3XX_CAN0_BASE + S32K3XX_CAN_ERFFEL46_OFFSET)
#  define S32K3XX_CAN0_ERFFEL47              (S32K3XX_CAN0_BASE + S32K3XX_CAN_ERFFEL47_OFFSET)
#  define S32K3XX_CAN0_ERFFEL48              (S32K3XX_CAN0_BASE + S32K3XX_CAN_ERFFEL48_OFFSET)
#  define S32K3XX_CAN0_ERFFEL49              (S32K3XX_CAN0_BASE + S32K3XX_CAN_ERFFEL49_OFFSET)
#  define S32K3XX_CAN0_ERFFEL50              (S32K3XX_CAN0_BASE + S32K3XX_CAN_ERFFEL50_OFFSET)
#  define S32K3XX_CAN0_ERFFEL51              (S32K3XX_CAN0_BASE + S32K3XX_CAN_ERFFEL51_OFFSET)
#  define S32K3XX_CAN0_ERFFEL52              (S32K3XX_CAN0_BASE + S32K3XX_CAN_ERFFEL52_OFFSET)
#  define S32K3XX_CAN0_ERFFEL53              (S32K3XX_CAN0_BASE + S32K3XX_CAN_ERFFEL53_OFFSET)
#  define S32K3XX_CAN0_ERFFEL54              (S32K3XX_CAN0_BASE + S32K3XX_CAN_ERFFEL54_OFFSET)
#  define S32K3XX_CAN0_ERFFEL55              (S32K3XX_CAN0_BASE + S32K3XX_CAN_ERFFEL55_OFFSET)
#  define S32K3XX_CAN0_ERFFEL56              (S32K3XX_CAN0_BASE + S32K3XX_CAN_ERFFEL56_OFFSET)
#  define S32K3XX_CAN0_ERFFEL57              (S32K3XX_CAN0_BASE + S32K3XX_CAN_ERFFEL57_OFFSET)
#  define S32K3XX_CAN0_ERFFEL58              (S32K3XX_CAN0_BASE + S32K3XX_CAN_ERFFEL58_OFFSET)
#  define S32K3XX_CAN0_ERFFEL59              (S32K3XX_CAN0_BASE + S32K3XX_CAN_ERFFEL59_OFFSET)
#  define S32K3XX_CAN0_ERFFEL60              (S32K3XX_CAN0_BASE + S32K3XX_CAN_ERFFEL60_OFFSET)
#  define S32K3XX_CAN0_ERFFEL61              (S32K3XX_CAN0_BASE + S32K3XX_CAN_ERFFEL61_OFFSET)
#  define S32K3XX_CAN0_ERFFEL62              (S32K3XX_CAN0_BASE + S32K3XX_CAN_ERFFEL62_OFFSET)
#  define S32K3XX_CAN0_ERFFEL63              (S32K3XX_CAN0_BASE + S32K3XX_CAN_ERFFEL63_OFFSET)
#  define S32K3XX_CAN0_ERFFEL64              (S32K3XX_CAN0_BASE + S32K3XX_CAN_ERFFEL64_OFFSET)
#  define S32K3XX_CAN0_ERFFEL65              (S32K3XX_CAN0_BASE + S32K3XX_CAN_ERFFEL65_OFFSET)
#  define S32K3XX_CAN0_ERFFEL66              (S32K3XX_CAN0_BASE + S32K3XX_CAN_ERFFEL66_OFFSET)
#  define S32K3XX_CAN0_ERFFEL67              (S32K3XX_CAN0_BASE + S32K3XX_CAN_ERFFEL67_OFFSET)
#  define S32K3XX_CAN0_ERFFEL68              (S32K3XX_CAN0_BASE + S32K3XX_CAN_ERFFEL68_OFFSET)
#  define S32K3XX_CAN0_ERFFEL69              (S32K3XX_CAN0_BASE + S32K3XX_CAN_ERFFEL69_OFFSET)
#  define S32K3XX_CAN0_ERFFEL70              (S32K3XX_CAN0_BASE + S32K3XX_CAN_ERFFEL70_OFFSET)
#  define S32K3XX_CAN0_ERFFEL71              (S32K3XX_CAN0_BASE + S32K3XX_CAN_ERFFEL71_OFFSET)
#  define S32K3XX_CAN0_ERFFEL72              (S32K3XX_CAN0_BASE + S32K3XX_CAN_ERFFEL72_OFFSET)
#  define S32K3XX_CAN0_ERFFEL73              (S32K3XX_CAN0_BASE + S32K3XX_CAN_ERFFEL73_OFFSET)
#  define S32K3XX_CAN0_ERFFEL74              (S32K3XX_CAN0_BASE + S32K3XX_CAN_ERFFEL74_OFFSET)
#  define S32K3XX_CAN0_ERFFEL75              (S32K3XX_CAN0_BASE + S32K3XX_CAN_ERFFEL75_OFFSET)
#  define S32K3XX_CAN0_ERFFEL76              (S32K3XX_CAN0_BASE + S32K3XX_CAN_ERFFEL76_OFFSET)
#  define S32K3XX_CAN0_ERFFEL77              (S32K3XX_CAN0_BASE + S32K3XX_CAN_ERFFEL77_OFFSET)
#  define S32K3XX_CAN0_ERFFEL78              (S32K3XX_CAN0_BASE + S32K3XX_CAN_ERFFEL78_OFFSET)
#  define S32K3XX_CAN0_ERFFEL79              (S32K3XX_CAN0_BASE + S32K3XX_CAN_ERFFEL79_OFFSET)
#  define S32K3XX_CAN0_ERFFEL80              (S32K3XX_CAN0_BASE + S32K3XX_CAN_ERFFEL80_OFFSET)
#  define S32K3XX_CAN0_ERFFEL81              (S32K3XX_CAN0_BASE + S32K3XX_CAN_ERFFEL81_OFFSET)
#  define S32K3XX_CAN0_ERFFEL82              (S32K3XX_CAN0_BASE + S32K3XX_CAN_ERFFEL82_OFFSET)
#  define S32K3XX_CAN0_ERFFEL83              (S32K3XX_CAN0_BASE + S32K3XX_CAN_ERFFEL83_OFFSET)
#  define S32K3XX_CAN0_ERFFEL84              (S32K3XX_CAN0_BASE + S32K3XX_CAN_ERFFEL84_OFFSET)
#  define S32K3XX_CAN0_ERFFEL85              (S32K3XX_CAN0_BASE + S32K3XX_CAN_ERFFEL85_OFFSET)
#  define S32K3XX_CAN0_ERFFEL86              (S32K3XX_CAN0_BASE + S32K3XX_CAN_ERFFEL86_OFFSET)
#  define S32K3XX_CAN0_ERFFEL87              (S32K3XX_CAN0_BASE + S32K3XX_CAN_ERFFEL87_OFFSET)
#  define S32K3XX_CAN0_ERFFEL88              (S32K3XX_CAN0_BASE + S32K3XX_CAN_ERFFEL88_OFFSET)
#  define S32K3XX_CAN0_ERFFEL89              (S32K3XX_CAN0_BASE + S32K3XX_CAN_ERFFEL89_OFFSET)
#  define S32K3XX_CAN0_ERFFEL90              (S32K3XX_CAN0_BASE + S32K3XX_CAN_ERFFEL90_OFFSET)
#  define S32K3XX_CAN0_ERFFEL91              (S32K3XX_CAN0_BASE + S32K3XX_CAN_ERFFEL91_OFFSET)
#  define S32K3XX_CAN0_ERFFEL92              (S32K3XX_CAN0_BASE + S32K3XX_CAN_ERFFEL92_OFFSET)
#  define S32K3XX_CAN0_ERFFEL93              (S32K3XX_CAN0_BASE + S32K3XX_CAN_ERFFEL93_OFFSET)
#  define S32K3XX_CAN0_ERFFEL94              (S32K3XX_CAN0_BASE + S32K3XX_CAN_ERFFEL94_OFFSET)
#  define S32K3XX_CAN0_ERFFEL95              (S32K3XX_CAN0_BASE + S32K3XX_CAN_ERFFEL95_OFFSET)
#  define S32K3XX_CAN0_ERFFEL96              (S32K3XX_CAN0_BASE + S32K3XX_CAN_ERFFEL96_OFFSET)
#  define S32K3XX_CAN0_ERFFEL97              (S32K3XX_CAN0_BASE + S32K3XX_CAN_ERFFEL97_OFFSET)
#  define S32K3XX_CAN0_ERFFEL98              (S32K3XX_CAN0_BASE + S32K3XX_CAN_ERFFEL98_OFFSET)
#  define S32K3XX_CAN0_ERFFEL99              (S32K3XX_CAN0_BASE + S32K3XX_CAN_ERFFEL99_OFFSET)
#  define S32K3XX_CAN0_ERFFEL100             (S32K3XX_CAN0_BASE + S32K3XX_CAN_ERFFEL100_OFFSET)
#  define S32K3XX_CAN0_ERFFEL101             (S32K3XX_CAN0_BASE + S32K3XX_CAN_ERFFEL101_OFFSET)
#  define S32K3XX_CAN0_ERFFEL102             (S32K3XX_CAN0_BASE + S32K3XX_CAN_ERFFEL102_OFFSET)
#  define S32K3XX_CAN0_ERFFEL103             (S32K3XX_CAN0_BASE + S32K3XX_CAN_ERFFEL103_OFFSET)
#  define S32K3XX_CAN0_ERFFEL104             (S32K3XX_CAN0_BASE + S32K3XX_CAN_ERFFEL104_OFFSET)
#  define S32K3XX_CAN0_ERFFEL105             (S32K3XX_CAN0_BASE + S32K3XX_CAN_ERFFEL105_OFFSET)
#  define S32K3XX_CAN0_ERFFEL106             (S32K3XX_CAN0_BASE + S32K3XX_CAN_ERFFEL106_OFFSET)
#  define S32K3XX_CAN0_ERFFEL107             (S32K3XX_CAN0_BASE + S32K3XX_CAN_ERFFEL107_OFFSET)
#  define S32K3XX_CAN0_ERFFEL108             (S32K3XX_CAN0_BASE + S32K3XX_CAN_ERFFEL108_OFFSET)
#  define S32K3XX_CAN0_ERFFEL109             (S32K3XX_CAN0_BASE + S32K3XX_CAN_ERFFEL109_OFFSET)
#  define S32K3XX_CAN0_ERFFEL110             (S32K3XX_CAN0_BASE + S32K3XX_CAN_ERFFEL110_OFFSET)
#  define S32K3XX_CAN0_ERFFEL111             (S32K3XX_CAN0_BASE + S32K3XX_CAN_ERFFEL111_OFFSET)
#  define S32K3XX_CAN0_ERFFEL112             (S32K3XX_CAN0_BASE + S32K3XX_CAN_ERFFEL112_OFFSET)
#  define S32K3XX_CAN0_ERFFEL113             (S32K3XX_CAN0_BASE + S32K3XX_CAN_ERFFEL113_OFFSET)
#  define S32K3XX_CAN0_ERFFEL114             (S32K3XX_CAN0_BASE + S32K3XX_CAN_ERFFEL114_OFFSET)
#  define S32K3XX_CAN0_ERFFEL115             (S32K3XX_CAN0_BASE + S32K3XX_CAN_ERFFEL115_OFFSET)
#  define S32K3XX_CAN0_ERFFEL116             (S32K3XX_CAN0_BASE + S32K3XX_CAN_ERFFEL116_OFFSET)
#  define S32K3XX_CAN0_ERFFEL117             (S32K3XX_CAN0_BASE + S32K3XX_CAN_ERFFEL117_OFFSET)
#  define S32K3XX_CAN0_ERFFEL118             (S32K3XX_CAN0_BASE + S32K3XX_CAN_ERFFEL118_OFFSET)
#  define S32K3XX_CAN0_ERFFEL119             (S32K3XX_CAN0_BASE + S32K3XX_CAN_ERFFEL119_OFFSET)
#  define S32K3XX_CAN0_ERFFEL120             (S32K3XX_CAN0_BASE + S32K3XX_CAN_ERFFEL120_OFFSET)
#  define S32K3XX_CAN0_ERFFEL121             (S32K3XX_CAN0_BASE + S32K3XX_CAN_ERFFEL121_OFFSET)
#  define S32K3XX_CAN0_ERFFEL122             (S32K3XX_CAN0_BASE + S32K3XX_CAN_ERFFEL122_OFFSET)
#  define S32K3XX_CAN0_ERFFEL123             (S32K3XX_CAN0_BASE + S32K3XX_CAN_ERFFEL123_OFFSET)
#  define S32K3XX_CAN0_ERFFEL124             (S32K3XX_CAN0_BASE + S32K3XX_CAN_ERFFEL124_OFFSET)
#  define S32K3XX_CAN0_ERFFEL125             (S32K3XX_CAN0_BASE + S32K3XX_CAN_ERFFEL125_OFFSET)
#  define S32K3XX_CAN0_ERFFEL126             (S32K3XX_CAN0_BASE + S32K3XX_CAN_ERFFEL126_OFFSET)
#  define S32K3XX_CAN0_ERFFEL127             (S32K3XX_CAN0_BASE + S32K3XX_CAN_ERFFEL127_OFFSET)

/* FlexCAN1 */

