apache/nuttx/arch/arm/src/s32k3xx/hardware/s32k3xx_flexcan.h
#define S32K3XX_CAN1_MECR                    (S32K3XX_CAN1_BASE + S32K3XX_CAN_MECR_OFFSET)
#define S32K3XX_CAN1_ERRIAR                  (S32K3XX_CAN1_BASE + S32K3XX_CAN_ERRIAR_OFFSET)
#define S32K3XX_CAN1_ERRIDPR                 (S32K3XX_CAN1_BASE + S32K3XX_CAN_ERRIDPR_OFFSET)
#define S32K3XX_CAN1_ERRIPPR                 (S32K3XX_CAN1_BASE + S32K3XX_CAN_ERRIPPR_OFFSET)
#define S32K3XX_CAN1_RERRAR                  (S32K3XX_CAN1_BASE + S32K3XX_CAN_RERRAR_OFFSET)
#define S32K3XX_CAN1_RERRDR                  (S32K3XX_CAN1_BASE + S32K3XX_CAN_RERRDR_OFFSET)
#define S32K3XX_CAN1_RERRSYNR                (S32K3XX_CAN1_BASE + S32K3XX_CAN_RERRSYNR_OFFSET)
#define S32K3XX_CAN1_ERRSR                   (S32K3XX_CAN1_BASE + S32K3XX_CAN_ERRSR_OFFSET)
#define S32K3XX_CAN1_EPRS                    (S32K3XX_CAN1_BASE + S32K3XX_CAN_EPRS_OFFSET)
#define S32K3XX_CAN1_ENCBT                   (S32K3XX_CAN1_BASE + S32K3XX_CAN_ENCBT_OFFSET)
#define S32K3XX_CAN1_EDCBT                   (S32K3XX_CAN1_BASE + S32K3XX_CAN_EDCBT_OFFSET)
#define S32K3XX_CAN1_ETDC                    (S32K3XX_CAN1_BASE + S32K3XX_CAN_ETDC_OFFSET)
#define S32K3XX_CAN1_FDCTRL                  (S32K3XX_CAN1_BASE + S32K3XX_CAN_FDCTRL_OFFSET)
#define S32K3XX_CAN1_FDCBT                   (S32K3XX_CAN1_BASE + S32K3XX_CAN_FDCBT_OFFSET)
#define S32K3XX_CAN1_FDCRC                   (S32K3XX_CAN1_BASE + S32K3XX_CAN_FDCRC_OFFSET)
#define S32K3XX_CAN1_ERFCR                   (S32K3XX_CAN1_BASE + S32K3XX_CAN_ERFCR_OFFSET)
#define S32K3XX_CAN1_ERFIER                  (S32K3XX_CAN1_BASE + S32K3XX_CAN_ERFIER_OFFSET)
#define S32K3XX_CAN1_ERFSR                   (S32K3XX_CAN1_BASE + S32K3XX_CAN_ERFSR_OFFSET)

#define S32K3XX_CAN1_HR_TIME_STAMP(n)        (S32K3XX_CAN1_BASE + S32K3XX_CAN_HR_TIME_STAMP_OFFSET(n))
#  define S32K3XX_CAN1_HR_TIME_STAMP0        (S32K3XX_CAN1_BASE + S32K3XX_CAN_HR_TIME_STAMP0_OFFSET)
#  define S32K3XX_CAN1_HR_TIME_STAMP1        (S32K3XX_CAN1_BASE + S32K3XX_CAN_HR_TIME_STAMP1_OFFSET)
#  define S32K3XX_CAN1_HR_TIME_STAMP2        (S32K3XX_CAN1_BASE + S32K3XX_CAN_HR_TIME_STAMP2_OFFSET)
#  define S32K3XX_CAN1_HR_TIME_STAMP3        (S32K3XX_CAN1_BASE + S32K3XX_CAN_HR_TIME_STAMP3_OFFSET)
#  define S32K3XX_CAN1_HR_TIME_STAMP4        (S32K3XX_CAN1_BASE + S32K3XX_CAN_HR_TIME_STAMP4_OFFSET)
#  define S32K3XX_CAN1_HR_TIME_STAMP5        (S32K3XX_CAN1_BASE + S32K3XX_CAN_HR_TIME_STAMP5_OFFSET)
#  define S32K3XX_CAN1_HR_TIME_STAMP6        (S32K3XX_CAN1_BASE + S32K3XX_CAN_HR_TIME_STAMP6_OFFSET)
#  define S32K3XX_CAN1_HR_TIME_STAMP7        (S32K3XX_CAN1_BASE + S32K3XX_CAN_HR_TIME_STAMP7_OFFSET)
#  define S32K3XX_CAN1_HR_TIME_STAMP8        (S32K3XX_CAN1_BASE + S32K3XX_CAN_HR_TIME_STAMP8_OFFSET)
#  define S32K3XX_CAN1_HR_TIME_STAMP9        (S32K3XX_CAN1_BASE + S32K3XX_CAN_HR_TIME_STAMP9_OFFSET)
#  define S32K3XX_CAN1_HR_TIME_STAMP10       (S32K3XX_CAN1_BASE + S32K3XX_CAN_HR_TIME_STAMP10_OFFSET)
#  define S32K3XX_CAN1_HR_TIME_STAMP11       (S32K3XX_CAN1_BASE + S32K3XX_CAN_HR_TIME_STAMP11_OFFSET)
#  define S32K3XX_CAN1_HR_TIME_STAMP12       (S32K3XX_CAN1_BASE + S32K3XX_CAN_HR_TIME_STAMP12_OFFSET)
#  define S32K3XX_CAN1_HR_TIME_STAMP13       (S32K3XX_CAN1_BASE + S32K3XX_CAN_HR_TIME_STAMP13_OFFSET)
#  define S32K3XX_CAN1_HR_TIME_STAMP14       (S32K3XX_CAN1_BASE + S32K3XX_CAN_HR_TIME_STAMP14_OFFSET)
#  define S32K3XX_CAN1_HR_TIME_STAMP15       (S32K3XX_CAN1_BASE + S32K3XX_CAN_HR_TIME_STAMP15_OFFSET)
#  define S32K3XX_CAN1_HR_TIME_STAMP16       (S32K3XX_CAN1_BASE + S32K3XX_CAN_HR_TIME_STAMP16_OFFSET)
#  define S32K3XX_CAN1_HR_TIME_STAMP17       (S32K3XX_CAN1_BASE + S32K3XX_CAN_HR_TIME_STAMP17_OFFSET)
#  define S32K3XX_CAN1_HR_TIME_STAMP18       (S32K3XX_CAN1_BASE + S32K3XX_CAN_HR_TIME_STAMP18_OFFSET)
#  define S32K3XX_CAN1_HR_TIME_STAMP19       (S32K3XX_CAN1_BASE + S32K3XX_CAN_HR_TIME_STAMP19_OFFSET)
#  define S32K3XX_CAN1_HR_TIME_STAMP20       (S32K3XX_CAN1_BASE + S32K3XX_CAN_HR_TIME_STAMP20_OFFSET)
#  define S32K3XX_CAN1_HR_TIME_STAMP21       (S32K3XX_CAN1_BASE + S32K3XX_CAN_HR_TIME_STAMP21_OFFSET)
#  define S32K3XX_CAN1_HR_TIME_STAMP22       (S32K3XX_CAN1_BASE + S32K3XX_CAN_HR_TIME_STAMP22_OFFSET)
#  define S32K3XX_CAN1_HR_TIME_STAMP23       (S32K3XX_CAN1_BASE + S32K3XX_CAN_HR_TIME_STAMP23_OFFSET)
#  define S32K3XX_CAN1_HR_TIME_STAMP24       (S32K3XX_CAN1_BASE + S32K3XX_CAN_HR_TIME_STAMP24_OFFSET)
#  define S32K3XX_CAN1_HR_TIME_STAMP25       (S32K3XX_CAN1_BASE + S32K3XX_CAN_HR_TIME_STAMP25_OFFSET)
#  define S32K3XX_CAN1_HR_TIME_STAMP26       (S32K3XX_CAN1_BASE + S32K3XX_CAN_HR_TIME_STAMP26_OFFSET)
#  define S32K3XX_CAN1_HR_TIME_STAMP27       (S32K3XX_CAN1_BASE + S32K3XX_CAN_HR_TIME_STAMP27_OFFSET)
#  define S32K3XX_CAN1_HR_TIME_STAMP28       (S32K3XX_CAN1_BASE + S32K3XX_CAN_HR_TIME_STAMP28_OFFSET)
#  define S32K3XX_CAN1_HR_TIME_STAMP29       (S32K3XX_CAN1_BASE + S32K3XX_CAN_HR_TIME_STAMP29_OFFSET)
#  define S32K3XX_CAN1_HR_TIME_STAMP30       (S32K3XX_CAN1_BASE + S32K3XX_CAN_HR_TIME_STAMP30_OFFSET)
#  define S32K3XX_CAN1_HR_TIME_STAMP31       (S32K3XX_CAN1_BASE + S32K3XX_CAN_HR_TIME_STAMP31_OFFSET)
#  define S32K3XX_CAN1_HR_TIME_STAMP32       (S32K3XX_CAN1_BASE + S32K3XX_CAN_HR_TIME_STAMP32_OFFSET)
#  define S32K3XX_CAN1_HR_TIME_STAMP33       (S32K3XX_CAN1_BASE + S32K3XX_CAN_HR_TIME_STAMP33_OFFSET)
#  define S32K3XX_CAN1_HR_TIME_STAMP34       (S32K3XX_CAN1_BASE + S32K3XX_CAN_HR_TIME_STAMP34_OFFSET)
#  define S32K3XX_CAN1_HR_TIME_STAMP35       (S32K3XX_CAN1_BASE + S32K3XX_CAN_HR_TIME_STAMP35_OFFSET)
#  define S32K3XX_CAN1_HR_TIME_STAMP36       (S32K3XX_CAN1_BASE + S32K3XX_CAN_HR_TIME_STAMP36_OFFSET)
#  define S32K3XX_CAN1_HR_TIME_STAMP37       (S32K3XX_CAN1_BASE + S32K3XX_CAN_HR_TIME_STAMP37_OFFSET)
#  define S32K3XX_CAN1_HR_TIME_STAMP38       (S32K3XX_CAN1_BASE + S32K3XX_CAN_HR_TIME_STAMP38_OFFSET)
#  define S32K3XX_CAN1_HR_TIME_STAMP39       (S32K3XX_CAN1_BASE + S32K3XX_CAN_HR_TIME_STAMP39_OFFSET)
#  define S32K3XX_CAN1_HR_TIME_STAMP40       (S32K3XX_CAN1_BASE + S32K3XX_CAN_HR_TIME_STAMP40_OFFSET)
#  define S32K3XX_CAN1_HR_TIME_STAMP41       (S32K3XX_CAN1_BASE + S32K3XX_CAN_HR_TIME_STAMP41_OFFSET)
#  define S32K3XX_CAN1_HR_TIME_STAMP42       (S32K3XX_CAN1_BASE + S32K3XX_CAN_HR_TIME_STAMP42_OFFSET)
#  define S32K3XX_CAN1_HR_TIME_STAMP43       (S32K3XX_CAN1_BASE + S32K3XX_CAN_HR_TIME_STAMP43_OFFSET)
#  define S32K3XX_CAN1_HR_TIME_STAMP44       (S32K3XX_CAN1_BASE + S32K3XX_CAN_HR_TIME_STAMP44_OFFSET)
#  define S32K3XX_CAN1_HR_TIME_STAMP45       (S32K3XX_CAN1_BASE + S32K3XX_CAN_HR_TIME_STAMP45_OFFSET)
#  define S32K3XX_CAN1_HR_TIME_STAMP46       (S32K3XX_CAN1_BASE + S32K3XX_CAN_HR_TIME_STAMP46_OFFSET)
#  define S32K3XX_CAN1_HR_TIME_STAMP47       (S32K3XX_CAN1_BASE + S32K3XX_CAN_HR_TIME_STAMP47_OFFSET)
#  define S32K3XX_CAN1_HR_TIME_STAMP48       (S32K3XX_CAN1_BASE + S32K3XX_CAN_HR_TIME_STAMP48_OFFSET)
#  define S32K3XX_CAN1_HR_TIME_STAMP49       (S32K3XX_CAN1_BASE + S32K3XX_CAN_HR_TIME_STAMP49_OFFSET)
#  define S32K3XX_CAN1_HR_TIME_STAMP50       (S32K3XX_CAN1_BASE + S32K3XX_CAN_HR_TIME_STAMP50_OFFSET)
#  define S32K3XX_CAN1_HR_TIME_STAMP51       (S32K3XX_CAN1_BASE + S32K3XX_CAN_HR_TIME_STAMP51_OFFSET)
#  define S32K3XX_CAN1_HR_TIME_STAMP52       (S32K3XX_CAN1_BASE + S32K3XX_CAN_HR_TIME_STAMP52_OFFSET)
#  define S32K3XX_CAN1_HR_TIME_STAMP53       (S32K3XX_CAN1_BASE + S32K3XX_CAN_HR_TIME_STAMP53_OFFSET)
#  define S32K3XX_CAN1_HR_TIME_STAMP54       (S32K3XX_CAN1_BASE + S32K3XX_CAN_HR_TIME_STAMP54_OFFSET)
#  define S32K3XX_CAN1_HR_TIME_STAMP55       (S32K3XX_CAN1_BASE + S32K3XX_CAN_HR_TIME_STAMP55_OFFSET)
#  define S32K3XX_CAN1_HR_TIME_STAMP56       (S32K3XX_CAN1_BASE + S32K3XX_CAN_HR_TIME_STAMP56_OFFSET)
#  define S32K3XX_CAN1_HR_TIME_STAMP57       (S32K3XX_CAN1_BASE + S32K3XX_CAN_HR_TIME_STAMP57_OFFSET)
#  define S32K3XX_CAN1_HR_TIME_STAMP58       (S32K3XX_CAN1_BASE + S32K3XX_CAN_HR_TIME_STAMP58_OFFSET)
#  define S32K3XX_CAN1_HR_TIME_STAMP59       (S32K3XX_CAN1_BASE + S32K3XX_CAN_HR_TIME_STAMP59_OFFSET)
#  define S32K3XX_CAN1_HR_TIME_STAMP60       (S32K3XX_CAN1_BASE + S32K3XX_CAN_HR_TIME_STAMP60_OFFSET)
#  define S32K3XX_CAN1_HR_TIME_STAMP61       (S32K3XX_CAN1_BASE + S32K3XX_CAN_HR_TIME_STAMP61_OFFSET)
#  define S32K3XX_CAN1_HR_TIME_STAMP62       (S32K3XX_CAN1_BASE + S32K3XX_CAN_HR_TIME_STAMP62_OFFSET)
#  define S32K3XX_CAN1_HR_TIME_STAMP63       (S32K3XX_CAN1_BASE + S32K3XX_CAN_HR_TIME_STAMP63_OFFSET)
#  define S32K3XX_CAN1_HR_TIME_STAMP64       (S32K3XX_CAN1_BASE + S32K3XX_CAN_HR_TIME_STAMP64_OFFSET)
#  define S32K3XX_CAN1_HR_TIME_STAMP65       (S32K3XX_CAN1_BASE + S32K3XX_CAN_HR_TIME_STAMP65_OFFSET)
#  define S32K3XX_CAN1_HR_TIME_STAMP66       (S32K3XX_CAN1_BASE + S32K3XX_CAN_HR_TIME_STAMP66_OFFSET)
#  define S32K3XX_CAN1_HR_TIME_STAMP67       (S32K3XX_CAN1_BASE + S32K3XX_CAN_HR_TIME_STAMP67_OFFSET)
#  define S32K3XX_CAN1_HR_TIME_STAMP68       (S32K3XX_CAN1_BASE + S32K3XX_CAN_HR_TIME_STAMP68_OFFSET)
#  define S32K3XX_CAN1_HR_TIME_STAMP69       (S32K3XX_CAN1_BASE + S32K3XX_CAN_HR_TIME_STAMP69_OFFSET)
#  define S32K3XX_CAN1_HR_TIME_STAMP70       (S32K3XX_CAN1_BASE + S32K3XX_CAN_HR_TIME_STAMP70_OFFSET)
#  define S32K3XX_CAN1_HR_TIME_STAMP71       (S32K3XX_CAN1_BASE + S32K3XX_CAN_HR_TIME_STAMP71_OFFSET)
#  define S32K3XX_CAN1_HR_TIME_STAMP72       (S32K3XX_CAN1_BASE + S32K3XX_CAN_HR_TIME_STAMP72_OFFSET)
#  define S32K3XX_CAN1_HR_TIME_STAMP73       (S32K3XX_CAN1_BASE + S32K3XX_CAN_HR_TIME_STAMP73_OFFSET)
#  define S32K3XX_CAN1_HR_TIME_STAMP74       (S32K3XX_CAN1_BASE + S32K3XX_CAN_HR_TIME_STAMP74_OFFSET)
#  define S32K3XX_CAN1_HR_TIME_STAMP75       (S32K3XX_CAN1_BASE + S32K3XX_CAN_HR_TIME_STAMP75_OFFSET)
#  define S32K3XX_CAN1_HR_TIME_STAMP76       (S32K3XX_CAN1_BASE + S32K3XX_CAN_HR_TIME_STAMP76_OFFSET)
#  define S32K3XX_CAN1_HR_TIME_STAMP77       (S32K3XX_CAN1_BASE + S32K3XX_CAN_HR_TIME_STAMP77_OFFSET)
#  define S32K3XX_CAN1_HR_TIME_STAMP78       (S32K3XX_CAN1_BASE + S32K3XX_CAN_HR_TIME_STAMP78_OFFSET)
#  define S32K3XX_CAN1_HR_TIME_STAMP79       (S32K3XX_CAN1_BASE + S32K3XX_CAN_HR_TIME_STAMP79_OFFSET)
#  define S32K3XX_CAN1_HR_TIME_STAMP80       (S32K3XX_CAN1_BASE + S32K3XX_CAN_HR_TIME_STAMP80_OFFSET)
#  define S32K3XX_CAN1_HR_TIME_STAMP81       (S32K3XX_CAN1_BASE + S32K3XX_CAN_HR_TIME_STAMP81_OFFSET)
#  define S32K3XX_CAN1_HR_TIME_STAMP82       (S32K3XX_CAN1_BASE + S32K3XX_CAN_HR_TIME_STAMP82_OFFSET)
#  define S32K3XX_CAN1_HR_TIME_STAMP83       (S32K3XX_CAN1_BASE + S32K3XX_CAN_HR_TIME_STAMP83_OFFSET)
#  define S32K3XX_CAN1_HR_TIME_STAMP84       (S32K3XX_CAN1_BASE + S32K3XX_CAN_HR_TIME_STAMP84_OFFSET)
#  define S32K3XX_CAN1_HR_TIME_STAMP85       (S32K3XX_CAN1_BASE + S32K3XX_CAN_HR_TIME_STAMP85_OFFSET)
#  define S32K3XX_CAN1_HR_TIME_STAMP86       (S32K3XX_CAN1_BASE + S32K3XX_CAN_HR_TIME_STAMP86_OFFSET)
#  define S32K3XX_CAN1_HR_TIME_STAMP87       (S32K3XX_CAN1_BASE + S32K3XX_CAN_HR_TIME_STAMP87_OFFSET)
#  define S32K3XX_CAN1_HR_TIME_STAMP88       (S32K3XX_CAN1_BASE + S32K3XX_CAN_HR_TIME_STAMP88_OFFSET)
#  define S32K3XX_CAN1_HR_TIME_STAMP89       (S32K3XX_CAN1_BASE + S32K3XX_CAN_HR_TIME_STAMP89_OFFSET)
#  define S32K3XX_CAN1_HR_TIME_STAMP90       (S32K3XX_CAN1_BASE + S32K3XX_CAN_HR_TIME_STAMP90_OFFSET)
#  define S32K3XX_CAN1_HR_TIME_STAMP91       (S32K3XX_CAN1_BASE + S32K3XX_CAN_HR_TIME_STAMP91_OFFSET)
#  define S32K3XX_CAN1_HR_TIME_STAMP92       (S32K3XX_CAN1_BASE + S32K3XX_CAN_HR_TIME_STAMP92_OFFSET)
#  define S32K3XX_CAN1_HR_TIME_STAMP93       (S32K3XX_CAN1_BASE + S32K3XX_CAN_HR_TIME_STAMP93_OFFSET)
#  define S32K3XX_CAN1_HR_TIME_STAMP94       (S32K3XX_CAN1_BASE + S32K3XX_CAN_HR_TIME_STAMP94_OFFSET)
#  define S32K3XX_CAN1_HR_TIME_STAMP95       (S32K3XX_CAN1_BASE + S32K3XX_CAN_HR_TIME_STAMP95_OFFSET)

#define S32K3XX_CAN1_ERFFEL(n)               (S32K3XX_CAN1_BASE + S32K3XX_CAN_ERFFEL_OFFSET(n))
#  define S32K3XX_CAN1_ERFFEL0               (S32K3XX_CAN1_BASE + S32K3XX_CAN_ERFFEL0_OFFSET)
#  define S32K3XX_CAN1_ERFFEL1               (S32K3XX_CAN1_BASE + S32K3XX_CAN_ERFFEL1_OFFSET)
#  define S32K3XX_CAN1_ERFFEL2               (S32K3XX_CAN1_BASE + S32K3XX_CAN_ERFFEL2_OFFSET)
#  define S32K3XX_CAN1_ERFFEL3               (S32K3XX_CAN1_BASE + S32K3XX_CAN_ERFFEL3_OFFSET)
#  define S32K3XX_CAN1_ERFFEL4               (S32K3XX_CAN1_BASE + S32K3XX_CAN_ERFFEL4_OFFSET)
#  define S32K3XX_CAN1_ERFFEL5               (S32K3XX_CAN1_BASE + S32K3XX_CAN_ERFFEL5_OFFSET)
#  define S32K3XX_CAN1_ERFFEL6               (S32K3XX_CAN1_BASE + S32K3XX_CAN_ERFFEL6_OFFSET)
#  define S32K3XX_CAN1_ERFFEL7               (S32K3XX_CAN1_BASE + S32K3XX_CAN_ERFFEL7_OFFSET)
#  define S32K3XX_CAN1_ERFFEL8               (S32K3XX_CAN1_BASE + S32K3XX_CAN_ERFFEL8_OFFSET)
#  define S32K3XX_CAN1_ERFFEL9               (S32K3XX_CAN1_BASE + S32K3XX_CAN_ERFFEL9_OFFSET)
#  define S32K3XX_CAN1_ERFFEL10              (S32K3XX_CAN1_BASE + S32K3XX_CAN_ERFFEL10_OFFSET)
#  define S32K3XX_CAN1_ERFFEL11              (S32K3XX_CAN1_BASE + S32K3XX_CAN_ERFFEL11_OFFSET)
#  define S32K3XX_CAN1_ERFFEL12              (S32K3XX_CAN1_BASE + S32K3XX_CAN_ERFFEL12_OFFSET)
#  define S32K3XX_CAN1_ERFFEL13              (S32K3XX_CAN1_BASE + S32K3XX_CAN_ERFFEL13_OFFSET)
#  define S32K3XX_CAN1_ERFFEL14              (S32K3XX_CAN1_BASE + S32K3XX_CAN_ERFFEL14_OFFSET)
#  define S32K3XX_CAN1_ERFFEL15              (S32K3XX_CAN1_BASE + S32K3XX_CAN_ERFFEL15_OFFSET)
#  define S32K3XX_CAN1_ERFFEL16              (S32K3XX_CAN1_BASE + S32K3XX_CAN_ERFFEL16_OFFSET)
#  define S32K3XX_CAN1_ERFFEL17              (S32K3XX_CAN1_BASE + S32K3XX_CAN_ERFFEL17_OFFSET)
#  define S32K3XX_CAN1_ERFFEL18              (S32K3XX_CAN1_BASE + S32K3XX_CAN_ERFFEL18_OFFSET)
#  define S32K3XX_CAN1_ERFFEL19              (S32K3XX_CAN1_BASE + S32K3XX_CAN_ERFFEL19_OFFSET)
#  define S32K3XX_CAN1_ERFFEL20              (S32K3XX_CAN1_BASE + S32K3XX_CAN_ERFFEL20_OFFSET)
#  define S32K3XX_CAN1_ERFFEL21              (S32K3XX_CAN1_BASE + S32K3XX_CAN_ERFFEL21_OFFSET)
#  define S32K3XX_CAN1_ERFFEL22              (S32K3XX_CAN1_BASE + S32K3XX_CAN_ERFFEL22_OFFSET)
#  define S32K3XX_CAN1_ERFFEL23              (S32K3XX_CAN1_BASE + S32K3XX_CAN_ERFFEL23_OFFSET)
#  define S32K3XX_CAN1_ERFFEL24              (S32K3XX_CAN1_BASE + S32K3XX_CAN_ERFFEL24_OFFSET)
#  define S32K3XX_CAN1_ERFFEL25              (S32K3XX_CAN1_BASE + S32K3XX_CAN_ERFFEL25_OFFSET)
#  define S32K3XX_CAN1_ERFFEL26              (S32K3XX_CAN1_BASE + S32K3XX_CAN_ERFFEL26_OFFSET)
#  define S32K3XX_CAN1_ERFFEL27              (S32K3XX_CAN1_BASE + S32K3XX_CAN_ERFFEL27_OFFSET)
#  define S32K3XX_CAN1_ERFFEL28              (S32K3XX_CAN1_BASE + S32K3XX_CAN_ERFFEL28_OFFSET)
#  define S32K3XX_CAN1_ERFFEL29              (S32K3XX_CAN1_BASE + S32K3XX_CAN_ERFFEL29_OFFSET)
#  define S32K3XX_CAN1_ERFFEL30              (S32K3XX_CAN1_BASE + S32K3XX_CAN_ERFFEL30_OFFSET)
#  define S32K3XX_CAN1_ERFFEL31              (S32K3XX_CAN1_BASE + S32K3XX_CAN_ERFFEL31_OFFSET)
#  define S32K3XX_CAN1_ERFFEL32              (S32K3XX_CAN1_BASE + S32K3XX_CAN_ERFFEL32_OFFSET)
#  define S32K3XX_CAN1_ERFFEL33              (S32K3XX_CAN1_BASE + S32K3XX_CAN_ERFFEL33_OFFSET)
#  define S32K3XX_CAN1_ERFFEL34              (S32K3XX_CAN1_BASE + S32K3XX_CAN_ERFFEL34_OFFSET)
#  define S32K3XX_CAN1_ERFFEL35              (S32K3XX_CAN1_BASE + S32K3XX_CAN_ERFFEL35_OFFSET)
#  define S32K3XX_CAN1_ERFFEL36              (S32K3XX_CAN1_BASE + S32K3XX_CAN_ERFFEL36_OFFSET)
#  define S32K3XX_CAN1_ERFFEL37              (S32K3XX_CAN1_BASE + S32K3XX_CAN_ERFFEL37_OFFSET)
#  define S32K3XX_CAN1_ERFFEL38              (S32K3XX_CAN1_BASE + S32K3XX_CAN_ERFFEL38_OFFSET)
#  define S32K3XX_CAN1_ERFFEL39              (S32K3XX_CAN1_BASE + S32K3XX_CAN_ERFFEL39_OFFSET)
#  define S32K3XX_CAN1_ERFFEL40              (S32K3XX_CAN1_BASE + S32K3XX_CAN_ERFFEL40_OFFSET)
#  define S32K3XX_CAN1_ERFFEL41              (S32K3XX_CAN1_BASE + S32K3XX_CAN_ERFFEL41_OFFSET)
#  define S32K3XX_CAN1_ERFFEL42              (S32K3XX_CAN1_BASE + S32K3XX_CAN_ERFFEL42_OFFSET)
#  define S32K3XX_CAN1_ERFFEL43              (S32K3XX_CAN1_BASE + S32K3XX_CAN_ERFFEL43_OFFSET)
#  define S32K3XX_CAN1_ERFFEL44              (S32K3XX_CAN1_BASE + S32K3XX_CAN_ERFFEL44_OFFSET)
#  define S32K3XX_CAN1_ERFFEL45              (S32K3XX_CAN1_BASE + S32K3XX_CAN_ERFFEL45_OFFSET)
#  define S32K3XX_CAN1_ERFFEL46              (S32K3XX_CAN1_BASE + S32K3XX_CAN_ERFFEL46_OFFSET)
#  define S32K3XX_CAN1_ERFFEL47              (S32K3XX_CAN1_BASE + S32K3XX_CAN_ERFFEL47_OFFSET)
#  define S32K3XX_CAN1_ERFFEL48              (S32K3XX_CAN1_BASE + S32K3XX_CAN_ERFFEL48_OFFSET)
#  define S32K3XX_CAN1_ERFFEL49              (S32K3XX_CAN1_BASE + S32K3XX_CAN_ERFFEL49_OFFSET)
#  define S32K3XX_CAN1_ERFFEL50              (S32K3XX_CAN1_BASE + S32K3XX_CAN_ERFFEL50_OFFSET)
#  define S32K3XX_CAN1_ERFFEL51              (S32K3XX_CAN1_BASE + S32K3XX_CAN_ERFFEL51_OFFSET)
#  define S32K3XX_CAN1_ERFFEL52              (S32K3XX_CAN1_BASE + S32K3XX_CAN_ERFFEL52_OFFSET)
#  define S32K3XX_CAN1_ERFFEL53              (S32K3XX_CAN1_BASE + S32K3XX_CAN_ERFFEL53_OFFSET)
#  define S32K3XX_CAN1_ERFFEL54              (S32K3XX_CAN1_BASE + S32K3XX_CAN_ERFFEL54_OFFSET)
#  define S32K3XX_CAN1_ERFFEL55              (S32K3XX_CAN1_BASE + S32K3XX_CAN_ERFFEL55_OFFSET)
#  define S32K3XX_CAN1_ERFFEL56              (S32K3XX_CAN1_BASE + S32K3XX_CAN_ERFFEL56_OFFSET)
#  define S32K3XX_CAN1_ERFFEL57              (S32K3XX_CAN1_BASE + S32K3XX_CAN_ERFFEL57_OFFSET)
#  define S32K3XX_CAN1_ERFFEL58              (S32K3XX_CAN1_BASE + S32K3XX_CAN_ERFFEL58_OFFSET)
#  define S32K3XX_CAN1_ERFFEL59              (S32K3XX_CAN1_BASE + S32K3XX_CAN_ERFFEL59_OFFSET)
#  define S32K3XX_CAN1_ERFFEL60              (S32K3XX_CAN1_BASE + S32K3XX_CAN_ERFFEL60_OFFSET)
#  define S32K3XX_CAN1_ERFFEL61              (S32K3XX_CAN1_BASE + S32K3XX_CAN_ERFFEL61_OFFSET)
#  define S32K3XX_CAN1_ERFFEL62              (S32K3XX_CAN1_BASE + S32K3XX_CAN_ERFFEL62_OFFSET)
#  define S32K3XX_CAN1_ERFFEL63              (S32K3XX_CAN1_BASE + S32K3XX_CAN_ERFFEL63_OFFSET)
#  define S32K3XX_CAN1_ERFFEL64              (S32K3XX_CAN1_BASE + S32K3XX_CAN_ERFFEL64_OFFSET)
#  define S32K3XX_CAN1_ERFFEL65              (S32K3XX_CAN1_BASE + S32K3XX_CAN_ERFFEL65_OFFSET)
#  define S32K3XX_CAN1_ERFFEL66              (S32K3XX_CAN1_BASE + S32K3XX_CAN_ERFFEL66_OFFSET)
#  define S32K3XX_CAN1_ERFFEL67              (S32K3XX_CAN1_BASE + S32K3XX_CAN_ERFFEL67_OFFSET)
#  define S32K3XX_CAN1_ERFFEL68              (S32K3XX_CAN1_BASE + S32K3XX_CAN_ERFFEL68_OFFSET)
#  define S32K3XX_CAN1_ERFFEL69              (S32K3XX_CAN1_BASE + S32K3XX_CAN_ERFFEL69_OFFSET)
#  define S32K3XX_CAN1_ERFFEL70              (S32K3XX_CAN1_BASE + S32K3XX_CAN_ERFFEL70_OFFSET)
#  define S32K3XX_CAN1_ERFFEL71              (S32K3XX_CAN1_BASE + S32K3XX_CAN_ERFFEL71_OFFSET)
#  define S32K3XX_CAN1_ERFFEL72              (S32K3XX_CAN1_BASE + S32K3XX_CAN_ERFFEL72_OFFSET)
#  define S32K3XX_CAN1_ERFFEL73              (S32K3XX_CAN1_BASE + S32K3XX_CAN_ERFFEL73_OFFSET)
#  define S32K3XX_CAN1_ERFFEL74              (S32K3XX_CAN1_BASE + S32K3XX_CAN_ERFFEL74_OFFSET)
#  define S32K3XX_CAN1_ERFFEL75              (S32K3XX_CAN1_BASE + S32K3XX_CAN_ERFFEL75_OFFSET)
#  define S32K3XX_CAN1_ERFFEL76              (S32K3XX_CAN1_BASE + S32K3XX_CAN_ERFFEL76_OFFSET)
#  define S32K3XX_CAN1_ERFFEL77              (S32K3XX_CAN1_BASE + S32K3XX_CAN_ERFFEL77_OFFSET)
#  define S32K3XX_CAN1_ERFFEL78              (S32K3XX_CAN1_BASE + S32K3XX_CAN_ERFFEL78_OFFSET)
#  define S32K3XX_CAN1_ERFFEL79              (S32K3XX_CAN1_BASE + S32K3XX_CAN_ERFFEL79_OFFSET)
#  define S32K3XX_CAN1_ERFFEL80              (S32K3XX_CAN1_BASE + S32K3XX_CAN_ERFFEL80_OFFSET)
#  define S32K3XX_CAN1_ERFFEL81              (S32K3XX_CAN1_BASE + S32K3XX_CAN_ERFFEL81_OFFSET)
#  define S32K3XX_CAN1_ERFFEL82              (S32K3XX_CAN1_BASE + S32K3XX_CAN_ERFFEL82_OFFSET)
#  define S32K3XX_CAN1_ERFFEL83              (S32K3XX_CAN1_BASE + S32K3XX_CAN_ERFFEL83_OFFSET)
#  define S32K3XX_CAN1_ERFFEL84              (S32K3XX_CAN1_BASE + S32K3XX_CAN_ERFFEL84_OFFSET)
#  define S32K3XX_CAN1_ERFFEL85              (S32K3XX_CAN1_BASE + S32K3XX_CAN_ERFFEL85_OFFSET)
#  define S32K3XX_CAN1_ERFFEL86              (S32K3XX_CAN1_BASE + S32K3XX_CAN_ERFFEL86_OFFSET)
#  define S32K3XX_CAN1_ERFFEL87              (S32K3XX_CAN1_BASE + S32K3XX_CAN_ERFFEL87_OFFSET)
#  define S32K3XX_CAN1_ERFFEL88              (S32K3XX_CAN1_BASE + S32K3XX_CAN_ERFFEL88_OFFSET)
#  define S32K3XX_CAN1_ERFFEL89              (S32K3XX_CAN1_BASE + S32K3XX_CAN_ERFFEL89_OFFSET)
#  define S32K3XX_CAN1_ERFFEL90              (S32K3XX_CAN1_BASE + S32K3XX_CAN_ERFFEL90_OFFSET)
#  define S32K3XX_CAN1_ERFFEL91              (S32K3XX_CAN1_BASE + S32K3XX_CAN_ERFFEL91_OFFSET)
#  define S32K3XX_CAN1_ERFFEL92              (S32K3XX_CAN1_BASE + S32K3XX_CAN_ERFFEL92_OFFSET)
#  define S32K3XX_CAN1_ERFFEL93              (S32K3XX_CAN1_BASE + S32K3XX_CAN_ERFFEL93_OFFSET)
#  define S32K3XX_CAN1_ERFFEL94              (S32K3XX_CAN1_BASE + S32K3XX_CAN_ERFFEL94_OFFSET)
#  define S32K3XX_CAN1_ERFFEL95              (S32K3XX_CAN1_BASE + S32K3XX_CAN_ERFFEL95_OFFSET)
#  define S32K3XX_CAN1_ERFFEL96              (S32K3XX_CAN1_BASE + S32K3XX_CAN_ERFFEL96_OFFSET)
#  define S32K3XX_CAN1_ERFFEL97              (S32K3XX_CAN1_BASE + S32K3XX_CAN_ERFFEL97_OFFSET)
#  define S32K3XX_CAN1_ERFFEL98              (S32K3XX_CAN1_BASE + S32K3XX_CAN_ERFFEL98_OFFSET)
#  define S32K3XX_CAN1_ERFFEL99              (S32K3XX_CAN1_BASE + S32K3XX_CAN_ERFFEL99_OFFSET)
#  define S32K3XX_CAN1_ERFFEL100             (S32K3XX_CAN1_BASE + S32K3XX_CAN_ERFFEL100_OFFSET)
#  define S32K3XX_CAN1_ERFFEL101             (S32K3XX_CAN1_BASE + S32K3XX_CAN_ERFFEL101_OFFSET)
#  define S32K3XX_CAN1_ERFFEL102             (S32K3XX_CAN1_BASE + S32K3XX_CAN_ERFFEL102_OFFSET)
#  define S32K3XX_CAN1_ERFFEL103             (S32K3XX_CAN1_BASE + S32K3XX_CAN_ERFFEL103_OFFSET)
#  define S32K3XX_CAN1_ERFFEL104             (S32K3XX_CAN1_BASE + S32K3XX_CAN_ERFFEL104_OFFSET)
#  define S32K3XX_CAN1_ERFFEL105             (S32K3XX_CAN1_BASE + S32K3XX_CAN_ERFFEL105_OFFSET)
#  define S32K3XX_CAN1_ERFFEL106             (S32K3XX_CAN1_BASE + S32K3XX_CAN_ERFFEL106_OFFSET)
#  define S32K3XX_CAN1_ERFFEL107             (S32K3XX_CAN1_BASE + S32K3XX_CAN_ERFFEL107_OFFSET)
#  define S32K3XX_CAN1_ERFFEL108             (S32K3XX_CAN1_BASE + S32K3XX_CAN_ERFFEL108_OFFSET)
#  define S32K3XX_CAN1_ERFFEL109             (S32K3XX_CAN1_BASE + S32K3XX_CAN_ERFFEL109_OFFSET)
#  define S32K3XX_CAN1_ERFFEL110             (S32K3XX_CAN1_BASE + S32K3XX_CAN_ERFFEL110_OFFSET)
#  define S32K3XX_CAN1_ERFFEL111             (S32K3XX_CAN1_BASE + S32K3XX_CAN_ERFFEL111_OFFSET)
#  define S32K3XX_CAN1_ERFFEL112             (S32K3XX_CAN1_BASE + S32K3XX_CAN_ERFFEL112_OFFSET)
#  define S32K3XX_CAN1_ERFFEL113             (S32K3XX_CAN1_BASE + S32K3XX_CAN_ERFFEL113_OFFSET)
#  define S32K3XX_CAN1_ERFFEL114             (S32K3XX_CAN1_BASE + S32K3XX_CAN_ERFFEL114_OFFSET)
#  define S32K3XX_CAN1_ERFFEL115             (S32K3XX_CAN1_BASE + S32K3XX_CAN_ERFFEL115_OFFSET)
#  define S32K3XX_CAN1_ERFFEL116             (S32K3XX_CAN1_BASE + S32K3XX_CAN_ERFFEL116_OFFSET)
#  define S32K3XX_CAN1_ERFFEL117             (S32K3XX_CAN1_BASE + S32K3XX_CAN_ERFFEL117_OFFSET)
#  define S32K3XX_CAN1_ERFFEL118             (S32K3XX_CAN1_BASE + S32K3XX_CAN_ERFFEL118_OFFSET)
#  define S32K3XX_CAN1_ERFFEL119             (S32K3XX_CAN1_BASE + S32K3XX_CAN_ERFFEL119_OFFSET)
#  define S32K3XX_CAN1_ERFFEL120             (S32K3XX_CAN1_BASE + S32K3XX_CAN_ERFFEL120_OFFSET)
#  define S32K3XX_CAN1_ERFFEL121             (S32K3XX_CAN1_BASE + S32K3XX_CAN_ERFFEL121_OFFSET)
#  define S32K3XX_CAN1_ERFFEL122             (S32K3XX_CAN1_BASE + S32K3XX_CAN_ERFFEL122_OFFSET)
#  define S32K3XX_CAN1_ERFFEL123             (S32K3XX_CAN1_BASE + S32K3XX_CAN_ERFFEL123_OFFSET)
#  define S32K3XX_CAN1_ERFFEL124             (S32K3XX_CAN1_BASE + S32K3XX_CAN_ERFFEL124_OFFSET)
#  define S32K3XX_CAN1_ERFFEL125             (S32K3XX_CAN1_BASE + S32K3XX_CAN_ERFFEL125_OFFSET)
#  define S32K3XX_CAN1_ERFFEL126             (S32K3XX_CAN1_BASE + S32K3XX_CAN_ERFFEL126_OFFSET)
#  define S32K3XX_CAN1_ERFFEL127             (S32K3XX_CAN1_BASE + S32K3XX_CAN_ERFFEL127_OFFSET)

