apache/nuttx/arch/arm/src/s32k3xx/hardware/s32k3xx_flexcan.h
#define S32K3XX_CAN3_MCR                     (S32K3XX_CAN3_BASE + S32K3XX_CAN_MCR_OFFSET)
#define S32K3XX_CAN3_CTRL1                   (S32K3XX_CAN3_BASE + S32K3XX_CAN_CTRL1_OFFSET)
#define S32K3XX_CAN3_TIMER                   (S32K3XX_CAN3_BASE + S32K3XX_CAN_TIMER_OFFSET)
#define S32K3XX_CAN3_RXMGMASK                (S32K3XX_CAN3_BASE + S32K3XX_CAN_RXMGMASK_OFFSET)
#define S32K3XX_CAN3_RX14MASK                (S32K3XX_CAN3_BASE + S32K3XX_CAN_RX14MASK_OFFSET)
#define S32K3XX_CAN3_RX15MASK                (S32K3XX_CAN3_BASE + S32K3XX_CAN_RX15MASK_OFFSET)
#define S32K3XX_CAN3_ECR                     (S32K3XX_CAN3_BASE + S32K3XX_CAN_ECR_OFFSET)
#define S32K3XX_CAN3_ESR1                    (S32K3XX_CAN3_BASE + S32K3XX_CAN_ESR1_OFFSET)
#define S32K3XX_CAN3_IMASK2                  (S32K3XX_CAN3_BASE + S32K3XX_CAN_IMASK2_OFFSET)
#define S32K3XX_CAN3_IMASK1                  (S32K3XX_CAN3_BASE + S32K3XX_CAN_IMASK1_OFFSET)
#define S32K3XX_CAN3_IFLAG2                  (S32K3XX_CAN3_BASE + S32K3XX_CAN_IFLAG2_OFFSET)
#define S32K3XX_CAN3_IFLAG1                  (S32K3XX_CAN3_BASE + S32K3XX_CAN_IFLAG1_OFFSET)
#define S32K3XX_CAN3_CTRL2                   (S32K3XX_CAN3_BASE + S32K3XX_CAN_CTRL2_OFFSET)
#define S32K3XX_CAN3_ESR2                    (S32K3XX_CAN3_BASE + S32K3XX_CAN_ESR2_OFFSET)
#define S32K3XX_CAN3_CRCR                    (S32K3XX_CAN3_BASE + S32K3XX_CAN_CRCR_OFFSET)
#define S32K3XX_CAN3_RXFGMASK                (S32K3XX_CAN3_BASE + S32K3XX_CAN_RXFGMASK_OFFSET)
#define S32K3XX_CAN3_RXFIR                   (S32K3XX_CAN3_BASE + S32K3XX_CAN_RXFIR_OFFSET)
#define S32K3XX_CAN3_CBT                     (S32K3XX_CAN3_BASE + S32K3XX_CAN_CBT_OFFSET)
#define S32K3XX_CAN3_IMASK3                  (S32K3XX_CAN3_BASE + S32K3XX_CAN_IMASK3_OFFSET)
#define S32K3XX_CAN3_IFLAG3                  (S32K3XX_CAN3_BASE + S32K3XX_CAN_IFLAG3_OFFSET)

#define S32K3XX_CAN3_RXIMR(n)                (S32K3XX_CAN3_BASE + S32K3XX_CAN_RXIMR_OFFSET(n))
#  define S32K3XX_CAN3_RXIMR0                (S32K3XX_CAN3_BASE + S32K3XX_CAN_RXIMR0_OFFSET)
#  define S32K3XX_CAN3_RXIMR1                (S32K3XX_CAN3_BASE + S32K3XX_CAN_RXIMR1_OFFSET)
#  define S32K3XX_CAN3_RXIMR2                (S32K3XX_CAN3_BASE + S32K3XX_CAN_RXIMR2_OFFSET)
#  define S32K3XX_CAN3_RXIMR3                (S32K3XX_CAN3_BASE + S32K3XX_CAN_RXIMR3_OFFSET)
#  define S32K3XX_CAN3_RXIMR4                (S32K3XX_CAN3_BASE + S32K3XX_CAN_RXIMR4_OFFSET)
#  define S32K3XX_CAN3_RXIMR5                (S32K3XX_CAN3_BASE + S32K3XX_CAN_RXIMR5_OFFSET)
#  define S32K3XX_CAN3_RXIMR6                (S32K3XX_CAN3_BASE + S32K3XX_CAN_RXIMR6_OFFSET)
#  define S32K3XX_CAN3_RXIMR7                (S32K3XX_CAN3_BASE + S32K3XX_CAN_RXIMR7_OFFSET)
#  define S32K3XX_CAN3_RXIMR8                (S32K3XX_CAN3_BASE + S32K3XX_CAN_RXIMR8_OFFSET)
#  define S32K3XX_CAN3_RXIMR9                (S32K3XX_CAN3_BASE + S32K3XX_CAN_RXIMR9_OFFSET)
#  define S32K3XX_CAN3_RXIMR10               (S32K3XX_CAN3_BASE + S32K3XX_CAN_RXIMR10_OFFSET)
#  define S32K3XX_CAN3_RXIMR11               (S32K3XX_CAN3_BASE + S32K3XX_CAN_RXIMR11_OFFSET)
#  define S32K3XX_CAN3_RXIMR12               (S32K3XX_CAN3_BASE + S32K3XX_CAN_RXIMR12_OFFSET)
#  define S32K3XX_CAN3_RXIMR13               (S32K3XX_CAN3_BASE + S32K3XX_CAN_RXIMR13_OFFSET)
#  define S32K3XX_CAN3_RXIMR14               (S32K3XX_CAN3_BASE + S32K3XX_CAN_RXIMR14_OFFSET)
#  define S32K3XX_CAN3_RXIMR15               (S32K3XX_CAN3_BASE + S32K3XX_CAN_RXIMR15_OFFSET)
#  define S32K3XX_CAN3_RXIMR16               (S32K3XX_CAN3_BASE + S32K3XX_CAN_RXIMR16_OFFSET)
#  define S32K3XX_CAN3_RXIMR17               (S32K3XX_CAN3_BASE + S32K3XX_CAN_RXIMR17_OFFSET)
#  define S32K3XX_CAN3_RXIMR18               (S32K3XX_CAN3_BASE + S32K3XX_CAN_RXIMR18_OFFSET)
#  define S32K3XX_CAN3_RXIMR19               (S32K3XX_CAN3_BASE + S32K3XX_CAN_RXIMR19_OFFSET)
#  define S32K3XX_CAN3_RXIMR20               (S32K3XX_CAN3_BASE + S32K3XX_CAN_RXIMR20_OFFSET)
#  define S32K3XX_CAN3_RXIMR21               (S32K3XX_CAN3_BASE + S32K3XX_CAN_RXIMR21_OFFSET)
#  define S32K3XX_CAN3_RXIMR22               (S32K3XX_CAN3_BASE + S32K3XX_CAN_RXIMR22_OFFSET)
#  define S32K3XX_CAN3_RXIMR23               (S32K3XX_CAN3_BASE + S32K3XX_CAN_RXIMR23_OFFSET)
#  define S32K3XX_CAN3_RXIMR24               (S32K3XX_CAN3_BASE + S32K3XX_CAN_RXIMR24_OFFSET)
#  define S32K3XX_CAN3_RXIMR25               (S32K3XX_CAN3_BASE + S32K3XX_CAN_RXIMR25_OFFSET)
#  define S32K3XX_CAN3_RXIMR26               (S32K3XX_CAN3_BASE + S32K3XX_CAN_RXIMR26_OFFSET)
#  define S32K3XX_CAN3_RXIMR27               (S32K3XX_CAN3_BASE + S32K3XX_CAN_RXIMR27_OFFSET)
#  define S32K3XX_CAN3_RXIMR28               (S32K3XX_CAN3_BASE + S32K3XX_CAN_RXIMR28_OFFSET)
#  define S32K3XX_CAN3_RXIMR29               (S32K3XX_CAN3_BASE + S32K3XX_CAN_RXIMR29_OFFSET)
#  define S32K3XX_CAN3_RXIMR30               (S32K3XX_CAN3_BASE + S32K3XX_CAN_RXIMR30_OFFSET)
#  define S32K3XX_CAN3_RXIMR31               (S32K3XX_CAN3_BASE + S32K3XX_CAN_RXIMR31_OFFSET)
#  define S32K3XX_CAN3_RXIMR32               (S32K3XX_CAN3_BASE + S32K3XX_CAN_RXIMR32_OFFSET)
#  define S32K3XX_CAN3_RXIMR33               (S32K3XX_CAN3_BASE + S32K3XX_CAN_RXIMR33_OFFSET)
#  define S32K3XX_CAN3_RXIMR34               (S32K3XX_CAN3_BASE + S32K3XX_CAN_RXIMR34_OFFSET)
#  define S32K3XX_CAN3_RXIMR35               (S32K3XX_CAN3_BASE + S32K3XX_CAN_RXIMR35_OFFSET)
#  define S32K3XX_CAN3_RXIMR36               (S32K3XX_CAN3_BASE + S32K3XX_CAN_RXIMR36_OFFSET)
#  define S32K3XX_CAN3_RXIMR37               (S32K3XX_CAN3_BASE + S32K3XX_CAN_RXIMR37_OFFSET)
#  define S32K3XX_CAN3_RXIMR38               (S32K3XX_CAN3_BASE + S32K3XX_CAN_RXIMR38_OFFSET)
#  define S32K3XX_CAN3_RXIMR39               (S32K3XX_CAN3_BASE + S32K3XX_CAN_RXIMR39_OFFSET)
#  define S32K3XX_CAN3_RXIMR40               (S32K3XX_CAN3_BASE + S32K3XX_CAN_RXIMR40_OFFSET)
#  define S32K3XX_CAN3_RXIMR41               (S32K3XX_CAN3_BASE + S32K3XX_CAN_RXIMR41_OFFSET)
#  define S32K3XX_CAN3_RXIMR42               (S32K3XX_CAN3_BASE + S32K3XX_CAN_RXIMR42_OFFSET)
#  define S32K3XX_CAN3_RXIMR43               (S32K3XX_CAN3_BASE + S32K3XX_CAN_RXIMR43_OFFSET)
#  define S32K3XX_CAN3_RXIMR44               (S32K3XX_CAN3_BASE + S32K3XX_CAN_RXIMR44_OFFSET)
#  define S32K3XX_CAN3_RXIMR45               (S32K3XX_CAN3_BASE + S32K3XX_CAN_RXIMR45_OFFSET)
#  define S32K3XX_CAN3_RXIMR46               (S32K3XX_CAN3_BASE + S32K3XX_CAN_RXIMR46_OFFSET)
#  define S32K3XX_CAN3_RXIMR47               (S32K3XX_CAN3_BASE + S32K3XX_CAN_RXIMR47_OFFSET)
#  define S32K3XX_CAN3_RXIMR48               (S32K3XX_CAN3_BASE + S32K3XX_CAN_RXIMR48_OFFSET)
#  define S32K3XX_CAN3_RXIMR49               (S32K3XX_CAN3_BASE + S32K3XX_CAN_RXIMR49_OFFSET)
#  define S32K3XX_CAN3_RXIMR50               (S32K3XX_CAN3_BASE + S32K3XX_CAN_RXIMR50_OFFSET)
#  define S32K3XX_CAN3_RXIMR51               (S32K3XX_CAN3_BASE + S32K3XX_CAN_RXIMR51_OFFSET)
#  define S32K3XX_CAN3_RXIMR52               (S32K3XX_CAN3_BASE + S32K3XX_CAN_RXIMR52_OFFSET)
#  define S32K3XX_CAN3_RXIMR53               (S32K3XX_CAN3_BASE + S32K3XX_CAN_RXIMR53_OFFSET)
#  define S32K3XX_CAN3_RXIMR54               (S32K3XX_CAN3_BASE + S32K3XX_CAN_RXIMR54_OFFSET)
#  define S32K3XX_CAN3_RXIMR55               (S32K3XX_CAN3_BASE + S32K3XX_CAN_RXIMR55_OFFSET)
#  define S32K3XX_CAN3_RXIMR56               (S32K3XX_CAN3_BASE + S32K3XX_CAN_RXIMR56_OFFSET)
#  define S32K3XX_CAN3_RXIMR57               (S32K3XX_CAN3_BASE + S32K3XX_CAN_RXIMR57_OFFSET)
#  define S32K3XX_CAN3_RXIMR58               (S32K3XX_CAN3_BASE + S32K3XX_CAN_RXIMR58_OFFSET)
#  define S32K3XX_CAN3_RXIMR59               (S32K3XX_CAN3_BASE + S32K3XX_CAN_RXIMR59_OFFSET)
#  define S32K3XX_CAN3_RXIMR60               (S32K3XX_CAN3_BASE + S32K3XX_CAN_RXIMR60_OFFSET)
#  define S32K3XX_CAN3_RXIMR61               (S32K3XX_CAN3_BASE + S32K3XX_CAN_RXIMR61_OFFSET)
#  define S32K3XX_CAN3_RXIMR62               (S32K3XX_CAN3_BASE + S32K3XX_CAN_RXIMR62_OFFSET)
#  define S32K3XX_CAN3_RXIMR63               (S32K3XX_CAN3_BASE + S32K3XX_CAN_RXIMR63_OFFSET)
#  define S32K3XX_CAN3_RXIMR64               (S32K3XX_CAN3_BASE + S32K3XX_CAN_RXIMR64_OFFSET)
#  define S32K3XX_CAN3_RXIMR65               (S32K3XX_CAN3_BASE + S32K3XX_CAN_RXIMR65_OFFSET)
#  define S32K3XX_CAN3_RXIMR66               (S32K3XX_CAN3_BASE + S32K3XX_CAN_RXIMR66_OFFSET)
#  define S32K3XX_CAN3_RXIMR67               (S32K3XX_CAN3_BASE + S32K3XX_CAN_RXIMR67_OFFSET)
#  define S32K3XX_CAN3_RXIMR68               (S32K3XX_CAN3_BASE + S32K3XX_CAN_RXIMR68_OFFSET)
#  define S32K3XX_CAN3_RXIMR69               (S32K3XX_CAN3_BASE + S32K3XX_CAN_RXIMR69_OFFSET)
#  define S32K3XX_CAN3_RXIMR70               (S32K3XX_CAN3_BASE + S32K3XX_CAN_RXIMR70_OFFSET)
#  define S32K3XX_CAN3_RXIMR71               (S32K3XX_CAN3_BASE + S32K3XX_CAN_RXIMR71_OFFSET)
#  define S32K3XX_CAN3_RXIMR72               (S32K3XX_CAN3_BASE + S32K3XX_CAN_RXIMR72_OFFSET)
#  define S32K3XX_CAN3_RXIMR73               (S32K3XX_CAN3_BASE + S32K3XX_CAN_RXIMR73_OFFSET)
#  define S32K3XX_CAN3_RXIMR74               (S32K3XX_CAN3_BASE + S32K3XX_CAN_RXIMR74_OFFSET)
#  define S32K3XX_CAN3_RXIMR75               (S32K3XX_CAN3_BASE + S32K3XX_CAN_RXIMR75_OFFSET)
#  define S32K3XX_CAN3_RXIMR76               (S32K3XX_CAN3_BASE + S32K3XX_CAN_RXIMR76_OFFSET)
#  define S32K3XX_CAN3_RXIMR77               (S32K3XX_CAN3_BASE + S32K3XX_CAN_RXIMR77_OFFSET)
#  define S32K3XX_CAN3_RXIMR78               (S32K3XX_CAN3_BASE + S32K3XX_CAN_RXIMR78_OFFSET)
#  define S32K3XX_CAN3_RXIMR79               (S32K3XX_CAN3_BASE + S32K3XX_CAN_RXIMR79_OFFSET)
#  define S32K3XX_CAN3_RXIMR80               (S32K3XX_CAN3_BASE + S32K3XX_CAN_RXIMR80_OFFSET)
#  define S32K3XX_CAN3_RXIMR81               (S32K3XX_CAN3_BASE + S32K3XX_CAN_RXIMR81_OFFSET)
#  define S32K3XX_CAN3_RXIMR82               (S32K3XX_CAN3_BASE + S32K3XX_CAN_RXIMR82_OFFSET)
#  define S32K3XX_CAN3_RXIMR83               (S32K3XX_CAN3_BASE + S32K3XX_CAN_RXIMR83_OFFSET)
#  define S32K3XX_CAN3_RXIMR84               (S32K3XX_CAN3_BASE + S32K3XX_CAN_RXIMR84_OFFSET)
#  define S32K3XX_CAN3_RXIMR85               (S32K3XX_CAN3_BASE + S32K3XX_CAN_RXIMR85_OFFSET)
#  define S32K3XX_CAN3_RXIMR86               (S32K3XX_CAN3_BASE + S32K3XX_CAN_RXIMR86_OFFSET)
#  define S32K3XX_CAN3_RXIMR87               (S32K3XX_CAN3_BASE + S32K3XX_CAN_RXIMR87_OFFSET)
#  define S32K3XX_CAN3_RXIMR88               (S32K3XX_CAN3_BASE + S32K3XX_CAN_RXIMR88_OFFSET)
#  define S32K3XX_CAN3_RXIMR89               (S32K3XX_CAN3_BASE + S32K3XX_CAN_RXIMR89_OFFSET)
#  define S32K3XX_CAN3_RXIMR90               (S32K3XX_CAN3_BASE + S32K3XX_CAN_RXIMR90_OFFSET)
#  define S32K3XX_CAN3_RXIMR91               (S32K3XX_CAN3_BASE + S32K3XX_CAN_RXIMR91_OFFSET)
#  define S32K3XX_CAN3_RXIMR92               (S32K3XX_CAN3_BASE + S32K3XX_CAN_RXIMR92_OFFSET)
#  define S32K3XX_CAN3_RXIMR93               (S32K3XX_CAN3_BASE + S32K3XX_CAN_RXIMR93_OFFSET)
#  define S32K3XX_CAN3_RXIMR94               (S32K3XX_CAN3_BASE + S32K3XX_CAN_RXIMR94_OFFSET)
#  define S32K3XX_CAN3_RXIMR95               (S32K3XX_CAN3_BASE + S32K3XX_CAN_RXIMR95_OFFSET)

#define S32K3XX_CAN3_MECR                    (S32K3XX_CAN3_BASE + S32K3XX_CAN_MECR_OFFSET)
#define S32K3XX_CAN3_ERRIAR                  (S32K3XX_CAN3_BASE + S32K3XX_CAN_ERRIAR_OFFSET)
#define S32K3XX_CAN3_ERRIDPR                 (S32K3XX_CAN3_BASE + S32K3XX_CAN_ERRIDPR_OFFSET)
#define S32K3XX_CAN3_ERRIPPR                 (S32K3XX_CAN3_BASE + S32K3XX_CAN_ERRIPPR_OFFSET)
#define S32K3XX_CAN3_RERRAR                  (S32K3XX_CAN3_BASE + S32K3XX_CAN_RERRAR_OFFSET)
#define S32K3XX_CAN3_RERRDR                  (S32K3XX_CAN3_BASE + S32K3XX_CAN_RERRDR_OFFSET)
#define S32K3XX_CAN3_RERRSYNR                (S32K3XX_CAN3_BASE + S32K3XX_CAN_RERRSYNR_OFFSET)
#define S32K3XX_CAN3_ERRSR                   (S32K3XX_CAN3_BASE + S32K3XX_CAN_ERRSR_OFFSET)
#define S32K3XX_CAN3_EPRS                    (S32K3XX_CAN3_BASE + S32K3XX_CAN_EPRS_OFFSET)
#define S32K3XX_CAN3_ENCBT                   (S32K3XX_CAN3_BASE + S32K3XX_CAN_ENCBT_OFFSET)
#define S32K3XX_CAN3_EDCBT                   (S32K3XX_CAN3_BASE + S32K3XX_CAN_EDCBT_OFFSET)
#define S32K3XX_CAN3_ETDC                    (S32K3XX_CAN3_BASE + S32K3XX_CAN_ETDC_OFFSET)
#define S32K3XX_CAN3_FDCTRL                  (S32K3XX_CAN3_BASE + S32K3XX_CAN_FDCTRL_OFFSET)
#define S32K3XX_CAN3_FDCBT                   (S32K3XX_CAN3_BASE + S32K3XX_CAN_FDCBT_OFFSET)
#define S32K3XX_CAN3_FDCRC                   (S32K3XX_CAN3_BASE + S32K3XX_CAN_FDCRC_OFFSET)
#define S32K3XX_CAN3_ERFCR                   (S32K3XX_CAN3_BASE + S32K3XX_CAN_ERFCR_OFFSET)
#define S32K3XX_CAN3_ERFIER                  (S32K3XX_CAN3_BASE + S32K3XX_CAN_ERFIER_OFFSET)
#define S32K3XX_CAN3_ERFSR                   (S32K3XX_CAN3_BASE + S32K3XX_CAN_ERFSR_OFFSET)

