apache/nuttx/arch/arm/src/s32k3xx/hardware/s32k3xx_flexcan.h
#define S32K3XX_CAN5_ERFFEL(n)               (S32K3XX_CAN5_BASE + S32K3XX_CAN_ERFFEL_OFFSET(n))
#  define S32K3XX_CAN5_ERFFEL0               (S32K3XX_CAN5_BASE + S32K3XX_CAN_ERFFEL0_OFFSET)
#  define S32K3XX_CAN5_ERFFEL1               (S32K3XX_CAN5_BASE + S32K3XX_CAN_ERFFEL1_OFFSET)
#  define S32K3XX_CAN5_ERFFEL2               (S32K3XX_CAN5_BASE + S32K3XX_CAN_ERFFEL2_OFFSET)
#  define S32K3XX_CAN5_ERFFEL3               (S32K3XX_CAN5_BASE + S32K3XX_CAN_ERFFEL3_OFFSET)
#  define S32K3XX_CAN5_ERFFEL4               (S32K3XX_CAN5_BASE + S32K3XX_CAN_ERFFEL4_OFFSET)
#  define S32K3XX_CAN5_ERFFEL5               (S32K3XX_CAN5_BASE + S32K3XX_CAN_ERFFEL5_OFFSET)
#  define S32K3XX_CAN5_ERFFEL6               (S32K3XX_CAN5_BASE + S32K3XX_CAN_ERFFEL6_OFFSET)
#  define S32K3XX_CAN5_ERFFEL7               (S32K3XX_CAN5_BASE + S32K3XX_CAN_ERFFEL7_OFFSET)
#  define S32K3XX_CAN5_ERFFEL8               (S32K3XX_CAN5_BASE + S32K3XX_CAN_ERFFEL8_OFFSET)
#  define S32K3XX_CAN5_ERFFEL9               (S32K3XX_CAN5_BASE + S32K3XX_CAN_ERFFEL9_OFFSET)
#  define S32K3XX_CAN5_ERFFEL10              (S32K3XX_CAN5_BASE + S32K3XX_CAN_ERFFEL10_OFFSET)
#  define S32K3XX_CAN5_ERFFEL11              (S32K3XX_CAN5_BASE + S32K3XX_CAN_ERFFEL11_OFFSET)
#  define S32K3XX_CAN5_ERFFEL12              (S32K3XX_CAN5_BASE + S32K3XX_CAN_ERFFEL12_OFFSET)
#  define S32K3XX_CAN5_ERFFEL13              (S32K3XX_CAN5_BASE + S32K3XX_CAN_ERFFEL13_OFFSET)
#  define S32K3XX_CAN5_ERFFEL14              (S32K3XX_CAN5_BASE + S32K3XX_CAN_ERFFEL14_OFFSET)
#  define S32K3XX_CAN5_ERFFEL15              (S32K3XX_CAN5_BASE + S32K3XX_CAN_ERFFEL15_OFFSET)
#  define S32K3XX_CAN5_ERFFEL16              (S32K3XX_CAN5_BASE + S32K3XX_CAN_ERFFEL16_OFFSET)
#  define S32K3XX_CAN5_ERFFEL17              (S32K3XX_CAN5_BASE + S32K3XX_CAN_ERFFEL17_OFFSET)
#  define S32K3XX_CAN5_ERFFEL18              (S32K3XX_CAN5_BASE + S32K3XX_CAN_ERFFEL18_OFFSET)
#  define S32K3XX_CAN5_ERFFEL19              (S32K3XX_CAN5_BASE + S32K3XX_CAN_ERFFEL19_OFFSET)
#  define S32K3XX_CAN5_ERFFEL20              (S32K3XX_CAN5_BASE + S32K3XX_CAN_ERFFEL20_OFFSET)
#  define S32K3XX_CAN5_ERFFEL21              (S32K3XX_CAN5_BASE + S32K3XX_CAN_ERFFEL21_OFFSET)
#  define S32K3XX_CAN5_ERFFEL22              (S32K3XX_CAN5_BASE + S32K3XX_CAN_ERFFEL22_OFFSET)
#  define S32K3XX_CAN5_ERFFEL23              (S32K3XX_CAN5_BASE + S32K3XX_CAN_ERFFEL23_OFFSET)
#  define S32K3XX_CAN5_ERFFEL24              (S32K3XX_CAN5_BASE + S32K3XX_CAN_ERFFEL24_OFFSET)
#  define S32K3XX_CAN5_ERFFEL25              (S32K3XX_CAN5_BASE + S32K3XX_CAN_ERFFEL25_OFFSET)
#  define S32K3XX_CAN5_ERFFEL26              (S32K3XX_CAN5_BASE + S32K3XX_CAN_ERFFEL26_OFFSET)
#  define S32K3XX_CAN5_ERFFEL27              (S32K3XX_CAN5_BASE + S32K3XX_CAN_ERFFEL27_OFFSET)
#  define S32K3XX_CAN5_ERFFEL28              (S32K3XX_CAN5_BASE + S32K3XX_CAN_ERFFEL28_OFFSET)
#  define S32K3XX_CAN5_ERFFEL29              (S32K3XX_CAN5_BASE + S32K3XX_CAN_ERFFEL29_OFFSET)
#  define S32K3XX_CAN5_ERFFEL30              (S32K3XX_CAN5_BASE + S32K3XX_CAN_ERFFEL30_OFFSET)
#  define S32K3XX_CAN5_ERFFEL31              (S32K3XX_CAN5_BASE + S32K3XX_CAN_ERFFEL31_OFFSET)
#  define S32K3XX_CAN5_ERFFEL32              (S32K3XX_CAN5_BASE + S32K3XX_CAN_ERFFEL32_OFFSET)
#  define S32K3XX_CAN5_ERFFEL33              (S32K3XX_CAN5_BASE + S32K3XX_CAN_ERFFEL33_OFFSET)
#  define S32K3XX_CAN5_ERFFEL34              (S32K3XX_CAN5_BASE + S32K3XX_CAN_ERFFEL34_OFFSET)
#  define S32K3XX_CAN5_ERFFEL35              (S32K3XX_CAN5_BASE + S32K3XX_CAN_ERFFEL35_OFFSET)
#  define S32K3XX_CAN5_ERFFEL36              (S32K3XX_CAN5_BASE + S32K3XX_CAN_ERFFEL36_OFFSET)
#  define S32K3XX_CAN5_ERFFEL37              (S32K3XX_CAN5_BASE + S32K3XX_CAN_ERFFEL37_OFFSET)
#  define S32K3XX_CAN5_ERFFEL38              (S32K3XX_CAN5_BASE + S32K3XX_CAN_ERFFEL38_OFFSET)
#  define S32K3XX_CAN5_ERFFEL39              (S32K3XX_CAN5_BASE + S32K3XX_CAN_ERFFEL39_OFFSET)
#  define S32K3XX_CAN5_ERFFEL40              (S32K3XX_CAN5_BASE + S32K3XX_CAN_ERFFEL40_OFFSET)
#  define S32K3XX_CAN5_ERFFEL41              (S32K3XX_CAN5_BASE + S32K3XX_CAN_ERFFEL41_OFFSET)
#  define S32K3XX_CAN5_ERFFEL42              (S32K3XX_CAN5_BASE + S32K3XX_CAN_ERFFEL42_OFFSET)
#  define S32K3XX_CAN5_ERFFEL43              (S32K3XX_CAN5_BASE + S32K3XX_CAN_ERFFEL43_OFFSET)
#  define S32K3XX_CAN5_ERFFEL44              (S32K3XX_CAN5_BASE + S32K3XX_CAN_ERFFEL44_OFFSET)
#  define S32K3XX_CAN5_ERFFEL45              (S32K3XX_CAN5_BASE + S32K3XX_CAN_ERFFEL45_OFFSET)
#  define S32K3XX_CAN5_ERFFEL46              (S32K3XX_CAN5_BASE + S32K3XX_CAN_ERFFEL46_OFFSET)
#  define S32K3XX_CAN5_ERFFEL47              (S32K3XX_CAN5_BASE + S32K3XX_CAN_ERFFEL47_OFFSET)
#  define S32K3XX_CAN5_ERFFEL48              (S32K3XX_CAN5_BASE + S32K3XX_CAN_ERFFEL48_OFFSET)
#  define S32K3XX_CAN5_ERFFEL49              (S32K3XX_CAN5_BASE + S32K3XX_CAN_ERFFEL49_OFFSET)
#  define S32K3XX_CAN5_ERFFEL50              (S32K3XX_CAN5_BASE + S32K3XX_CAN_ERFFEL50_OFFSET)
#  define S32K3XX_CAN5_ERFFEL51              (S32K3XX_CAN5_BASE + S32K3XX_CAN_ERFFEL51_OFFSET)
#  define S32K3XX_CAN5_ERFFEL52              (S32K3XX_CAN5_BASE + S32K3XX_CAN_ERFFEL52_OFFSET)
#  define S32K3XX_CAN5_ERFFEL53              (S32K3XX_CAN5_BASE + S32K3XX_CAN_ERFFEL53_OFFSET)
#  define S32K3XX_CAN5_ERFFEL54              (S32K3XX_CAN5_BASE + S32K3XX_CAN_ERFFEL54_OFFSET)
#  define S32K3XX_CAN5_ERFFEL55              (S32K3XX_CAN5_BASE + S32K3XX_CAN_ERFFEL55_OFFSET)
#  define S32K3XX_CAN5_ERFFEL56              (S32K3XX_CAN5_BASE + S32K3XX_CAN_ERFFEL56_OFFSET)
#  define S32K3XX_CAN5_ERFFEL57              (S32K3XX_CAN5_BASE + S32K3XX_CAN_ERFFEL57_OFFSET)
#  define S32K3XX_CAN5_ERFFEL58              (S32K3XX_CAN5_BASE + S32K3XX_CAN_ERFFEL58_OFFSET)
#  define S32K3XX_CAN5_ERFFEL59              (S32K3XX_CAN5_BASE + S32K3XX_CAN_ERFFEL59_OFFSET)
#  define S32K3XX_CAN5_ERFFEL60              (S32K3XX_CAN5_BASE + S32K3XX_CAN_ERFFEL60_OFFSET)
#  define S32K3XX_CAN5_ERFFEL61              (S32K3XX_CAN5_BASE + S32K3XX_CAN_ERFFEL61_OFFSET)
#  define S32K3XX_CAN5_ERFFEL62              (S32K3XX_CAN5_BASE + S32K3XX_CAN_ERFFEL62_OFFSET)
#  define S32K3XX_CAN5_ERFFEL63              (S32K3XX_CAN5_BASE + S32K3XX_CAN_ERFFEL63_OFFSET)
#  define S32K3XX_CAN5_ERFFEL64              (S32K3XX_CAN5_BASE + S32K3XX_CAN_ERFFEL64_OFFSET)
#  define S32K3XX_CAN5_ERFFEL65              (S32K3XX_CAN5_BASE + S32K3XX_CAN_ERFFEL65_OFFSET)
#  define S32K3XX_CAN5_ERFFEL66              (S32K3XX_CAN5_BASE + S32K3XX_CAN_ERFFEL66_OFFSET)
#  define S32K3XX_CAN5_ERFFEL67              (S32K3XX_CAN5_BASE + S32K3XX_CAN_ERFFEL67_OFFSET)
#  define S32K3XX_CAN5_ERFFEL68              (S32K3XX_CAN5_BASE + S32K3XX_CAN_ERFFEL68_OFFSET)
#  define S32K3XX_CAN5_ERFFEL69              (S32K3XX_CAN5_BASE + S32K3XX_CAN_ERFFEL69_OFFSET)
#  define S32K3XX_CAN5_ERFFEL70              (S32K3XX_CAN5_BASE + S32K3XX_CAN_ERFFEL70_OFFSET)
#  define S32K3XX_CAN5_ERFFEL71              (S32K3XX_CAN5_BASE + S32K3XX_CAN_ERFFEL71_OFFSET)
#  define S32K3XX_CAN5_ERFFEL72              (S32K3XX_CAN5_BASE + S32K3XX_CAN_ERFFEL72_OFFSET)
#  define S32K3XX_CAN5_ERFFEL73              (S32K3XX_CAN5_BASE + S32K3XX_CAN_ERFFEL73_OFFSET)
#  define S32K3XX_CAN5_ERFFEL74              (S32K3XX_CAN5_BASE + S32K3XX_CAN_ERFFEL74_OFFSET)
#  define S32K3XX_CAN5_ERFFEL75              (S32K3XX_CAN5_BASE + S32K3XX_CAN_ERFFEL75_OFFSET)
#  define S32K3XX_CAN5_ERFFEL76              (S32K3XX_CAN5_BASE + S32K3XX_CAN_ERFFEL76_OFFSET)
#  define S32K3XX_CAN5_ERFFEL77              (S32K3XX_CAN5_BASE + S32K3XX_CAN_ERFFEL77_OFFSET)
#  define S32K3XX_CAN5_ERFFEL78              (S32K3XX_CAN5_BASE + S32K3XX_CAN_ERFFEL78_OFFSET)
#  define S32K3XX_CAN5_ERFFEL79              (S32K3XX_CAN5_BASE + S32K3XX_CAN_ERFFEL79_OFFSET)
#  define S32K3XX_CAN5_ERFFEL80              (S32K3XX_CAN5_BASE + S32K3XX_CAN_ERFFEL80_OFFSET)
#  define S32K3XX_CAN5_ERFFEL81              (S32K3XX_CAN5_BASE + S32K3XX_CAN_ERFFEL81_OFFSET)
#  define S32K3XX_CAN5_ERFFEL82              (S32K3XX_CAN5_BASE + S32K3XX_CAN_ERFFEL82_OFFSET)
#  define S32K3XX_CAN5_ERFFEL83              (S32K3XX_CAN5_BASE + S32K3XX_CAN_ERFFEL83_OFFSET)
#  define S32K3XX_CAN5_ERFFEL84              (S32K3XX_CAN5_BASE + S32K3XX_CAN_ERFFEL84_OFFSET)
#  define S32K3XX_CAN5_ERFFEL85              (S32K3XX_CAN5_BASE + S32K3XX_CAN_ERFFEL85_OFFSET)
#  define S32K3XX_CAN5_ERFFEL86              (S32K3XX_CAN5_BASE + S32K3XX_CAN_ERFFEL86_OFFSET)
#  define S32K3XX_CAN5_ERFFEL87              (S32K3XX_CAN5_BASE + S32K3XX_CAN_ERFFEL87_OFFSET)
#  define S32K3XX_CAN5_ERFFEL88              (S32K3XX_CAN5_BASE + S32K3XX_CAN_ERFFEL88_OFFSET)
#  define S32K3XX_CAN5_ERFFEL89              (S32K3XX_CAN5_BASE + S32K3XX_CAN_ERFFEL89_OFFSET)
#  define S32K3XX_CAN5_ERFFEL90              (S32K3XX_CAN5_BASE + S32K3XX_CAN_ERFFEL90_OFFSET)
#  define S32K3XX_CAN5_ERFFEL91              (S32K3XX_CAN5_BASE + S32K3XX_CAN_ERFFEL91_OFFSET)
#  define S32K3XX_CAN5_ERFFEL92              (S32K3XX_CAN5_BASE + S32K3XX_CAN_ERFFEL92_OFFSET)
#  define S32K3XX_CAN5_ERFFEL93              (S32K3XX_CAN5_BASE + S32K3XX_CAN_ERFFEL93_OFFSET)
#  define S32K3XX_CAN5_ERFFEL94              (S32K3XX_CAN5_BASE + S32K3XX_CAN_ERFFEL94_OFFSET)
#  define S32K3XX_CAN5_ERFFEL95              (S32K3XX_CAN5_BASE + S32K3XX_CAN_ERFFEL95_OFFSET)
#  define S32K3XX_CAN5_ERFFEL96              (S32K3XX_CAN5_BASE + S32K3XX_CAN_ERFFEL96_OFFSET)
#  define S32K3XX_CAN5_ERFFEL97              (S32K3XX_CAN5_BASE + S32K3XX_CAN_ERFFEL97_OFFSET)
#  define S32K3XX_CAN5_ERFFEL98              (S32K3XX_CAN5_BASE + S32K3XX_CAN_ERFFEL98_OFFSET)
#  define S32K3XX_CAN5_ERFFEL99              (S32K3XX_CAN5_BASE + S32K3XX_CAN_ERFFEL99_OFFSET)
#  define S32K3XX_CAN5_ERFFEL100             (S32K3XX_CAN5_BASE + S32K3XX_CAN_ERFFEL100_OFFSET)
#  define S32K3XX_CAN5_ERFFEL101             (S32K3XX_CAN5_BASE + S32K3XX_CAN_ERFFEL101_OFFSET)
#  define S32K3XX_CAN5_ERFFEL102             (S32K3XX_CAN5_BASE + S32K3XX_CAN_ERFFEL102_OFFSET)
#  define S32K3XX_CAN5_ERFFEL103             (S32K3XX_CAN5_BASE + S32K3XX_CAN_ERFFEL103_OFFSET)
#  define S32K3XX_CAN5_ERFFEL104             (S32K3XX_CAN5_BASE + S32K3XX_CAN_ERFFEL104_OFFSET)
#  define S32K3XX_CAN5_ERFFEL105             (S32K3XX_CAN5_BASE + S32K3XX_CAN_ERFFEL105_OFFSET)
#  define S32K3XX_CAN5_ERFFEL106             (S32K3XX_CAN5_BASE + S32K3XX_CAN_ERFFEL106_OFFSET)
#  define S32K3XX_CAN5_ERFFEL107             (S32K3XX_CAN5_BASE + S32K3XX_CAN_ERFFEL107_OFFSET)
#  define S32K3XX_CAN5_ERFFEL108             (S32K3XX_CAN5_BASE + S32K3XX_CAN_ERFFEL108_OFFSET)
#  define S32K3XX_CAN5_ERFFEL109             (S32K3XX_CAN5_BASE + S32K3XX_CAN_ERFFEL109_OFFSET)
#  define S32K3XX_CAN5_ERFFEL110             (S32K3XX_CAN5_BASE + S32K3XX_CAN_ERFFEL110_OFFSET)
#  define S32K3XX_CAN5_ERFFEL111             (S32K3XX_CAN5_BASE + S32K3XX_CAN_ERFFEL111_OFFSET)
#  define S32K3XX_CAN5_ERFFEL112             (S32K3XX_CAN5_BASE + S32K3XX_CAN_ERFFEL112_OFFSET)
#  define S32K3XX_CAN5_ERFFEL113             (S32K3XX_CAN5_BASE + S32K3XX_CAN_ERFFEL113_OFFSET)
#  define S32K3XX_CAN5_ERFFEL114             (S32K3XX_CAN5_BASE + S32K3XX_CAN_ERFFEL114_OFFSET)
#  define S32K3XX_CAN5_ERFFEL115             (S32K3XX_CAN5_BASE + S32K3XX_CAN_ERFFEL115_OFFSET)
#  define S32K3XX_CAN5_ERFFEL116             (S32K3XX_CAN5_BASE + S32K3XX_CAN_ERFFEL116_OFFSET)
#  define S32K3XX_CAN5_ERFFEL117             (S32K3XX_CAN5_BASE + S32K3XX_CAN_ERFFEL117_OFFSET)
#  define S32K3XX_CAN5_ERFFEL118             (S32K3XX_CAN5_BASE + S32K3XX_CAN_ERFFEL118_OFFSET)
#  define S32K3XX_CAN5_ERFFEL119             (S32K3XX_CAN5_BASE + S32K3XX_CAN_ERFFEL119_OFFSET)
#  define S32K3XX_CAN5_ERFFEL120             (S32K3XX_CAN5_BASE + S32K3XX_CAN_ERFFEL120_OFFSET)
#  define S32K3XX_CAN5_ERFFEL121             (S32K3XX_CAN5_BASE + S32K3XX_CAN_ERFFEL121_OFFSET)
#  define S32K3XX_CAN5_ERFFEL122             (S32K3XX_CAN5_BASE + S32K3XX_CAN_ERFFEL122_OFFSET)
#  define S32K3XX_CAN5_ERFFEL123             (S32K3XX_CAN5_BASE + S32K3XX_CAN_ERFFEL123_OFFSET)
#  define S32K3XX_CAN5_ERFFEL124             (S32K3XX_CAN5_BASE + S32K3XX_CAN_ERFFEL124_OFFSET)
#  define S32K3XX_CAN5_ERFFEL125             (S32K3XX_CAN5_BASE + S32K3XX_CAN_ERFFEL125_OFFSET)
#  define S32K3XX_CAN5_ERFFEL126             (S32K3XX_CAN5_BASE + S32K3XX_CAN_ERFFEL126_OFFSET)
#  define S32K3XX_CAN5_ERFFEL127             (S32K3XX_CAN5_BASE + S32K3XX_CAN_ERFFEL127_OFFSET)

/* FlexCAN Register Bitfield Definitions ************************************/

/* Module Configuration Register (MCR) */

