apache/nuttx/arch/arm/src/s32k3xx/hardware/s32k3xx_flexcan.h
#define CAN_MCR_MAXMB_SHIFT           (0)       /* Bits 0-6: Number of the Last Message Buffer (MAXMB) */
#define CAN_MCR_MAXMB_MASK            (0x7f << CAN_MCR_MAXMB_SHIFT)
                                                /* Bit 7: Reserved */
#define CAN_MCR_IDAM_SHIFT            (8)       /* Bits 8-9: ID Acceptance Mode (IDAM) */
#define CAN_MCR_IDAM_MASK             (0x03 << CAN_MCR_IDAM_SHIFT)
#  define CAN_MCR_IDAM_FMTA           (0x00 << CAN_MCR_IDAM_SHIFT) /* Format A: One full ID  */
#  define CAN_MCR_IDAM_FMTB           (0x01 << CAN_MCR_IDAM_SHIFT) /* Format B: Two full (or partial) IDs */
#  define CAN_MCR_IDAM_FMTC           (0x02 << CAN_MCR_IDAM_SHIFT) /* Format C: Four partial IDs */
#  define CAN_MCR_IDAM_FMTD           (0x03 << CAN_MCR_IDAM_SHIFT) /* Format D: All frames rejected */

                                                /* Bit 10: Reserved */
#define CAN_MCR_FDEN                  (1 << 11) /* Bit 11: CAN FD operation enable (FDEN) */
#define CAN_MCR_AEN                   (1 << 12) /* Bit 12: Abort Enable (AEN) */
#define CAN_MCR_LPRIOEN               (1 << 13) /* Bit 13: Local Priority Enable (LPRIOEN) */
                                                /* Bit 14: Reserved */
#define CAN_MCR_DMA                   (1 << 15) /* Bit 15: DMA Enable (DMA) */
#define CAN_MCR_IRMQ                  (1 << 16) /* Bit 16: Individual Rx Masking and Queue Enable (IRMQ) */
#define CAN_MCR_SRXDIS                (1 << 17) /* Bit 17: Self Reception Disable (SRXDIS) */
                                                /* Bits 18-19: Reserved */
#define CAN_MCR_LPMACK                (1 << 20) /* Bit 20: Low-Power Mode Acknowledge (LPMACK) */
#define CAN_MCR_WRNEN                 (1 << 21) /* Bit 21: Warning Interrupt Enable (WRNEN) */
                                                /* Bit 22: Reserved */
#define CAN_MCR_SUPV                  (1 << 23) /* Bit 23: Supervisor Mode (SUPV) */
#define CAN_MCR_FRZACK                (1 << 24) /* Bit 24: Freeze Mode Acknowledge (FRZACK) */
#define CAN_MCR_SOFTRST               (1 << 25) /* Bit 25: Soft Reset (SOFTRST) */
                                                /* Bit 26: Reserved */
#define CAN_MCR_NOTRDY                (1 << 27) /* Bit 27: FlexCAN Not Ready (NOTRDY) */
#define CAN_MCR_HALT                  (1 << 28) /* Bit 28: Halt FlexCAN (HALT) */
#define CAN_MCR_RFEN                  (1 << 29) /* Bit 29: Legacy Rx FIFO Enable (RFEN) */
#define CAN_MCR_FRZ                   (1 << 30) /* Bit 30: Freeze Enable (FRZ) */
#define CAN_MCR_MDIS                  (1 << 31) /* Bit 31: Module Disable (MDIS) */

/* Control 1 Register (CTRL1) */

#define CAN_CTRL1_PROPSEG_SHIFT       (0)       /* Bits 0-2: Propagation Segment (PROPSEG) */
#define CAN_CTRL1_PROPSEG_MASK        (0x07 << CAN_CTRL1_PROPSEG_SHIFT)
#define CAN_CTRL1_PROPSEG(x)          (((x) << CAN_CTRL1_PROPSEG_SHIFT) & CAN_CTRL1_PROPSEG_MASK)
#define CAN_CTRL1_LOM                 (1 << 3)  /* Bit 3: Listen-Only Mode (LOM) */
#define CAN_CTRL1_LBUF                (1 << 4)  /* Bit 4: Lowest Buffer Transmitted First (LBUF) */
#define CAN_CTRL1_TSYN                (1 << 5)  /* Bit 5: Timer Sync (TSYN) */
#define CAN_CTRL1_BOFFREC             (1 << 6)  /* Bit 6: Bus Off Recovery (BOFFREC) */
#define CAN_CTRL1_SMP                 (1 << 7)  /* Bit 7: CAN Bit Sampling (SMP) */
                                                /* Bits 8-9: Reserved */
#define CAN_CTRL1_RWRNMSK             (1 << 10) /* Bit 10: Rx Warning Interrupt Mask (RWRNMSK) */
#define CAN_CTRL1_TWRNMSK             (1 << 11) /* Bit 11: Tx Warning Interrupt Mask (TWRNMSK) */
#define CAN_CTRL1_LPB                 (1 << 12) /* Bit 12: Loop Back Mode (LPB) */
                                                /* Bit 13: Reserved */
#define CAN_CTRL1_ERRMSK              (1 << 14) /* Bit 14: Error Interrupt Mask (ERRMSK) */
#define CAN_CTRL1_BOFFMSK             (1 << 15) /* Bit 15: Bus Off Interrupt Mask (BOFFMSK) */
#define CAN_CTRL1_TIMINGMSK           ((0xffff << 16) | CAN_CTRL1_PROPSEG_MASK)
                                                /* Bitmask for propseg, pseg1/2, rjw & presdiv */
#define CAN_CTRL1_PSEG2_SHIFT         (16)      /* Bits 16-18: Phase Segment 2 (PSEG2) */
#define CAN_CTRL1_PSEG2_MASK          (0x07 << CAN_CTRL1_PSEG2_SHIFT)
#define CAN_CTRL1_PSEG2(x)            (((x) << CAN_CTRL1_PSEG2_SHIFT) & CAN_CTRL1_PSEG2_MASK)
#define CAN_CTRL1_PSEG1_SHIFT         (19)      /* Bits 19-21: Phase Segment 1 (PSEG1) */
#define CAN_CTRL1_PSEG1_MASK          (0x07 << CAN_CTRL1_PSEG1_SHIFT)
#define CAN_CTRL1_PSEG1(x)            (((x) << CAN_CTRL1_PSEG1_SHIFT) & CAN_CTRL1_PSEG1_MASK)
#define CAN_CTRL1_RJW_SHIFT           (22)      /* Bits 22-23: Resync Jump Width (RJW) */
#define CAN_CTRL1_RJW_MASK            (0x03 << CAN_CTRL1_RJW_SHIFT)
#define CAN_CTRL1_RJW(x)              (((x) << CAN_CTRL1_RJW_SHIFT) & CAN_CTRL1_RJW_MASK)
#define CAN_CTRL1_PRESDIV_SHIFT       (24)      /* Bits 24-31: Prescaler Division Factor (PRESDIV) */
#define CAN_CTRL1_PRESDIV_MASK        (0xff << CAN_CTRL1_PRESDIV_SHIFT)
#define CAN_CTRL1_PRESDIV(x)          (((x) << CAN_CTRL1_PRESDIV_SHIFT) & CAN_CTRL1_PRESDIV_MASK)

/* Free Running Timer (TIMER) */

#define CAN_TIMER_SHIFT               (0)       /* Bits 0-15: Timer value (TIMER) */
#define CAN_TIMER_MASK                (0xffff << CAN_TIMER_SHIFT)
                                                    /* Bits 16-31: Reserved */

/* Rx Mailboxes Global Mask Register (RXMGMASK) */

#define CAN_RXMGMASK(n)               (1 << (n)) /* Bit n: Rx Mailbox n Global Mask Bit (MGn) */

/* Rx 14 Mask Register (RX14MASK) */

#define CAN_RX14MASK(n)               (1 << (n)) /* Bit n: Rx Buffer 14 Mask Bit n (RX14M) */

/* Rx 15 Mask Register (RX15MASK) */

#define CAN_RX15MASK(n)               (1 << (n)) /* Bit n: Rx Buffer 15 Mask Bit n (RX15M) */

/* Error Counter (ECR) */

#define CAN_ECR_TXERRCNT_SHIFT        (0)       /* Bits 0-7: Transmit Error Counter (TXERRCNT) */
#define CAN_ECR_TXERRCNT_MASK         (0xff << CAN_ECR_TXERRCNT_SHIFT)
#define CAN_ECR_RXERRCNT_SHIFT        (8)       /* Bits 8-15: Receive Error Counter (RXERRCNT) */
#define CAN_ECR_RXERRCNT_MASK         (0xff << CAN_ECR_RXERRCNT_SHIFT)
#define CAN_ECR_TXERRCNT_FAST_SHIFT   (16)       /* Bits 16-23: Transmit Error Counter for fast bits (TXERRCNT_FAST) */
#define CAN_ECR_TXERRCNT_FAST_MASK    (0xff << CAN_ECR_TXERRCNT_FAST_SHIFT)
#define CAN_ECR_RXERRCNT_FAST_SHIFT   (24)       /* Bits 24-31: Receive Error Counter for fast bits (RXERRCNT_FAST) */
#define CAN_ECR_RXERRCNT_FAST_MASK    (0xff << CAN_ECR_RXERRCNT_FAST_SHIFT)

