apache/nuttx/arch/arm/src/s32k3xx/hardware/s32k3xx_flexcan.h
/* Error and Status 1 Register (ESR1) */

                                                    /* Bit 0: Reserved */
#define CAN_ESR1_ERRINT               (1 << 1)  /* Bit 1: Error Interrupt (ERRINT) */
#define CAN_ESR1_BOFFINT              (1 << 2)  /* Bit 2: Bus Off Interrupt (BOFFINT) */
#define CAN_ESR1_RX                   (1 << 3)  /* Bit 3: FlexCAN in Reception (RX) */
#define CAN_ESR1_FLTCONF_SHIFT        (4)       /* Bits 4-5: Fault Confinement State (FLTCONF) */
#define CAN_ESR1_FLTCONF_MASK         (0x03 << CAN_ESR1_FLTCONF_SHIFT)
#  define CAN_ESR1_FLTCONF_ACTV       (0x00 << CAN_ESR1_FLTCONF_SHIFT) /* Error Active */
#  define CAN_ESR1_FLTCONF_PASV       (0x01 << CAN_ESR1_FLTCONF_SHIFT) /* Error Passive */
#  define CAN_ESR1_FLTCONF_OFF        (0x02 << CAN_ESR1_FLTCONF_SHIFT) /* Bus Off */

#define CAN_ESR1_TX                   (1 << 6)  /* Bit 6: FlexCAN in Transmission (TX) */
#define CAN_ESR1_IDLE                 (1 << 7)  /* Bit 7: CAN bus is in IDLE state (IDLE) */
#define CAN_ESR1_RXWRN                (1 << 8)  /* Bit 8: Rx Error Warning (RXWRN) */
#define CAN_ESR1_TXWRN                (1 << 9)  /* Bit 9: TX Error Warning (TXWRN) */
#define CAN_ESR1_STFERR               (1 << 10) /* Bit 10: Stuffing Error (STFERR) */
#define CAN_ESR1_FRMERR               (1 << 11) /* Bit 11: Form Error (FRMERR) */
#define CAN_ESR1_CRCERR               (1 << 12) /* Bit 12: Cyclic Redundancy Check Error (CRCERR) */
#define CAN_ESR1_ACKERR               (1 << 13) /* Bit 13: Acknowledge Error (ACKERR) */
#define CAN_ESR1_BIT0ERR              (1 << 14) /* Bit 14: Bit0 Error (BIT0ERR) */
#define CAN_ESR1_BIT1ERR              (1 << 15) /* Bit 15: Bit1 Error (BIT1ERR) */
#define CAN_ESR1_RWRNINT              (1 << 16) /* Bit 16: Rx Warning Interrupt Flag (RWRNINT) */
#define CAN_ESR1_TWRNINT              (1 << 17) /* Bit 17: Tx Warning Interrupt Flag (TWRNINT) */
#define CAN_ESR1_SYNCH                (1 << 18) /* Bit 18: CAN Synchronization Status (SYNCH) */
#define CAN_ESR1_BOFFDONEINT          (1 << 19) /* Bit 19: Bus Off Done Interrupt (BOFFDONEINT) */
#define CAN_ESR1_ERRINT_FAST          (1 << 20) /* Bit 20: Error interrupt for errors detected in Data Phase of CAN FD frames with BRS bit set (ERRINT_FAST) */
#define CAN_ESR1_ERROVR               (1 << 21) /* Bit 21: Error Overrun (ERROVR) */
                                                /* Bits 22-25: Reserved */
#define CAN_ESR1_STFERR_FAST          (1 << 26) /* Bit 26: Stuffing Error in the Data Phase of CAN FD frames with the BRS bit set (STFERR_FAST) */
#define CAN_ESR1_FRMERR_FAST          (1 << 27) /* Bit 27: Form Error in the Data Phase of CAN FD frames with the BRS bit set (FRMERR_FAST) */
#define CAN_ESR1_CRCERR_FAST          (1 << 28) /* Bit 28: Cyclic Redundancy Check Error in the CRC field of CAN FD frames with the BRS bit set (CRCERR_FAST) */
                                                /* Bit 29: Reserved */
#define CAN_ESR1_BIT0ERR_FAST         (1 << 30) /* Bit 30: Bit0 Error in the Data Phase of CAN FD frames with the BRS bit set (BIT0ERR_FAST) */
#define CAN_ESR1_BIT1ERR_FAST         (1 << 31) /* Bit 31: Bit1 Error in the Data Phase of CAN FD frames with the BRS bit set (BIT1ERR_FAST) */

/* Interrupt Masks 2 Register (IMASK2) */

#define CAN_IMASK2(n)                 (1 << (n)) /* Bit n: Buffer MBn Mask (BUF63TO32M) */

/* Interrupt Masks 1 Register (IMASK1) */

#define CAN_IMASK1(n)                 (1 << (n)) /* Bit n: Buffer MBn Mask (BUF31TO0M) */

/* Interrupt Flags 2 Register (IFLAG2) */

#define CAN_IFLAG2(n)                 (1 << (n)) /* Bit n: Buffer MBn Interrupt (BUF63TO32I) */

/* Interrupt Flags 1 Register (IFLAG1) */

#define CAN_IFLAG1(n)                 (1 << (n)) /* Bit n: Buffer MBn Interrupt (BUF31TO0I) */

/* Control 2 Register (CTRL2) */

                                                /* Bits 0-5: Reserved */
#define CAN_CTRL2_TSTAMPCAP_SHIFT     (6)       /* Bits 6-7: Time Stamp Capture Point (TSTAMPCAP) */
#define CAN_CTRL2_TSTAMPCAP_MASK      (0x03 << CAN_CTRL2_TSTAMPCAP_SHIFT)
#  define CAN_CTRL2_TSTAMPCAP_DIS     (0x00 << CAN_CTRL2_TSTAMPCAP_SHIFT) /* Disabled */
#  define CAN_CTRL2_TSTAMPCAP_END     (0x01 << CAN_CTRL2_TSTAMPCAP_SHIFT) /* Captured in the end of the CAN frame */
#  define CAN_CTRL2_TSTAMPCAP_START   (0x02 << CAN_CTRL2_TSTAMPCAP_SHIFT) /* Captured in the start of the CAN frame */
#  define CAN_CTRL2_TSTAMPCAP_RES     (0x03 << CAN_CTRL2_TSTAMPCAP_SHIFT) /* Captured in the start of frame for classical CAN frames and in res bit for CAN FD frames */

#define CAN_CTRL2_MBTSBASE_SHIFT      (8)       /* Bits 8-9: Message Buffer Time Stamp Base (MBTSBASE) */
#define CAN_CTRL2_MBTSBASE_MASK       (0x03 << CAN_CTRL2_MBTSBASE_SHIFT)
#  define CAN_CTRL2_MBTSBASE_TIMER    (0x00 << CAN_CTRL2_MBTSBASE_SHIFT) /* Message buffer time stamp base is TIMER */
#  define CAN_CTRL2_MBTSBASE_LOWER    (0x01 << CAN_CTRL2_MBTSBASE_SHIFT) /* Message buffer time stamp base is lower 16 bits of higher resolution timer */
#  define CAN_CTRL2_MBTSBASE_UPPER    (0x02 << CAN_CTRL2_MBTSBASE_SHIFT) /* Message buffer time stamp base is upper 16 bits of higher resolution timer */

                                                /* Bit 10: Reserved */
#define CAN_CTRL2_EDFLTDIS            (1 << 11) /* Bit 11: Edge Filter Disable (EDFLTDIS) */
#define CAN_CTRL2_ISOCANFDEN          (1 << 12) /* Bit 12: ISO CAN FD Enable (ISOCANFDEN) */
#define CAN_CTRL2_BTE                 (1 << 13) /* Bit 13: Bit Timing Expansion enable (BTE) */
#define CAN_CTRL2_PREXCEN             (1 << 14) /* Bit 14: Protocol Exception Enable (PREXCEN) */
#define CAN_CTRL2_TIMER_SRC           (1 << 15) /* Bit 15: Timer Source (TIMER_SRC) */
#define CAN_CTRL2_EACEN               (1 << 16) /* Bit 16: Entire Frame Arbitration Field Comparison Enable For Rx Mailboxes (EACEN) */
#define CAN_CTRL2_RRS                 (1 << 17) /* Bit 17: Remote Request Storing (RRS) */
#define CAN_CTRL2_MRP                 (1 << 18) /* Bit 18: Mailboxes Reception Priority (MRP) */
#define CAN_CTRL2_TASD_SHIFT          (19)      /* Bits 19-23: Tx Arbitration Start Delay (TASD) */
#define CAN_CTRL2_TASD_MASK           (0x1f << CAN_CTRL2_TASD_SHIFT)
#define CAN_CTRL2_RFFN_SHIFT          (24)      /* Bits 24-27: Number of Legacy Rx FIFO Filters (RFFN) */
#define CAN_CTRL2_RFFN_MASK           (0x0f << CAN_CTRL2_RFFN_SHIFT)
#  define CAN_CTRL2_RFFN_8MB          (0x00 << CAN_CTRL2_RFFN_SHIFT)
#  define CAN_CTRL2_RFFN_16MB         (0x01 << CAN_CTRL2_RFFN_SHIFT)
#  define CAN_CTRL2_RFFN_24MB         (0x02 << CAN_CTRL2_RFFN_SHIFT)
#  define CAN_CTRL2_RFFN_32MB         (0x03 << CAN_CTRL2_RFFN_SHIFT)
#  define CAN_CTRL2_RFFN_40MB         (0x04 << CAN_CTRL2_RFFN_SHIFT)
#  define CAN_CTRL2_RFFN_48MB         (0x05 << CAN_CTRL2_RFFN_SHIFT)
#  define CAN_CTRL2_RFFN_56MB         (0x06 << CAN_CTRL2_RFFN_SHIFT)
#  define CAN_CTRL2_RFFN_64MB         (0x07 << CAN_CTRL2_RFFN_SHIFT)
#  define CAN_CTRL2_RFFN_72MB         (0x08 << CAN_CTRL2_RFFN_SHIFT)
#  define CAN_CTRL2_RFFN_80MB         (0x09 << CAN_CTRL2_RFFN_SHIFT)
#  define CAN_CTRL2_RFFN_88MB         (0x0a << CAN_CTRL2_RFFN_SHIFT)
#  define CAN_CTRL2_RFFN_96MB         (0x0b << CAN_CTRL2_RFFN_SHIFT)
#  define CAN_CTRL2_RFFN_104MB        (0x0c << CAN_CTRL2_RFFN_SHIFT)
#  define CAN_CTRL2_RFFN_112MB        (0x0d << CAN_CTRL2_RFFN_SHIFT)
#  define CAN_CTRL2_RFFN_120MB        (0x0e << CAN_CTRL2_RFFN_SHIFT)
#  define CAN_CTRL2_RFFN_128MB        (0x0f << CAN_CTRL2_RFFN_SHIFT)
#define CAN_CTRL2_WRMFRZ              (1 << 28) /* Bit 28: Write-Access to Memory in Freeze mode (WRMFRZ) */
#define CAN_CTRL2_ECRWRE              (1 << 29) /* Bit 29: Error-correction Configuration Register Write Enable (ECRWRE) */
#define CAN_CTRL2_BOFFDONEMSK         (1 << 30) /* Bit 30: Bus Off Done Interrupt Mask (BOFFDONEMSK) */
#define CAN_CTRL2_ERRMSK_FAST         (1 << 31) /* Bit 31: Error Interrupt Mask for errors detected in the data phase of fast CAN FD frames (ERRMSK_FAST) */

/* Error and Status 2 Register (ESR2) */

                                                /* Bits 0-12: Reserved */
#define CAN_ESR2_IMB                  (1 << 13) /* Bit 13: Inactive Mailbox (IMB) */
#define CAN_ESR2_VPS                  (1 << 14) /* Bit 14: Valid Priority Status (VPS) */
                                                /* Bit 15: Reserved */
#define CAN_ESR2_LPTM_SHIFT           (16)      /* Bits 16-22: Lowest Priority Tx Mailbox (LPTM) */
#define CAN_ESR2_LPTM_MASK            (0x7f << CAN_ESR2_LPTM_SHIFT)
                                                /* Bits 23-31: Reserved */

/* CRC Register (CRCR) */

#define CAN_CRCR_TXCRC_SHIFT          (0)       /* Bits 0-14: Transmitted CRC value (TXCRC) */
#define CAN_CRCR_TXCRC_MASK           (0x7fff << CAN_CRCR_TXCRC_SHIFT)
                                                /* Bit 15: Reserved */
#define CAN_CRCR_MBCRC_SHIFT          (16)      /* Bits 16-22: CRC Mailbox (MBCRC) */
#define CAN_CRCR_MBCRC_MASK           (0x7f << CAN_CRCR_MBCRC_SHIFT)
                                                /* Bits 23-31: Reserved */

