apache/nuttx/arch/arm/src/s32k3xx/hardware/s32k3xx_flexcan.h
/* Legacy Rx FIFO Global Mask Register (RXFGMASK) */

#define CAN_RXFGMASK_FGM_SHIFT        (0)       /* Bits 0-31: Legacy Rx FIFO GLobal Mask Bits (FGM) */
#define CAN_RXFGMASK_FGM_MASK         (0xffffffff << CAN_RXFGMASK_FGM_SHIFT)

/* Legacy Rx FIFO Information Register (RXFIR) */

#define CAN_RXFIR_IDHIT_SHIFT         (0)       /* Bits 0-8: Identifier Acceptance Filter Hit Indicator (IDHIT) */
#define CAN_RXFIR_IDHIT_MASK          (0x1ff << CAN_RXFIR_IDHIT_SHIFT)
                                                /* Bits 9-31: Reserved */

/* CAN Bit Timing register (CBT) */

#define CAN_CBT_EPSEG2_SHIFT          (0)       /* Bits 0-4: Extended Phase Segment 2 (EPSEG2) */
#define CAN_CBT_EPSEG2_MASK           (0x1f << CAN_CBT_EPSEG2_SHIFT)
#define CAN_CBT_EPSEG2(x)             (((x) << CAN_CBT_EPSEG2_SHIFT) & CAN_CBT_EPSEG2_MASK)
#define CAN_CBT_EPSEG1_SHIFT          (5)       /* Bits 5-9: Extended Phase Segment 1 (EPSEG1) */
#define CAN_CBT_EPSEG1_MASK           (0x1f << CAN_CBT_EPSEG1_SHIFT)
#define CAN_CBT_EPSEG1(x)             (((x) << CAN_CBT_EPSEG1_SHIFT) & CAN_CBT_EPSEG1_MASK)
#define CAN_CBT_EPROPSEG_SHIFT        (10)      /* Bits 10-15: Extended Propagation Segment (EPROPSEG) */
#define CAN_CBT_EPROPSEG_MASK         (0x3f << CAN_CBT_EPROPSEG_SHIFT)
#define CAN_CBT_EPROPSEG(x)           (((x) << CAN_CBT_EPROPSEG_SHIFT) & CAN_CBT_EPROPSEG_MASK)
#define CAN_CBT_ERJW_SHIFT            (16)      /* Bits 16-20: Extended Resync Jump Width (ERJW) */
#define CAN_CBT_ERJW_MASK             (0x1f << CAN_CBT_ERJW_SHIFT)
#define CAN_CBT_ERJW(x)               (((x) << CAN_CBT_ERJW_SHIFT) & CAN_CBT_ERJW_MASK)
#define CAN_CBT_EPRESDIV_SHIFT        (21)      /* Bits 21-30: Extended Prescaler Division Factor (EPRESDIV) */
#define CAN_CBT_EPRESDIV_MASK         (0x03ff << CAN_CBT_EPRESDIV_SHIFT)
#define CAN_CBT_EPRESDIV(x)           (((x) << CAN_CBT_EPRESDIV_SHIFT) & CAN_CBT_EPRESDIV_MASK)
#define CAN_CBT_BTF                   (1 << 31) /* Bit 31: Bit Timing Format Enable (BTF) */

/* Interrupt Masks 3 Register (IMASK3) */

#define CAN_IMASK3(n)                 (1 << (n)) /* Bit n: Buffer MBn Mask (BUF95TO64M) */

/* Interrupt Flags 3 Register (IFLAG3) */

#define CAN_IFLAG3(n)                 (1 << (n)) /* Bit n: Buffer MBn Interrupt (BUF95TO64I) */

/* Rx Individual Mask Registers (RXIMRn) */

#define CAN_RXIMR(n)                  (1 << (n)) /* Bit n: Individual Mask Bits (MI) */

/* Memory Error Control Register (MECR) */

                                                /* Bit 0-6: Reserved */
#define CAN_MECR_NCEFAFRZ             (1 << 7)  /* Bit 7: Non-Correctable Errors in FlexCAN Access Put Device in Freeze Mode (NCEFAFRZ) */
#define CAN_MECR_ECCDIS               (1 << 8)  /* Bit 8: Error Correction Disable (ECCDIS) */
#define CAN_MECR_RERRDIS              (1 << 9)  /* Bit 9: Error Report Disable (RERRDIS) */
                                                /* Bits 10-12: Reserved */
#define CAN_MECR_EXTERRIE             (1 << 13) /* Bit 13: Extended Error Injection Enable (EXTERRIE) */
#define CAN_MECR_FAERRIE              (1 << 14) /* Bit 14: FlexCAN Access Error Injection Enable (FAERRIE) */
#define CAN_MECR_HAERRIE              (1 << 15) /* Bit 15: Host Access Error Injection Enable (HAERRIE) */
#define CAN_MECR_CEI_MSK              (1 << 16) /* Bit 16: Correctable Errors Interrupt Mask (CEI_MSK) */
                                                /* Bit 17: Reserved */
#define CAN_MECR_FANCEI_MSK           (1 << 18) /* Bit 18: FlexCAN Access With Non-Correctable Errors Interrupt Mask (FANCEI_MSK) */
#define CAN_MECR_HANCEI_MSK           (1 << 19) /* Bit 19: Host Access With Non-Correctable Errors Interrupt Mask (HANCEI_MSK) */
                                                /* Bit 20-30: Reserved */
#define CAN_MECR_ECRWRDIS             (1 << 31) /* Bit 31: Error Configuration Register Write Disable (ECRWRDIS) */

/* Error Injection Address Register (ERRIAR) */

#define CAN_ERRIAR_INJADDR_L_SHIFT    (0)       /* Bits 0-1: Error Injection Address Low (INJADDR_L) */
#define CAN_ERRIAR_INJADDR_L_MASK     (0x03 << CAN_ERRIAR_INJADDR_L_SHIFT)
#define CAN_ERRIAR_INJADDR_H_SHIFT    (2)       /* Bits 2-13: Error Injection Address High (INJADDR_H) */
                                                /* Bits 14-31: Reserved */

/* Error Injection Data Pattern Register (ERRIDPR) */

#define CAN_ERRIDPR_DFLIP_SHIFT       (0)       /* Bits 0-31: Data flip pattern (DFLIP) */
#define CAN_ERRIDPR_DFLIP_MASK        (0xffffffff << CAN_ERRIDPR_DFLIP_SHIFT)

/* Error Injection Parity Pattern Register (ERRIPPR) */

#define CAN_ERRIPPR_PFLIP0_SHIFT      (0)       /* Bits 0-4: Parity Flip Pattern For Byte 0 (Least Significant) (PFLIP0) */
#define CAN_ERRIPPR_PFLIP0_MASK       (0x1f << CAN_ERRIPPR_PFLIP0_SHIFT)
                                                /* Bits 5-7: Reserved */
#define CAN_ERRIPPR_PFLIP1_SHIFT      (8)       /* Bits 8-12: Parity Flip Pattern For Byte 1 (PFLIP1) */
#define CAN_ERRIPPR_PFLIP1_MASK       (0x1f << CAN_ERRIPPR_PFLIP1_SHIFT)
                                                /* Bits 13-15: Reserved */
#define CAN_ERRIPPR_PFLIP2_SHIFT      (16)      /* Bits 16-20: Parity Flip Pattern For Byte 2 (PFLIP2) */
#define CAN_ERRIPPR_PFLIP2_MASK       (0x1f << CAN_ERRIPPR_PFLIP2_SHIFT)
                                                /* Bits 21-23: Reserved */
#define CAN_ERRIPPR_PFLIP3_SHIFT      (24)      /* Bits 24-28: Parity Flip Pattern For Byte 3 (Most Significant) (PFLIP3) */
#define CAN_ERRIPPR_PFLIP3_MASK       (0x1f << CAN_ERRIPPR_PFLIP3_SHIFT)
                                                /* Bits 29-31: Reserved */

/* Error Report Address Register (RERRAR) */

#define CAN_RERRAR_ERRADDR_SHIFT      (0)       /* Bits 0-13: Address Where Error Detected (ERADDR) */
#define CAN_RERRAR_ERRADDR_MASK       (0x3fff << CAN_RERRAR_ERRADDR_SHIFT)
                                                /* Bits 14-15: Reserved */
#define CAN_RERRAR_SAID_SHIFT         (16)      /* Bits 16-18: SAID */
#define CAN_RERRAR_SAID_MASK          (0x07 << CAN_RERRAR_SAID_SHIFT)
                                                /* Bits 19-23: Reserved */
#define CAN_RERRAR_NCE                (1 << 24) /* Bit 24: Non-Correctable Error (NCE) */
                                                /* Bits 25-31: Reserved */

/* Error Report Data Register (RERRDR) */

#define CAN_RERRDR_RDATA_SHIFT        (0)       /* Bits 0-31: Raw data word read from memory with error (RDATA) */
#define CAN_RERRDR_RDATA_MASK         (0xffffffff << CAN_RERRDR_RDATA_SHIFT)

/* Error Report Syndrome Register (RERRSYNR) */

#define CAN_RERRSYNR_SYND0_SHIFT      (0)       /* Bits 0-4: Error Syndrome For Byte 0 (Least Significant) (SYND0) */
#define CAN_RERRSYNR_SYND0_MASK       (0x1f << CAN_RERRSYNR_SYND0_SHIFT)
                                                /* Bits 5-6: Reserved */
#define CAN_RERRSYNR_BE0              (1 << 7)  /* Bit 7: Byte Enabled For Byte 0 (Least Significant) (BE0) */
#define CAN_RERRSYNR_SYND1_SHIFT      (8)       /* Bits 8-12: Error Syndrome For Byte 1 (SYND1) */
#define CAN_RERRSYNR_SYND1_MASK       (0x1f << CAN_RERRSYNR_SYND1_SHIFT)
                                                /* Bits 13-14: Reserved */
#define CAN_RERRSYNR_BE1              (1 << 15) /* Bit 15: Byte Enabled For Byte 1 (BE1) */
#define CAN_RERRSYNR_SYND2_SHIFT      (16)      /* Bits 16-20: Error Syndrome For Byte 2 (SYND2) */
#define CAN_RERRSYNR_SYND2_MASK       (0x1f << CAN_RERRSYNR_SYND2_SHIFT)
                                                /* Bits 21-22: Reserved */
#define CAN_RERRSYNR_BE2              (1 << 23) /* Bit 23: Byte Enabled For Byte 2 (BE2) */
#define CAN_RERRSYNR_SYND3_SHIFT      (24)      /* Bits 24-28: Error Syndrome For Byte 3 (Most Significant) (SYND3) */
#define CAN_RERRSYNR_SYND3_MASK       (0x1f << CAN_RERRSYNR_SYND3_SHIFT)
                                                /* Bits 29-30: Reserved */
#define CAN_RERRSYNR_BE3              (1 << 31) /* Bit 31: Byte Enabled For Byte 3 (Most Significant) (BE3) */

