apache/nuttx/arch/arm/src/s32k3xx/hardware/s32k3xx_flexcan.h
/* Error Status Register (ERRSR) */

#define CAN_ERRSR_CEIOF               (1 << 0)  /* Bit 0: Correctable Error Interrupt Overrun Flag (CEIOF) */
                                                /* Bit 1: Reserved */
#define CAN_ESSR_FANCEIOF             (1 << 2)  /* Bit 2: FlexCAN Access With Non-Correctable Error Interrupt Overrun Flag (FANCEIOF) */
#define CAN_ESSR_HANCEIOF             (1 << 3)  /* Bit 3: Host Access With Non-Correctable Error Interrupt Overrun Flag (HANCEIOF) */
                                                /* Bits 4-15: Reserved */
#define CAN_ESSR_CEIF                 (1 << 16) /* Bit 16: Correctable Error Interrupt Flag (CEIF) */
                                                /* Bit 17: Reserved */
#define CAN_ESSR_FANCEIF              (1 << 18) /* Bit 18: FlexCAN Access With Non-Correctable Error Interrupt Flag (FANCEIF) */
#define CAN_ESSR_HANCEIF              (1 << 19) /* Bit 19: Host Access With Non-Correctable Error Interrupt Flag (HANCEIF) */
                                                /* Bits 20-31: Reserved */

/* Enhanced CAN Bit Timing Prescalers (EPRS) */

#define CAN_EPRS_ENPRESDIV_SHIFT      (0)       /* Bits 0-9: Extended Nominal Prescaler Division Factor (ENPRESDIV) */
#define CAN_EPRS_ENPRESDIV_MASK       (0x03ff << CAN_EPRS_ENPRESDIV_SHIFT)
                                                /* Bits 10-15: Reserved */
#define CAN_EPRS_EDPRESDIV_SHIFT      (16)      /* Bits 16-25: Extended Data Phase Prescaler Division Factor (EDPRESDIV) */
                                                /* Bits 26-31: Reserved */

/* Enhanced Nominal CAN Bit Timing (ENCBT) */

#define CAN_ENCBT_NTSEG1_SHIFT        (0)       /* Bits 0-7: Nominal Time Segment 1 (NTSEG1) */
#define CAN_ENCBT_NTSEG1_MASK         (0xff << CAN_ENCBT_NTSEG1_SHIFT)
                                                /* Bits 8-11: Reserved */
#define CAN_ENCBT_NTSEG2_SHIFT        (12)      /* Bits 12-18: Nominal Time Segment 2 (NTSEG2) */
#define CAN_ENCBT_NTSEG2_MASK         (0x7f << CAN_ENCBT_NTSEG2_SHIFT)
                                                /* Bits 19-21: Reserved */
#define CAN_ENCBT_NRJW_SHIFT          (22)      /* Bits 22-28: Nominal Resynchronization Jump Width (NRJW) */
#define CAN_ENCBT_NRJW_MASK           (0x7f << CAN_ENCBT_NRJW_SHIFT)
                                                /* Bits 29-31: Reserved */

/* Enhanced Data Phase CAN Bit Timing (EDCBT) */

#define CAN_EDCBT_DTSEG1_SHIFT        (0)       /* Bits 0-4: Data Phase Time Segment 1 (DTSEG1) */
#define CAN_EDCBT_DTSEG1_MASK         (0x1f << CAN_EDCBT_DTSEG1_SHIFT)
                                                /* Bits 5-11: Reserved */
#define CAN_EDCBT_DTSEG2_SHIFT        (12)      /* Bits 12-15: Data Phase Time Segment 2 (DTSEG2) */
#define CAN_EDCBT_DTSEG2_MASK         (0x0f << CAN_EDCBT_DTSEG2_SHIFT)
                                                /* Bits 16-21: Reserved */
#define CAN_EDCBT_DRJW_SHIFT          (22)      /* Bits 22-25: Data Phase Resynchronization Jump Width (DRJW) */
#define CAN_EDCBT_DRJW_MASK           (0x0f << CAN_EDCBT_DRJW_SHIFT)
                                                /* Bits 26-31: Reserved */

/* Enhanced Transceiver Delay Compensation (ETDC) */

#define CAN_ETDC_ETDCVAL_SHIFT        (0)       /* Bits 0-7: Enhanced Transceiver Delay Compensation Value (ETDCVAL) */
#define CAN_ETDC_ETDCVAL_MASK         (0xff << CAN_ETDC_ETDCVAL_SHIFT)
                                                /* Bits 8-14: Reserved */
#define CAN_ETDC_ETDCFAIL             (1 << 15) /* Bit 15: Transceiver Delay Compensation Fail (ETDCFAIL) */
#define CAN_ETDC_ETDCOFF_SHIFT        (16)      /* Bits 16-22: Enhanced Transceiver Delay Compensation Offset (ETDCOFF) */
#define CAN_ETDC_ETDCOFF_MASK         (0x7f << CAN_ETDC_ETDCOFF_SHIFT)
                                                /* Bits 23-29: Reserved */
#define CAN_ETDC_TDMDIS               (1 << 30) /* Bit 30: Transceiver Delay Measurement Disable (TDMDIS) */
#define CAN_ETDC_ETDCEN               (1 << 31) /* Bit 31: Transceiver Delay Compensation Enable (ETDCEN) */

/* CAN FD Control register (FDCTRL) */

#define CAN_FDCTRL_TDCVAL_SHIFT       (0)       /* Bits 0-5: Transceiver Delay Compensation Value (TDCVAL) */
#define CAN_FDCTRL_TDCVAL_MASK        (0x3f << CAN_FDCTRL_TDCVAL_SHIFT)
#define CAN_FDCTRL_TDCVAL(x)          (((x) << CAN_FDCTRL_TDCVAL_SHIFT) & CAN_FDCTRL_TDCVAL_MASK)
                                                /* Bits 6-7: Reserved */
#define CAN_FDCTRL_TDCOFF_SHIFT       (8)       /* Bits 8-12: Transceiver Delay Compensation Offset (TDCOFF) */
#define CAN_FDCTRL_TDCOFF_MASK        (0x1f << CAN_FDCTRL_TDCOFF_SHIFT)
#define CAN_FDCTRL_TDCOFF(x)          (((x) << CAN_FDCTRL_TDCOFF_SHIFT) & CAN_FDCTRL_TDCOFF_MASK)
                                                /* Bit 13: Reserved */
#define CAN_FDCTRL_TDCFAIL            (1 << 14) /* Bit 14: Transceiver Delay Compensation Fail (TDCFAIL) */
#define CAN_FDCTRL_TDCEN              (1 << 15) /* Bit 15: Transceiver Delay Compensation Enable (TDCEN) */
#define CAN_FDCTRL_MBDSR0_SHIFT       (16)      /* Bits 16-17: Message Buffer Data Size for Region 0 (MBDSR0) */
#define CAN_FDCTRL_MBDSR0_MASK        (0x03 << CAN_FDCTRL_MBDSR0_SHIFT)
#define CAN_FDCTRL_MBDSR0(x)          (((x) << CAN_FDCTRL_MBDSR0_SHIFT) & CAN_FDCTRL_MBDSR0_MASK)
                                                /* Bit 18: Reserved */
#define CAN_FDCTRL_MBDSR1_SHIFT       (19)      /* Bits 19-20: Message Buffer Data Size for Region 1 (MBDSR1) */
#define CAN_FDCTRL_MBDSR1_MASK        (0x03 << CAN_FDCTRL_MBDSR1_SHIFT)
#define CAN_FDCTRL_MBDSR1(x)          (((x) << CAN_FDCTRL_MBDSR1_SHIFT) & CAN_FDCTRL_MBDSR1_MASK)
                                                /* Bit 21: Reserved */
#define CAN_FDCTRL_MBDSR2_SHIFT       (22)      /* Bits 22-23: Message Buffer Data Size for Region 2 (MBDSR2) */
#define CAN_FDCTRL_MBDSR2_MASK        (0x03 << CAN_FDCTRL_MBDSR2_SHIFT)
#define CAN_FDCTRL_MBDSR2(x)          (((x) << CAN_FDCTRL_MBDSR2_SHIFT) & CAN_FDCTRL_MBDSR2_MASK)
                                                /* Bits 24-30: Reserved */
#define CAN_FDCTRL_FDRATE             (1 << 31) /* Bit 31: Bit Rate Switch Enable (FDRATE) */

/* CAN FD Bit Timing Register (FDCBT) */

