apache/nuttx/arch/arm/src/s32k3xx/hardware/s32k3xx_flexcan.h
#define CAN_FDCBT_FPSEG2_SHIFT        (0)       /* Bits 0-2: Fast Phase Segment 2 (FPSEG2) */
#define CAN_FDCBT_FPSEG2_MASK         (0x07 << CAN_FDCBT_FPSEG2_SHIFT)
#define CAN_FDCBT_FPSEG2(x)           (((x) << CAN_FDCBT_FPSEG2_SHIFT) & CAN_FDCBT_FPSEG2_MASK)
                                                /* Bits 3-4: Reserved */
#define CAN_FDCBT_FPSEG1_SHIFT        (5)       /* Bits 5-7: Fast Phase Segment 1 (FPSEG1) */
#define CAN_FDCBT_FPSEG1_MASK         (0x07 << CAN_FDCBT_FPSEG1_SHIFT)
#define CAN_FDCBT_FPSEG1(x)           (((x) << CAN_FDCBT_FPSEG1_SHIFT) & CAN_FDCBT_FPSEG1_MASK)
                                                /* Bits 8-9: Reserved */
#define CAN_FDCBT_FPROPSEG_SHIFT      (10)      /* Bits 10-14: Fast Propagation Segment (FPROPSEG) */
#define CAN_FDCBT_FPROPSEG_MASK       (0x1f << CAN_FDCBT_FPROPSEG_SHIFT)
#define CAN_FDCBT_FPROPSEG(x)         (((x) << CAN_FDCBT_FPROPSEG_SHIFT) & CAN_FDCBT_FPROPSEG_MASK)
                                                /* Bit 15: Reserved */
#define CAN_FDCBT_FRJW_SHIFT          (16)      /* Bits 16-18: Fast Resync Jump Width (FRJW) */
#define CAN_FDCBT_FRJW_MASK           (0x07 << CAN_FDCBT_FRJW_SHIFT)
#define CAN_FDCBT_FRJW(x)             (((x) << CAN_FDCBT_FRJW_SHIFT) & CAN_FDCBT_FRJW_MASK)
                                                /* Bit 19: Reserved */
#define CAN_FDCBT_FPRESDIV_SHIFT      (20)      /* Bits 20-29: Fast Prescaler Division Factor (FPRESDIV) */
#define CAN_FDCBT_FPRESDIV_MASK       (0x03ff << CAN_FDCBT_FPRESDIV_SHIFT)
#define CAN_FDCBT_FPRESDIV(x)         (((x) << CAN_FDCBT_FPRESDIV_SHIFT) & CAN_FDCBT_FPRESDIV_MASK)
                                                /* Bits 30-31: Reserved */

/* CAN FD CRC Register (FDCRC) */

#define CAN_FDCRC_FD_TXCRC_SHIFT      (0)       /* Bits 0-20: Extended Transmitted CRC value (FD_TXCRC) */
#define CAN_FDCRC_FD_TXCRC_MASK       (0x1fffff << CAN_FDCRC_FD_TXCRC_SHIFT)
#define CAN_FDCRC_FD_TXCRC(x)         (((x) << CAN_FDCRC_FD_TXCRC_SHIFT) & CAN_FDCRC_FD_TXCRC_MASK)
                                                /* Bits 21-23: Reserved */
#define CAN_FDCRC_FD_MBCRC_SHIFT      (24)      /* Bits 24-30: CRC Mailbox Number for FD_TXCRC (FD_MBCRC) */
#define CAN_FDCRC_FD_MBCRC_MASK       (0x7f << CAN_FDCRC_FD_MBCRC_SHIFT)
#define CAN_FDCRC_FD_MBCRC(x)         (((x) << CAN_FDCRC_FD_MBCRC_SHIFT) & CAN_FDCRC_FD_MBCRC_MASK)
                                                /* Bit 31: Reserved */

/* Enhanced Rx FIFO Control Register (ERFCR) */

#define CAN_ERFCR_ERFWM_SHIFT         (0)       /* Bits 0-4: Enhanced Rx FIFO Watermark (ERFWM) */
#define CAN_ERFCR_ERFWM_MASK          (0x1f << CAN_ERFCR_ERFWM_SHIFT)
                                                /* Bits 5-7: Reserved */
#define CAN_ERFCR_NFE_SHIFT           (8)       /* Bits 8-13: Number of Enhanced Rx FIFO Filter Elements (NFE) */
#define CAN_ERFCR_NFE_MASK            (0x3f << CAN_ERFCR_NFE_SHIFT)
                                                /* Bits 14-15: Reserved */
#define CAN_ERFCR_NEXIF_SHIFT         (16)      /* Bits 16-22: Number of Extended ID Filter Elements (NEXIF) */
#define CAN_ERFCR_NEXIF_MASK          (0x7f << CAN_ERFCR_NEXIF_SHIFT)
                                                /* Bits 23-25: Reserved */
#define CAN_ERFCR_DMALW_SHIFT         (26)      /* Bits 26-30: DMA Last Word (DMALW) */
#define CAN_ERFCR_DMALW_MASK          (0x1f << CAN_ERFCR_DMALW_SHIFT)
                                                /* Bit 31: Reserved */

/* Enhanced Rx FIFO Interrupt Enable Register (ERFIER) */

                                                    /* Bits 0-27: Reserved */
#define CAN_ERFIER_ERFDAIE            (1 << 28) /* Bit 28: Enhanced Rx FIFO Data Available Interrupt Enable (ERFDAIE) */
#define CAN_ERFIER_ERFWMIIE           (1 << 29) /* Bit 29: Enhanced Rx FIFO Watermark Indication Interrupt Enable (ERFWMIIE) */
#define CAN_ERFIER_ERFOVFIE           (1 << 30) /* Bit 30: Enhanced Rx FIFO Overflow Interrupt Enable (ERFOVFIE) */
#define CAN_ERFIER_ERFUFWIE           (1 << 31) /* Bit 31: Enhanced Rx FIFO Underflow Interrupt Enable (ERFUFWIE) */

/* Enhanced Rx FIFO Status Register (ERFSR) */

#define CAN_ERFSR_ERFEL_SHIFT         (0)       /* Bits 0-5: Enhanced Rx FIFO Elements (ERFEL) */
#define CAN_ERFSR_ERFEL_MASK          (0x3f << CAN_ERFSR_ERFEL_SHIFT)
                                                /* Bits 6-15: Reserved */
#define CAN_ERFSR_ERFF                (1 << 16) /* Bit 16: Enhanced Rx FIFO Full (ERFF) */
#define CAN_ERFSR_ERFE                (1 << 17) /* Bit 17: Enhanced Rx FIFO Empty (ERFE) */
                                                /* Bits 18-26: Reserved */
#define CAN_ERFSR_ERFCLR              (1 << 27) /* Bit 27: Enhanced Rx FIFO Clear (ERFCLR) */
#define CAN_ERFSR_ERFDA               (1 << 28) /* Bit 28: Enhanced Rx FIFO Data Available (ERFDA) */
#define CAN_ERFSR_ERFWMI              (1 << 29) /* Bit 29: Enhanced Rx FIFO Watermark Indication (ERFWMI) */
#define CAN_ERFSR_ERFOVF              (1 << 30) /* Bit 30: Enhanced Rx FIFO Overflow (ERFOVF) */
#define CAN_ERFSR_ERFUFW              (1 << 31) /* Bit 31: Enhanced Rx FIFO Underflow (ERFUFW) */

/* High Resolution Time Stamp n (HR_TIME_STAMPn) */

#define CAN_HR_TIME_STAMP_TS_SHIFT    (0)       /* Bits 0-31: High Resolution Time Stamp (TS) */
#define CAN_HR_TIME_STAMP_TS_MASK     (0xffffffff << CAN_HR_TIME_STAMP_TS_SHIFT)

/* Enhanced Rx FIFO Filter Element n (ERFFELn) */

#define CAN_ERFFEL_FEL_SHIFT          (0)       /* Bits 0-31: Filter Element Bits (FEL) */
#define CAN_ERFFEL_FEL_MASK           (0xffffffff << CAN_ERFFEL_FEL_SHIFT)

/* CAN MB TX codes */
#define CAN_TXMB_INACTIVE             0x8       /* MB is not active. */
#define CAN_TXMB_ABORT                0x9       /* MB is aborted. */
#define CAN_TXMB_DATAORREMOTE         0xc       /* MB is a TX Data Frame(when MB RTR = 0) or */
                                                /* MB is a TX Remote Request Frame (when MB RTR = 1). */
#define CAN_TXMB_TANSWER              0xe       /* MB is a TX Response Request Frame from */
                                                /* an incoming Remote Request Frame. */
#define CAN_TXMB_NOTUSED              0xf       /* Not used.*/

#endif /* __ARCH_ARM_SRC_S32K3XX_HARDWARE_S32K3XX_CAN_H */
